{
  "Marc Bolan": {
    "Stoke Newington": {
      "https://www.hackneygazette.co.uk/news/22938176.he-got-expelled-nutting-teacher-friends-glam-rock-icon-marc-bolan-look-back-40th-anniversary-death/": {
        "title": "Friends of glam rock icon Marc Bolan look back on 40th ...",
        "text": "16 Sept 2017 — Marc Bolan holding a 1968 Gibson Flying V guitar which he used during a ... But before all that he was Mark Feld, of Stoke Newington Common ...",
        "google search terms": [
          "Stoke Newington",
          "T Rex",
          "Tyrannosaurus Rex",
          "Hackney",
          "Jewish"
        ],
        "image search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld",
          "Rolan",
          "Bolan",
          "Newington",
          "dyslexia",
          "Glam Rock",
          "Jewish",
          "songwriter"
        ],
        "page search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld"
        ],
        "page_text_snippets": [
          "‘He got expelled for nutting the teacher’: Friends of glam rock icon Marc Bolan look back on 40th anniversary of his death | Hackney Gazette|Newsletters|Jobs|Homes|Motoring|Local Listings|Local Info|Book An Ad|More|Newsletters|Jobs|Homes|Motoring|Local Listings|Local Info|Book An Ad|E-editions|Sign in|Close|Search|News|Crime|Traffic & Travel|Local Council|Business|Weather|Health|Housing|Education|Obituaries|UK News|Sport|UK Sport News|Things to do|Local Events|Days Out|Food & Drink|UK Entertainment News|Lifestyle|Property|Heritage|Property|Announcements|Acknowledgements|Death Notices|In Memoriam|Public notices|Other announcements|E-editions|Newsletters|Jobs|Homes|Motoring|Local Listings|Local Info|Book An Ad|News|Sport|Things to do|Lifestyle|Property|Announcements|More|News|Crime|Traffic & Travel|Local Council|Business|Weather|Health|Housing|Education|Obituaries|UK News|‘He got expelled for nutting the teacher’: Friends of glam rock icon Marc Bolan look back on 40th anniversary of his death|‘He got expelled for nutting the teacher’: Friends of glam rock icon Marc Bolan look back on 40th anniversary of his death|By \n            Sam Gelder|Share|Comments|Marc Bolan holding a 1968 Gibson Flying V guitar which he used during a 1972 Top Of The Pops performance of Get It On. Picture: Keith Morris/PA Archive|(Image: PA Archive/PA Images)|“I was always a star, even if it was only being the star of three streets in Hackney,” Marc Bolan reportedly used to quip.|Marc Bolan pictured with his girlfriend, American singer Gloria Jones, at a party thrown by Rod Stewart in June 1976. Picture: PA Archive|(Image: PA Archive/PA Images)|The sequined glam rock god sold millions of records with T. Rex thanks to his innovative take on rock ‘n’ roll and legendary Top of the Pops performances that captured the hearts and ears of teenagers everywhere.|But before all that he was Mark Feld, of Stoke Newington Common – number 25, if you want to see the plaque – a smartly-dressed mod who could often be seen at Stamford Hill’s bowling alley and the arcade known as “the schtip” (a Yiddish word meaning “taking money”).",
          "|Born at Hackney General Hospital on September 30, 1947, Mark – and his brother Harry – attended nearby Northwold Primary School, where he formed his first skiffle band aged nine.",
          "|Miki Simmonds (left), Peter Sugar and Mark Feld, later Marc Bolan, in a photo from 1962 supplied by Hackney Museum to coincide with a 2012 exhibition. Picture: Town Magazine/Don McCullin",
          "|“I’ve got a friend who went out with him for a few weeks and he used to send her poems. The teacher caught him one day and turned round to Mark and said: ‘You’re never gonna make anything of yourself.’”",
          "|“And then he got expelled. He’d done something wrong and he went to see the headmaster, or the deputy headmaster, Mr Pearson. He said he was going to give him the cane and Mark said no. He told him to hold out his hand and Mark nutted him.”"
        ],
        "image_links": []
      }
    }
  }
}