{
  "Marc Bolan": {
    "T Rex": {
      "https://groovyhistory.com/glam-rock-marc-bolan-t-rex": {
        "title": "The Night Marc Bolan (T. Rex) Made Glam Rock The Next ...",
        "text": "For his first appearance on the British music show Top of the Pops Marc Bolan of T. Rex smeared a little glitter beneath his eyes and put on a silver silk ...",
        "google search terms": [
          "Stoke Newington",
          "T Rex",
          "Tyrannosaurus Rex",
          "Hackney",
          "Jewish"
        ],
        "image search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld",
          "Rolan",
          "Bolan",
          "Newington",
          "dyslexia",
          "Glam Rock",
          "Jewish",
          "songwriter"
        ],
        "page search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld"
        ],
        "page_text_snippets": [
          "Tony Visconti on T.Rex and the birth of glam: \"People were ready for Marc\" - UNCUT|News|Features|Reviews|Music|Film|Magazine|Subscribe|Single Issues|Digital Editions|Newsletter|Search|Subscribe|Advertisement|News|Features|Reviews|Music|Film|Magazine|Subscribe|Single Issues|Digital Editions|Newsletter|Search|Advertisement|News|Features|Reviews|Music|Film|Magazine|Subscribe|Single Issues|Digital Editions|Newsletter|Search|Features|Tony Visconti on T.Rex and the birth of glam: “People were ready for Marc”|Tracing Bolan's journey from \"The Wizard\" to \"Hot Love\" in the new issue of Uncut|By|John Robinson|5th June 2020|Share|Facebook|Twitter|Pinterest|WhatsApp|Trending Now|Features|Nick Hasted|-|The Making Of “Common People” by Pulp|Blogs|Mark Beaumont|-|Uncut’s 5 Glastonbury 2023 highlights|Album|Pete Paphides|-|Lloyd Cole – On Pain|News|Sam Richards|-|The Jesus And Mary Chain unveil new live album, Sunset 666|News|Michael Bonner|-|Hear Modern Nature’s expansive new 7-minute track, “Murmuration”|The latest issue of|Uncut|– in shops now and|available to buy online by clicking here|– includes the colourful tale of|Marc Bolan’s|transformation from hippie duckling to glam-rock swan, as he cast aside sidemen, managers, loyal supporters, and the ‘Tyrannosaurus’ name on his quest for mass appeal with|T.Rex|. Long-time producer|Tony Visconti|, friends and former associates relate for|John Robinson|the triumph of one of music’s most complex characters as he ushered in the glam rock era. Here’s an extract:|The broadcaster|Bob Harris|saw|Marc Bolan|become the king of glam rock from the back of a car in Glasgow, in the spring of 1971. After the No 1 success of “Hot Love”, this was a tour on which he witnessed scenes otherwise familiar only from footage of Beatlemania: police escorts, crushed cars, stampeding fans.|“The first gig was Portsmouth Guildhall,” remembers|Harris|, then acting as|T.Rex’s|tour support and MC. “The band finished their set, and we were hanging out. We realised there was a lot of noise in the street – the whole crowd was round the backstage door. Local police had arrived. The whole place was surrounded by girls with scissors trying to get locks of Marc’s hair. What I remember is a lot of stainless steel flashing around at eye level. It was madness!”"
        ],
        "image_links": []
      }
    }
  }
}