{
  "Marc Bolan": {
    "T Rex": {
      "https://www.guitarworld.com/features/tony-visconti-remembers-marc-bolan-t-rex": {
        "title": "Tony Visconti reflects on the genius of T. Rex's Marc Bolan",
        "text": "20 Jul 2021 — Mark is a freelance writer with particular expertise in the fields of '70s glam, punk, rockabilly and classic '50s rock and roll. He sings and ...",
        "google search terms": [
          "Stoke Newington",
          "T Rex",
          "Tyrannosaurus Rex",
          "Hackney",
          "Jewish"
        ],
        "image search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld",
          "Rolan",
          "Bolan",
          "Newington",
          "dyslexia",
          "Glam Rock",
          "Jewish",
          "songwriter"
        ],
        "page search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld"
        ],
        "page_text_snippets": [
          "Tony Visconti reflects on the genius of T. Rex's Marc Bolan | Guitar World|Skip to main content|Open menu|Close menu|Guitar World|Guitar World|Search|Search Guitar World|Sign in|View Profile|Sign out|Subscribe|Guitar Magazine Subscriptions|Why subscribe?|OUR SUMMER SALE IS HERE! SUBSCRIBE TO YOUR FAVOURITE MAGAZINE!|Every issue delivered direct to your door|Or treat someone you love to the gift that keeps on giving!|From|£9.99|View|News|Features|Lessons|Reviews|Buyer's guides|Store|Subscribe|Australian Guitar|Guitarist|Total Guitar|Guitar Techniques|Bass Player|Trending|Prime Day guitar deals|Back to the Future nearly featured a Strat|Joe Bonamassa/Brad Paisley July 4th jam|The technique quirk Wolfgang inherited from EVH|When you purchase through links on our site, we may earn an affiliate commission.|Here’s how it works|.|Home|Features|Tony Visconti reflects on the genius of T. Rex's Marc Bolan|By|Mark McStea|published|20 July 2021|“Marc is criminally underrated as a guitarist. All rock ’n’ rollers love T. Rex, and there’s a little bit of T. Rex in every rock ’n’ roll band”|(Image credit: Michael Ochs Archives/Getty Images)|2021 sees the 50th anniversary of the release of|Electric Warrior|in 1971, for many the ultimate T. Rex album and the perfect encapsulation of Marc Bolan’s genius. Having spent years toiling away on the club and festival circuit with his acoustic duo, Tyrannosaurus Rex, Bolan fully embraced the sound of|electric guitar|and the spirit of rock ’n’ roll to score his first hit with|Ride a White Swan|in 1970.|Its massive success turned Bolan into a global superstar, with incredible hit singles appearing every three months for the next three years. Most of the planet was in the grip of T. Rextasy, likened at the time to the fevered devotion of Beatlemania.|While the world was swooning over Bolan’s pin-up looks and killer hooks, the U.S. was strangely resistant, with Bolan’s only notable success being|Bang a Gong|in 1971. Bolan’s run of hits started to dry up in the mid-'70s as the punk era dawned in the U.K., but his influence was immense, to the point that he was one of the few acts that wasn’t subject to the “year zero”-style condemnation of so much that had preceded punk.",
          "|Electric Warrior|is packed with great moments. The guitar solo on|Mambo Sun|is classic Bolan, perfectly constructed and economical. Did he come prepared or work out his solos in the studio?|“He did both. Some were made up in the studio, and if you saw him play live, he could really improvise; he had no problem playing a 20-minute solo. [Laughs] He was a smart lad.|Mambo|was worked out at home, including the double-tracked part that was an octave lower.“|Bolan was very hip to the roots of rock ’n’ roll and rockabilly.|Jeepster|owes a huge debt to Howlin’ Wolf’s|You’ll Be Mine|, and|We Love to Boogie|borrows heavily from Webb Pierce’s|Teenage Boogie|, even lifting the solo. Who was influencing him?|“He was more of a blues guy than me. He listened to the early blues players a lot. We both loved R&B and Little Richard. Little Richard was a huge inspiration to Marc. Marc turned me on to James Burton, those great solos on the Ricky Nelson singles. I’d always loved those records but I’d never known the guitarist’s name. Marc was definitely very knowledgeable.“|For Cosmic Dancer I had about 25 string players. We had the budget because we had the hit|Your string arrangements are an essential component of the T. Rex sound. The strings on|Cosmic Dancer|are a great piece of music in their own right. What was the collaborative process?|“Marc recognized my string writing early in the Tyrannosaurus Rex days and that was my domain exclusively; he wouldn’t question anything or have any suggestions. What he loved was that I would pick up on his riffs and some of his solos and use some of those ideas in the arrangements. For|Cosmic Dancer|I had about 25 string players. We had the budget because we had the hit, of course.|“I was trained classically; I’m a classical guitarist and I studied some writing at school, but I was largely self-taught. I’d have a reel-to-reel and fiddle around with my classical guitar and work the parts out then write them down. It took me ages to write those parts. Now I could do the arrangement for|Cosmic Dancer|in about three hours; at that time it might have taken three days.“|The strings set the T. Rex hits apart from their contemporaries, acts like Slade, Roxy Music and Bowie. They were almost a signature sound for T. Rex.|“We realized early on that it was a signature sound, as you say.|Bang a Gong|didn’t have a written string part. Marc wanted to go without the strings, but I said that as we’d had a few hits with strings already, maybe we should add some to this one, because, as you say, it was identifiable as his sound.|“This discussion was taking place while the string players were sitting in their seats. Marc looked slightly terrified at that remark. He said, 'Well, what can we do?' I simply asked the string players to all play the root note of the three chords in the chorus – G, A and E. It was so simple but it was very effective.“|(Image credit: Michael Putland/Getty Images)|Bolan’s solo on|Lean Woman Blues|is one of his strongest. His vibrato is very distinctive and reminds me of his vocal vibrato. He always seemed very confident in his abilities as a guitarist. Was that a fair assessment or was it bluff?|“He was unique; he was not bluffing. His technical knowledge guitar-wise was not great at all. He knew a handful of chords, the right ones, of course, for rock ’n’ roll. He invented his own technique with that very fast vibrato – he had very strong hands. I think you’re right in that it probably did go hand-in-hand with his fast vocal vibrato. He did actually woodshed for hours to get that good.|I suspect Hendrix was more aware of what he was doing than Marc was in terms of modality, I think because Hendrix understood jazz|“One thing that he did that was really weird was that he might be soloing in the key of E, but then he’d slide up three frets and be playing solos out of the G blues box. Some of those notes are modally not the correct notes but he just played with abandon. I think that explains some of his unusual note choices. Sometimes he’d perhaps even slide up another fret from the G position. It gave him almost a Hendrix sensibility; he really loved Hendrix.|“I suspect Hendrix was more aware of what he was doing than Marc was in terms of modality, I think because Hendrix understood jazz. Eric Clapton was another player Marc loved. June [Bolan’s wife] was Eric’s girlfriend before she met Marc. She took him to Clapton’s house for a weekend and Marc told me that he sat on the floor and watched Clapton play for the whole weekend. He said to me, 'I sat at the feet of the master.' He copped a lot of blues techniques from watching Clapton. He was a very quick learner.“|The groove of|Bang a Gong|is irresistible. Something often overlooked on this oft-covered song is the importance of the backing vocals.|“We all had a go at the backing vocals. Marc had the idea for Flo and Eddie to sing the chorus an octave higher. They cooked up that arrangement between the three of them. They were alumni of Zappa, and I think some of the oohs on the chorus may have come from their time with Frank. Marc and I loved old doo wop, as did Zappa.“|You’ve worked with many great guitarists over the years. How would you rate Marc in comparison?|“This is where Marc is different from all of the classic rock guitarists. He was cut from a different cloth; he invented himself. He had his own thing. To compare him to Ronson and Fripp and others I’ve worked with is difficult as his recording career was too narrow. Ronson worked with loads of other people so you get an idea of where he stood and how he could adapt his style. We can’t make that comparison for Marc because he never really played with other artists. Marc is criminally underrated as a guitarist. All rock ’n’ rollers love T. Rex, and there’s a little bit of T. Rex in every rock ’n’ roll band.“|We all knew he could play really fast and accurately and get a great tone out of whatever he played, but what he was doing was exactly the right thing for Ride a White Swan|I would argue that the most important thing for a guitarist to be is “effective,” to have the ability to deliver exactly what the song requires, regardless of how easy it might be to play. A prime example would be the solo on|Ride a White Swan|, Bolan’s breakthrough hit. He knew when to self-edit, didn’t he?|“Yes. We all knew he could play really fast and accurately and get a great tone out of whatever he played, but what he was doing was exactly the right thing for|Swan|. The hooky part was the key to its success and why it broke him through into the major leagues. The riff and solo is almost a Burton/Chet Atkins idea.|Swan|used a capo at the 4th fret so he could play those open string licks. He also played the bass part on my Precision and he again used the capo at the 4th fret as well.|The band members are often overlooked when T. Rex are discussed. Bass player Steve Currie never plays the obvious, predictable lines. His basslines are a key element to the propulsive nature of the rhythm section. Was much time spent working on those ideas in the studio?|“He was basically left to his own devices. I loved his playing. It was amazing. I can see where his jazz sensibilities came out. Steve would go to places where an average rock player would never venture and often made some simple music sound very complicated. He was one of the secret weapons of the T. Rex sound.“|You’ve produced many iconic albums. Where do you rate|Electric Warrior|?|“I think|Electric Warrior|is my favorite T. Rex album, partly because of the different ways we recorded and how we worked in a lot of studios – New York, LA and several in London. Marc was on tour so I had to catch him on the road to record. All the strings and mixing were done at Trident Studios in London. It took a lot of work to put the whole album together. I think it was a masterpiece, but I also like the following two albums,|The Slider|and|Tanx|, very much.“|I loved the fact that he dressed to record. He wore his stage gear and his platform shoes. He’d be jumping up and down like he was on stage|Fans will argue that Bolan was undergoing a creative revival at the time of his death. Do you think he could’ve gone on to revitalise himself in terms of creativity and ideas?|“I agree with everyone who says he died too young. In the last couple of years of his life, I think his image was very important to him; he wanted to appeal to the fans that he had who had been teenyboppers, but who were now older. Had he lived I think he would have found someone like myself, or we’d have gotten together again. We did speak to each other after we stopped working together and it was always big hugs and talking about our kids. It was in the cards that we’d do something else.“|What are your fondest memories of working with Marc?|“I loved that the sessions were very live. I also loved the fact that he dressed to record. He wore his stage gear and his platform shoes. He’d be jumping up and down like he was on stage; everything was really great fun. We also invited friends to the sessions, so he liked to see maybe five or six people bouncing about in the control room. He always loved an audience.“|Thank you for reading 5 articles this month*|Join now for unlimited access|US pricing $3.99 per month or $39.00 per year|UK pricing £2.99 per month or £29.00 per year|Europe pricing €3.49 per month or €34.00 per year|Join now|Already have an account ?|Sign in here|*Read 5 free articles per month without a subscription|Join now for unlimited access|Prices from £2.99/$3.99/€3.49|Join now|Already have an account ?|Sign in here|Get The Pick Newsletter|All the latest guitar news, interviews, lessons, reviews, deals and more, direct to your inbox!|Contact me with news and offers from other Future brands|Receive email from us on behalf of our trusted partners or sponsors|By submitting your information you agree to the|Terms & Conditions|and|Privacy Policy|and are aged 16 or over.|Mark McStea|Social Links Navigation|Mark is a freelance writer with particular expertise in the fields of ‘70s glam, punk, rockabilly and classic ‘50s rock and roll. He sings and plays guitar in his own musical project, Star Studded Sham, which has been described as sounding like the hits of T. Rex and Slade as played by Johnny Thunders. He had several indie hits with his band, Private Sector and has worked with a host of UK punk luminaries. Mark also presents themed radio shows for Generating Steam Heat. He has just completed his first novel,|The Bulletproof Truth|, and is currently working on the sequel.|More features|Fretted vs. fretless bass: What’s the difference?|Oddball studio experiments, going “full Spinal tap,” and “stinky riffs“: how Tigercub’s Jamie Hall is bringing bonkers guitar to the mainstream|Latest|“This is huge”: Josh Scott says this new $99 drive pedal is “better than the Bad Monkey”|See more latest|►|Most Popular|Best Yamaha acoustic guitars 2023: our pick of Yamaha acoustics to suit all players|By|Chris Corfield|2 July 2023|A complete rundown of the guitar gear Zakk Wylde has been using with Pantera|By|Nick Bowcott|2 July 2023|Deon Estus moved to Dublin to play with Phil Lynott. He ended up giving George Michael (and Wham!) groove|By|Mike Brooks|2 July 2023|“On the fretted bass we call it the slap stopper!” What is a finger ramp and why should you use one?|By|Nick Wells|1 July 2023|Best punk guitars 2023: straight-shooting, no-nonsense guitars for punk|By|Daryl Robertson|1 July 2023|\"I'd sweat so much I had to test my basses by dunking them in water!\" True story: Jason Newsted sweated so much with Metallica that his basses would short-circuit|By|Scott Malandrone|30 June 2023|“When I got the Strat, I was like, ‘The bitch is back!’”: Why Palehound’s El Kempner is re-embracing solos – and the Stratocaster – on one of 2023’s essential indie-rock releases|By|Cheri Amour|30 June 2023|Alter Bridge's Myles Kennedy: 10 guitarists who shaped my sound|By|Andrew Daly|30 June 2023|Keith Richards and Eric Clapton worshipped her solos, and Elvis idolized her sound: how Sister Rosetta Tharpe became an electric guitar trailblazer|By|Denny Ilett|29 June 2023|Christian themes, riffs as pretty as they are violent and chords above the 12th fret: how Liturgy’s Haela Ravenna Hunt-Hendrix is radically warping black metal conventions|By|Jon Wiederhorn|29 June 2023|This unassuming guitar teacher’s epic America’s Got Talent audition went viral. Here’s how he landed – and nailed – the gig of a lifetime|By|Amit Sharma|29 June 2023|MORE FROM GUITARWORLD...|1|“This is huge”: Josh Scott says this new $99 drive pedal is “better than the Bad Monkey”|2|Get on this cloud: KMA Machines just gave its Cirrus reverb and delay pedal a limited edition, super-stealth makeover|3|Fretted vs. fretless bass: What’s the difference?|4|AIRD drop: Boss’ new ME-90 multi-fx loses COSM amp sims in favor of the firm’s flagship modeling tech|5|Cornerstone asked players for pedal ideas – and turned their two-in-one Klon/Bluesbreaker stompbox dreams into a reality|Guitar Magazine Subscriptions|●|OUR SUMMER SALE IS HERE! SUBSCRIBE TO YOUR FAVOURITE MAGAZINE!|From|£9.99|View|Guitar World is part of Future plc, an international media group and leading digital publisher.|Visit our corporate site|.|Terms and conditions|Contact Future's experts|Privacy policy|Cookies policy|Accessibility Statement|Subscribe|About us|Careers|©\nFuture Publishing Limited Quay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885.",
          "Tony Visconti reflects on the genius of T. Rex's Marc Bolan | Guitar World|Skip to main content|Open menu|Close menu|Guitar World|Guitar World|Search|Search Guitar World|Sign in|View Profile|Sign out|Subscribe|Guitar Magazine Subscriptions|Why subscribe?|OUR SUMMER SALE IS HERE! SUBSCRIBE TO YOUR FAVOURITE MAGAZINE!|Every issue delivered direct to your door|Or treat someone you love to the gift that keeps on giving!|From|£9.99|View|News|Features|Lessons|Reviews|Buyer's guides|Store|Subscribe|Australian Guitar|Guitarist|Total Guitar|Guitar Techniques|Bass Player|Trending|Prime Day guitar deals|Back to the Future nearly featured a Strat|Joe Bonamassa/Brad Paisley July 4th jam|The technique quirk Wolfgang inherited from EVH|When you purchase through links on our site, we may earn an affiliate commission.|Here’s how it works|.|Home|Features|Tony Visconti reflects on the genius of T. Rex's Marc Bolan|By|Mark McStea|published|20 July 2021|“Marc is criminally underrated as a guitarist. All rock ’n’ rollers love T. Rex, and there’s a little bit of T. Rex in every rock ’n’ roll band”|(Image credit: Michael Ochs Archives/Getty Images)|2021 sees the 50th anniversary of the release of|Electric Warrior|in 1971, for many the ultimate T. Rex album and the perfect encapsulation of Marc Bolan’s genius. Having spent years toiling away on the club and festival circuit with his acoustic duo, Tyrannosaurus Rex, Bolan fully embraced the sound of|electric guitar|and the spirit of rock ’n’ roll to score his first hit with|Ride a White Swan|in 1970.|Its massive success turned Bolan into a global superstar, with incredible hit singles appearing every three months for the next three years. Most of the planet was in the grip of T. Rextasy, likened at the time to the fevered devotion of Beatlemania.|While the world was swooning over Bolan’s pin-up looks and killer hooks, the U.S. was strangely resistant, with Bolan’s only notable success being|Bang a Gong|in 1971. Bolan’s run of hits started to dry up in the mid-'70s as the punk era dawned in the U.K., but his influence was immense, to the point that he was one of the few acts that wasn’t subject to the “year zero”-style condemnation of so much that had preceded punk.",
          "|Electric Warrior|is packed with great moments. The guitar solo on|Mambo Sun|is classic Bolan, perfectly constructed and economical. Did he come prepared or work out his solos in the studio?|“He did both. Some were made up in the studio, and if you saw him play live, he could really improvise; he had no problem playing a 20-minute solo. [Laughs] He was a smart lad.|Mambo|was worked out at home, including the double-tracked part that was an octave lower.“|Bolan was very hip to the roots of rock ’n’ roll and rockabilly.|Jeepster|owes a huge debt to Howlin’ Wolf’s|You’ll Be Mine|, and|We Love to Boogie|borrows heavily from Webb Pierce’s|Teenage Boogie|, even lifting the solo. Who was influencing him?|“He was more of a blues guy than me. He listened to the early blues players a lot. We both loved R&B and Little Richard. Little Richard was a huge inspiration to Marc. Marc turned me on to James Burton, those great solos on the Ricky Nelson singles. I’d always loved those records but I’d never known the guitarist’s name. Marc was definitely very knowledgeable.“|For Cosmic Dancer I had about 25 string players. We had the budget because we had the hit|Your string arrangements are an essential component of the T. Rex sound. The strings on|Cosmic Dancer|are a great piece of music in their own right. What was the collaborative process?|“Marc recognized my string writing early in the Tyrannosaurus Rex days and that was my domain exclusively; he wouldn’t question anything or have any suggestions. What he loved was that I would pick up on his riffs and some of his solos and use some of those ideas in the arrangements. For|Cosmic Dancer|I had about 25 string players. We had the budget because we had the hit, of course.|“I was trained classically; I’m a classical guitarist and I studied some writing at school, but I was largely self-taught. I’d have a reel-to-reel and fiddle around with my classical guitar and work the parts out then write them down. It took me ages to write those parts. Now I could do the arrangement for|Cosmic Dancer|in about three hours; at that time it might have taken three days.“|The strings set the T. Rex hits apart from their contemporaries, acts like Slade, Roxy Music and Bowie. They were almost a signature sound for T. Rex.|“We realized early on that it was a signature sound, as you say.|Bang a Gong|didn’t have a written string part. Marc wanted to go without the strings, but I said that as we’d had a few hits with strings already, maybe we should add some to this one, because, as you say, it was identifiable as his sound.|“This discussion was taking place while the string players were sitting in their seats. Marc looked slightly terrified at that remark. He said, 'Well, what can we do?' I simply asked the string players to all play the root note of the three chords in the chorus – G, A and E. It was so simple but it was very effective.“|(Image credit: Michael Putland/Getty Images)|Bolan’s solo on|Lean Woman Blues|is one of his strongest. His vibrato is very distinctive and reminds me of his vocal vibrato. He always seemed very confident in his abilities as a guitarist. Was that a fair assessment or was it bluff?|“He was unique; he was not bluffing. His technical knowledge guitar-wise was not great at all. He knew a handful of chords, the right ones, of course, for rock ’n’ roll. He invented his own technique with that very fast vibrato – he had very strong hands. I think you’re right in that it probably did go hand-in-hand with his fast vocal vibrato. He did actually woodshed for hours to get that good.|I suspect Hendrix was more aware of what he was doing than Marc was in terms of modality, I think because Hendrix understood jazz|“One thing that he did that was really weird was that he might be soloing in the key of E, but then he’d slide up three frets and be playing solos out of the G blues box. Some of those notes are modally not the correct notes but he just played with abandon. I think that explains some of his unusual note choices. Sometimes he’d perhaps even slide up another fret from the G position. It gave him almost a Hendrix sensibility; he really loved Hendrix.|“I suspect Hendrix was more aware of what he was doing than Marc was in terms of modality, I think because Hendrix understood jazz. Eric Clapton was another player Marc loved. June [Bolan’s wife] was Eric’s girlfriend before she met Marc. She took him to Clapton’s house for a weekend and Marc told me that he sat on the floor and watched Clapton play for the whole weekend. He said to me, 'I sat at the feet of the master.' He copped a lot of blues techniques from watching Clapton. He was a very quick learner.“|The groove of|Bang a Gong|is irresistible. Something often overlooked on this oft-covered song is the importance of the backing vocals.|“We all had a go at the backing vocals. Marc had the idea for Flo and Eddie to sing the chorus an octave higher. They cooked up that arrangement between the three of them. They were alumni of Zappa, and I think some of the oohs on the chorus may have come from their time with Frank. Marc and I loved old doo wop, as did Zappa.“|You’ve worked with many great guitarists over the years. How would you rate Marc in comparison?|“This is where Marc is different from all of the classic rock guitarists. He was cut from a different cloth; he invented himself. He had his own thing. To compare him to Ronson and Fripp and others I’ve worked with is difficult as his recording career was too narrow. Ronson worked with loads of other people so you get an idea of where he stood and how he could adapt his style. We can’t make that comparison for Marc because he never really played with other artists. Marc is criminally underrated as a guitarist. All rock ’n’ rollers love T. Rex, and there’s a little bit of T. Rex in every rock ’n’ roll band.“|We all knew he could play really fast and accurately and get a great tone out of whatever he played, but what he was doing was exactly the right thing for Ride a White Swan|I would argue that the most important thing for a guitarist to be is “effective,” to have the ability to deliver exactly what the song requires, regardless of how easy it might be to play. A prime example would be the solo on|Ride a White Swan|, Bolan’s breakthrough hit. He knew when to self-edit, didn’t he?|“Yes. We all knew he could play really fast and accurately and get a great tone out of whatever he played, but what he was doing was exactly the right thing for|Swan|. The hooky part was the key to its success and why it broke him through into the major leagues. The riff and solo is almost a Burton/Chet Atkins idea.|Swan|used a capo at the 4th fret so he could play those open string licks. He also played the bass part on my Precision and he again used the capo at the 4th fret as well.|The band members are often overlooked when T. Rex are discussed. Bass player Steve Currie never plays the obvious, predictable lines. His basslines are a key element to the propulsive nature of the rhythm section. Was much time spent working on those ideas in the studio?|“He was basically left to his own devices. I loved his playing. It was amazing. I can see where his jazz sensibilities came out. Steve would go to places where an average rock player would never venture and often made some simple music sound very complicated. He was one of the secret weapons of the T. Rex sound.“|You’ve produced many iconic albums. Where do you rate|Electric Warrior|?|“I think|Electric Warrior|is my favorite T. Rex album, partly because of the different ways we recorded and how we worked in a lot of studios – New York, LA and several in London. Marc was on tour so I had to catch him on the road to record. All the strings and mixing were done at Trident Studios in London. It took a lot of work to put the whole album together. I think it was a masterpiece, but I also like the following two albums,|The Slider|and|Tanx|, very much.“|I loved the fact that he dressed to record. He wore his stage gear and his platform shoes. He’d be jumping up and down like he was on stage|Fans will argue that Bolan was undergoing a creative revival at the time of his death. Do you think he could’ve gone on to revitalise himself in terms of creativity and ideas?|“I agree with everyone who says he died too young. In the last couple of years of his life, I think his image was very important to him; he wanted to appeal to the fans that he had who had been teenyboppers, but who were now older. Had he lived I think he would have found someone like myself, or we’d have gotten together again. We did speak to each other after we stopped working together and it was always big hugs and talking about our kids. It was in the cards that we’d do something else.“|What are your fondest memories of working with Marc?|“I loved that the sessions were very live. I also loved the fact that he dressed to record. He wore his stage gear and his platform shoes. He’d be jumping up and down like he was on stage; everything was really great fun. We also invited friends to the sessions, so he liked to see maybe five or six people bouncing about in the control room. He always loved an audience.“|Thank you for reading 5 articles this month*|Join now for unlimited access|US pricing $3.99 per month or $39.00 per year|UK pricing £2.99 per month or £29.00 per year|Europe pricing €3.49 per month or €34.00 per year|Join now|Already have an account ?|Sign in here|*Read 5 free articles per month without a subscription|Join now for unlimited access|Prices from £2.99/$3.99/€3.49|Join now|Already have an account ?|Sign in here|Get The Pick Newsletter|All the latest guitar news, interviews, lessons, reviews, deals and more, direct to your inbox!|Contact me with news and offers from other Future brands|Receive email from us on behalf of our trusted partners or sponsors|By submitting your information you agree to the|Terms & Conditions|and|Privacy Policy|and are aged 16 or over.|Mark McStea|Social Links Navigation|Mark is a freelance writer with particular expertise in the fields of ‘70s glam, punk, rockabilly and classic ‘50s rock and roll. He sings and plays guitar in his own musical project, Star Studded Sham, which has been described as sounding like the hits of T. Rex and Slade as played by Johnny Thunders. He had several indie hits with his band, Private Sector and has worked with a host of UK punk luminaries. Mark also presents themed radio shows for Generating Steam Heat. He has just completed his first novel,|The Bulletproof Truth|, and is currently working on the sequel.|More features|Fretted vs. fretless bass: What’s the difference?|Oddball studio experiments, going “full Spinal tap,” and “stinky riffs“: how Tigercub’s Jamie Hall is bringing bonkers guitar to the mainstream|Latest|“This is huge”: Josh Scott says this new $99 drive pedal is “better than the Bad Monkey”|See more latest|►|Most Popular|Best Yamaha acoustic guitars 2023: our pick of Yamaha acoustics to suit all players|By|Chris Corfield|2 July 2023|A complete rundown of the guitar gear Zakk Wylde has been using with Pantera|By|Nick Bowcott|2 July 2023|Deon Estus moved to Dublin to play with Phil Lynott. He ended up giving George Michael (and Wham!) groove|By|Mike Brooks|2 July 2023|“On the fretted bass we call it the slap stopper!” What is a finger ramp and why should you use one?|By|Nick Wells|1 July 2023|Best punk guitars 2023: straight-shooting, no-nonsense guitars for punk|By|Daryl Robertson|1 July 2023|\"I'd sweat so much I had to test my basses by dunking them in water!\" True story: Jason Newsted sweated so much with Metallica that his basses would short-circuit|By|Scott Malandrone|30 June 2023|“When I got the Strat, I was like, ‘The bitch is back!’”: Why Palehound’s El Kempner is re-embracing solos – and the Stratocaster – on one of 2023’s essential indie-rock releases|By|Cheri Amour|30 June 2023|Alter Bridge's Myles Kennedy: 10 guitarists who shaped my sound|By|Andrew Daly|30 June 2023|Keith Richards and Eric Clapton worshipped her solos, and Elvis idolized her sound: how Sister Rosetta Tharpe became an electric guitar trailblazer|By|Denny Ilett|29 June 2023|Christian themes, riffs as pretty as they are violent and chords above the 12th fret: how Liturgy’s Haela Ravenna Hunt-Hendrix is radically warping black metal conventions|By|Jon Wiederhorn|29 June 2023|This unassuming guitar teacher’s epic America’s Got Talent audition went viral. Here’s how he landed – and nailed – the gig of a lifetime|By|Amit Sharma|29 June 2023|MORE FROM GUITARWORLD...|1|“This is huge”: Josh Scott says this new $99 drive pedal is “better than the Bad Monkey”|2|Get on this cloud: KMA Machines just gave its Cirrus reverb and delay pedal a limited edition, super-stealth makeover|3|Fretted vs. fretless bass: What’s the difference?|4|AIRD drop: Boss’ new ME-90 multi-fx loses COSM amp sims in favor of the firm’s flagship modeling tech|5|Cornerstone asked players for pedal ideas – and turned their two-in-one Klon/Bluesbreaker stompbox dreams into a reality|Guitar Magazine Subscriptions|●|OUR SUMMER SALE IS HERE! SUBSCRIBE TO YOUR FAVOURITE MAGAZINE!|From|£9.99|View|Guitar World is part of Future plc, an international media group and leading digital publisher.|Visit our corporate site|.|Terms and conditions|Contact Future's experts|Privacy policy|Cookies policy|Accessibility Statement|Subscribe|About us|Careers|©\nFuture Publishing Limited Quay House, The Ambury,\nBath\nBA1 1UA. All rights reserved. England and Wales company registration number 2008885."
        ],
        "image_links": [
          "https://cdn.mos.cms.futurecdn.net/nJGXLnMteyjZMg5fdegoni-320-80.jpg",
          "https://vanilla.futurecdn.net/guitarworld/media/img/missing-image.svg",
          "/media/img/missing-image.svg",
          "https://cdn.mos.cms.futurecdn.net/nJGXLnMteyjZMg5fdegoni-320-80.jpg",
          "https://vanilla.futurecdn.net/guitarworld/media/img/missing-image.svg",
          "/media/img/missing-image.svg",
          "https://cdn.mos.cms.futurecdn.net/nJGXLnMteyjZMg5fdegoni-320-80.jpg",
          "https://vanilla.futurecdn.net/guitarworld/media/img/missing-image.svg",
          "/media/img/missing-image.svg",
          "https://cdn.mos.cms.futurecdn.net/nJGXLnMteyjZMg5fdegoni-320-80.jpg",
          "https://vanilla.futurecdn.net/guitarworld/media/img/missing-image.svg",
          "/media/img/missing-image.svg"
        ]
      }
    }
  }
}