{
  "Marc Bolan": {
    "Stoke Newington": {
      "https://www.hangerlondon.com/marc-bolan-london/": {
        "title": "Marc Bolan's London House in Hackney: The Early Years",
        "text": "Marc Bolan, born Mark Feld on 30/9/1947 grew up in London's Stoke Newington and lived in this house at 25 Stoke Newington Common. Stoke Newington was an ...",
        "google search terms": [
          "Stoke Newington",
          "T Rex",
          "Tyrannosaurus Rex",
          "Hackney",
          "Jewish"
        ],
        "image search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld",
          "Rolan",
          "Bolan",
          "Newington",
          "dyslexia",
          "Glam Rock",
          "Jewish",
          "songwriter"
        ],
        "page search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld"
        ],
        "page_text_snippets": [
          "|The accident happened on a dark, blind spot section of the road. The car hit a tree with such force that it wrapped around the trunk, instantly killing Bolan. Jones was fortunate enough to survive the crash but sustained serious injuries, including a broken arm and jaw.|The news of Bolan’s tragic death shocked his fans and the music industry. Bolan was a charismatic and influential figure in the glam rock era of the 1970s, with hits like “Get It On” and “Telegram Sam” that made him a household name. He was just 29 years old at the time of his death.|The accident on Gipsy Lane highlighted the dangers of driving on poorly lit, rural roads. Bolan’s death also highlighted the importance of wearing seat belts, as it was later revealed that Bolan had not been wearing one at the time of the crash.|Despite the tragedy, Bolan’s music and legacy continue to inspire new generations of musicians and fans. The impact of his death was felt throughout the music industry, with artists like David Bowie paying tribute to his talent and influence.|Eerily Bolan did have some|premonitions|on how he would die, in a|car crash|Linked image from (|https://www.marc-bolan.net/members/index-2.html|)|Marc Bolan Shrine|There is a Marc Bolan Shrine, on the B306 not far from Barnes Rail station 10 gipsy lane London SW15 5RG.|Advertisements|S.E London Hypnotherapy Practice: Short Goodbye Message:|MULTI MODAL THERAPY:|Online & Locations of|Blackheath & Chistlehurst. (Cognitive, Behavioural, Hypnotherapy, Mindfulness etc.)|THERAPIST|: Former City Analyst, City of London, Singapore, Zurich and Frankfurt.|If you are seeking Therapy please reach out for an initial|free consultation call|.|Bohangar Hypnotherapy Practice. Hope you enjoy this blog post, would love to hear your comments|Free CONSULTATION|S.E London Hypnotherapy Practice: Welcome|-Bohangar Practice –|Seeking Multi Discpline Therapy?|Online &|Blackheath & Chistlehurst|Therapist|: Former City Analyst, Speciality Problem Simplification|Free CONSULTATION|Marc Bolan’s London House in Hackney: The Early Years|Marc Bolan was a British musician, singer-songwriter, and guitarist, who is best known as the founder, frontman, and driving force|Read More »|The Haunting Secrets Behind Marc Bolan’s Shrine|In 1977 Marc Bolan, a singer from Glam rock group T.Rex died in a car crash in London. The Singer,|Read More »|Step Back in Time with the Iconic Marc Bolan TV Show|Produced by Muriel Young, directed by Nicolas Ferguson, and shown on Granada Television for ITV. The year was 1977, and|Read More »|Bolan’s Premonitions on death: Fear of Driving|Marc Bolan was a legendary musician, songwriter, and frontman of the iconic British rock band T. Rex. His unique style|Read More »|Glam Rock Explained: The Marc Bolan Influence|What is Glam Rock? Glam rock, also known as glitter rock, is a music and fashion movement that originated in|Read More »|30th August 2014 Kate Bush 1st live comback after 35 years|21st September 1971 passing Old Grey Whistle Test, but what was it?|More Projects|0|0|votes|Article Rating|Subscribe|Notify of|new follow-up comments|new replies to my comments|I allow to use my email address and send notification about new comments and replies (you can unsubscribe at any time).|Label|{}|[+]|Name*|Email*|Label|{}|[+]|Name*|Email*|0|Comments|Inline Feedbacks|View all comments|Chris Burden American Pickup Truck at the Gagosian|Barbican Estate: Why it’s London’s Best-Kept Secret|What is the Lord Mayor’s Show Procession, The 692nd Lord Mayor – published Pictures!|Celebrating Zandra Rhodes’ Birthday ’40|Private Message the Hanger|HangerLondon | The London Blog | Written, filmed and photographed by the London bloggers. A photographic journey mixing travels to London’s Art & Culture and delving into the capital’s rich and diverse Historical back catalog.|As an Amazon Associate I earn from qualifying purchases|Website design photography and art by Hangerlondon|Copyright Notice of the Hangerlondon|Privacy, Terms & Conditions & other usage info|Disclaimer|© 2018-2020 All rights reserved | This website and its content is copyright of hangerlondon|wpDiscuz|0|0|Would love your thoughts, please comment.|x|(|)|x|||Reply|Insert|report this ad|x",
          "|Hardcover – 21 Sept. 2017|by|John Bramley|(Author)|4.5|4.5 out of 5 stars|77 ratings|See all formats and editions|Sorry, there was a problem loading this page. Try again.|Amazon Price|New from|Used from|Kindle Edition|\"Please retry\"|£7.33|—|—|Hardcover|\"Please retry\"|£7.21|—|£7.21|Kindle Edition|£7.33|Read with Our|Free App|Hardcover|£7.21|8 Used|from|£7.21|1 Collectible|from|£14.78|Marc Bolan was the wizard who brought magic to rock music - his heart beat to the rhythm of rock. Moving from early folk influences and songs on the mythology of Tolkien, he transformed himself into a unique, sparkling and effervescent glam-rock icon. His boogie roots combined with Marc's own natural glitter dust, and propelled him forward on an adventure, with fortunes that were to ebb and flow over a decade. His diamond-studded halo was extinguished on 16 September 1977, at a time when his music was in the ascendancy.|The annals of history are strewn with stories of artists who passed away in shocking circumstances of those that died too young, from substance abuse, mysterious illnesses or even murder. Sometimes, the shock of their passing immediately elevates their standing in cultural memory and cements their work in a favourable light. Marc Bolan died at twenty-nine years of age, in a tragic car crash - an accident that could have been avoided. However, it took many years for people to start appreciating what Marc Bolan brought to a rock music scene in the early seventies which had stagnated in some corners after the explosion of creativity in the sixties. Yet, gradually, acclaim has grown for how he enriched the period, bringing colour and humour to an increasingly leaden genre.|Much like Hendrix before him, and Cobain after him, his natural charisma and striking beauty have underpinned his status as a dreamlike bard, an enigmatic pin-up whom boys wished they looked like and girls wished they were with. Yet it was his scorching talent as a performer and songwriter which have formed the bedrock for longevity as a legend.|Including rare and unpublished photographs, and works of Marc's own poetry, this book is put together by a true, original fan - one who followed Marc Bolan on tour, who bought every piece of vinyl he released and who was fortunate enough to have made Marc's acquaintance during the peak of his career. Published forty years on from Bolan's death,|Beautiful Dreamer|is unashamedly a book of love, a book that every Marc Bolan fan will identify with, because it paints a picture of the man that the fans idolised, worshipped and continue to cherish to this day.|Read more|Previous page|Print length|272 pages|Language|English|Publisher|Music Press Books|Publication date|21 Sept. 2017|Dimensions|16 x 2.5 x 24 cm|ISBN-10|1786064480|ISBN-13|978-1786064486|See all details|Next page|What do customers buy after viewing this item?|Page|1|of|1|Start over|Page 1 of 1|Previous page|Highest rated|in this set of products|This item:|Marc Bolan - Beautiful Dreamer: Beautiful Dreamer|John Bramley|4.5 out of 5 stars|77|Hardcover|9 offers from|£7.21|Best Selling | Lowest Price|in this set of products|Bolan: The Rise And Fall of a 20th Century Superstar|Mark Paytress|4.4 out of 5 stars|146|Paperback|£9.95|£|9|.|95|Ride a White Swan: The Lives and Death of Marc Bolan|Lesley-Ann Jones|4.3 out of 5 stars|166|Paperback|£10.99|£|10|.|99|Get it as soon as|Tuesday, Jul 11|FREE Delivery on orders dispatched by Amazon over £10|Only 7 left in stock (more on the way).|Next page|Product description|Book Description|Forty years after his tragic death, this homage to Marc Bolan pays tribute to one of the pioneers of the glam rock movement.|About the Author|John Bramley was born in New York in 1955 and moved to England with his parents at the age of three. Marc Bolan had a massive effect on his life and, between 1980 and 1997, John undertook the rights to the Marc Bolan catalogue, ensuring that the legacy continued. As well as this biography, John has written the Marc Bolan|Illustrated discography,|and is a leading authority on T. Rex.|He attended Sheffield Hallam University, obtaining a degree in Sociology. A qualified generalist Advisor with the CAB, he now works helping people with Alcohol and Drug Addiction.|Product details|Publisher\n                                    ‏\n                                        :\n                                    ‎|Music Press Books (21 Sept. 2017)|Language\n                                    ‏\n                                        :\n                                    ‎|English|Hardcover\n                                    ‏\n                                        :\n                                    ‎|272 pages|ISBN-10\n                                    ‏\n                                        :\n                                    ‎|1786064480|ISBN-13\n                                    ‏\n                                        :\n                                    ‎|978-1786064486|Dimensions\n                                    ‏\n                                        :\n                                    ‎|16 x 2.5 x 24 cm|Best Sellers Rank:|606,962 in Books (|See Top 100 in Books|)|2,969 in|Popular Music|3,611 in|Rock & Pop Musician Biographies|4,662 in|Rock Music|Customer reviews:|4.5|4.5 out of 5 stars|77 ratings|About the author|Follow authors to get new release updates, plus improved recommendations.|John Bramley|Brief content visible, double tap to read full content.|Full content visible, double tap to read brief content.|Discover more of the author’s books, see similar authors, read author blogs and more|Read more|Read less|Products related to this item|Sponsored|Hide feedback|Page|1|of|1|Start over|Page 1 of 1|Previous page of related Sponsored Products|Feedback|TOP OF THE POPS: THE LOST YEARS REDISCOVERED 1964-1975|Peter Checksfield|79|Paperback|£17.65|Feedback|Guitar Exercises for Beginners: 10x Your Guitar Skills in 10 Minutes a Day (Guitar ...|Guitar Head|2,388|Paperback|£14.29|Feedback|Pentatonic Scale Fluency: Learn How To Play the Minor Pentatonic Scale Effortlessly...|Lee Nichols|1,370|Paperback|£6.99|Feedback|Money Power Love: A Novel|Joss Sheldon|222|Hardback|£14.99|Next page of related Sponsored Products|Customer reviews|4.5 out of 5 stars|4.5 out of 5|77 global ratings|5 star|75%|4 star|8%|3 star|10%|2 star|4%|1 star|3%|How customer reviews and ratings work|Customer Reviews, including Product Star Ratings, help customers to learn more about the product and decide whether it is the right product for them.|To calculate the overall star rating and percentage breakdown by star, we don’t use a simple average. Instead, our system considers things like how recent a review is and if the reviewer bought the item on Amazon. It also analyses reviews to verify trustworthiness.|Learn more how customers reviews work on Amazon|Sort reviews by|Top reviews|Most recent|Top reviews|Top reviews from United Kingdom|There was a problem filtering reviews right now. Please try again later.|D R COOPER|4.0 out of 5 stars|One for the Bolan Bookshelf.|Reviewed in the United Kingdom 🇬🇧 on 27 September 2017|Verified Purchase|Nothing wrong with a Bolan biography.|What I object to is shoe-horning gig dates/venues into an ongoing narrative when the selfsame info is comprehensively covered in a separate later section.It simply reads like a publishers intern was told to pad out the text with the former...|Normally I find \"I was there\" gig one-upmanship tedious,but concede you were with Marc from early days onward and therefore commendable,Mr Bramley.|So too the included photo's,most especially those from Kathleen Heron Andryszewski-who every Bolan fan should be eternally grateful to for giving Marc the hug we all continue to give his memory down the years.|Read more|8 people found this helpful|Helpful|Report|staceygrove|5.0 out of 5 stars|Must have for any Bolan fan|Reviewed in the United Kingdom 🇬🇧 on 13 November 2017|Verified Purchase|Great read by someone who knows what he is talking about, so nice to read a book that is written from a fans perspective and John Bramley is a long term fan. John and his wife Shan carried on the Bolan name in a time when there was no internet or mobile phones for fans to see or hear their idols. In a word there would have been no hope of ever hearing anything about Marc once he had died,but they continued  tirelessly sending out issues of Rarn magazine each month, which I for one could not wait to receive. I particularly liked the list of dates and venues T.Rex had played at, as you get older you forget these details. Great to see participation from other life long fans as well, this book was very nostalgic and bought back loads of wonderful memories|Read more|9 people found this helpful|Helpful|Report|Michael Stafford|5.0 out of 5 stars|Excellent book !|Reviewed in the United Kingdom 🇬🇧 on 1 December 2017|Verified Purchase|As a Bolan fan of more than 45 years, and having read countless books and articles on the ‘ Main Man ‘ I thought I knew all there was to know on the subject of Marc Bolan. How wrong I was ! John Bramley has written a book brimming with enthusiasm about his subject as you might expect, and it is packed with detail much of which was new to me. The photographs are fantastic as well, and many of them were also new to me. I enjoyed the book so much that I ordered another copy as a Christmas present. I’d recommend this not just to Bolan fans but to anyone with any interest in pop culture. It’s been a pleasure reading this book and being transported back to my teenage years !|Read more|6 people found this helpful|Helpful|Report|chris black|4.0 out of 5 stars|Interesting Read|Reviewed in the United Kingdom 🇬🇧 on 25 August 2018|Verified Purchase|Many Bolan fans will already know / have some of the articles featured in this book but still contained enough interesting thoughts about the Main Man himself. Contains some amazing photos of Marc alongside the advertising pages used to promote the albums and gigs featured. If you are a fan of Marc and his music then this is a must-read as its written by the fans for the Children Of The Revolution out there.|Read more|One person found this helpful|Helpful|Report|Desdemona|2.0 out of 5 stars|Whatever Happened to the....Fan Facts?|Reviewed in the United Kingdom 🇬🇧 on 3 October 2017|Verified Purchase|I was so looking forward to this Bolan Book especially as it was coming from a Huge Bolan Fan...I found it rushed and the mistakes must have missed the intern proof reader...Marc and June were not living in Marble Arch when Ride A White Swan was put to demo tape..Weeley August 1971...”the set included several songs that were to appear on the Slider and single flip sides nearly two years later “Weeley Summer 1971-Slider Summer 72! There was no official merchandise available at Wembley Concert March 1972...we just got the Melody Maker and Record Mirror Specials from WH Smiths..The Unofficial Sellers outside the venue got our new pence..The photographs are uninspired...nothing from the Pete Sanders archive..looks like just a few clicks from the Getty website.Captions are dire..”relishing the bright lights of the Television stage” why not include the correct timeline of Don  Kirschners Rock Concert October 8 1974?  T.rex Perform On Top of The Pops in 1970 page 90..again lifted from Getty but another incorrect caption.Should Read 1972..A Die Hard Fan should have noticed the mistake..Blurred photo from the Essen 1973 Concert..I have been a Fan since Desdemona..(yes 50 Years! ) and I may sound a bit “nit picky “ but with very few good books on Bolan this should have been much better especially considering the authors Bolan History...Disappointing...|Read more|12 people found this helpful|Helpful|Report|Amazon Customer|5.0 out of 5 stars|I love this book great value for money|Reviewed in the United Kingdom 🇬🇧 on 20 February 2018|Verified Purchase|I love this book great value for money.  The wonderful Marc Bolan so Missed taking me back to my memories of hanging out|24/7 around Marc in the 70s in London. A fabulous book. I adore the cover too, the colours are so Bolan.  The most colourful person Full of|Light I've ever seen. The Greatest Star we ever had.  He oozed Star quality. I love him miss him and this book is so helpful for me|taking me back where I can almost feel his presence.  Fantastic.|Read more|One person found this helpful|Helpful|Report|Mr D quotrex|5.0 out of 5 stars|Well Mr John Bramley this book is terrible..|Reviewed in the United Kingdom 🇬🇧 on 9 November 2017|Verified Purchase|Well Mr John Bramley this book is terrible..........if you want to lose track of time !! Thought I'd read for a few minutes in bed... 1hour later.. next night 2+hrs..... Why! because its so different from other MARC books out there and so well written, its just flows along with every page turn!!|P.S John....if (hope) you write another one. PLEASE ask the publishers to put a 'RED WARNING' label on cover...\"Warning to readers,  Don't read as a little LIGHT read in bed.  LOL|Read more|One person found this helpful|Helpful|Report|Mr. John Brooks Jnr|5.0 out of 5 stars|Loved it|Reviewed in the United Kingdom 🇬🇧 on 3 December 2017|Verified Purchase|Loved reading  great for any Bolan. Fan and non Bolan fan a like.. Pity I couldn't get my review of seeing Marc live published in the book as I was at our caravan and my wl fi was playing up...I particular liked the fans contribution and all the tour dates of marcs career.. It was an easy read with some colourful pictures and wrote by a real Bolan fan for us the Bolan community... So its 5 stars from me|Read more|One person found this helpful|Helpful|Report|See all reviews|Your recently viewed items and featured recommendations|›|View or edit your browsing history|After viewing product detail pages, look here to find an easy way to navigate back to pages you are interested in.|Your recently viewed items and featured recommendations|›|View or edit your browsing history|After viewing product detail pages, look here to find an easy way to navigate back to pages you are interested in.|Back to top|Get to Know Us|Careers|About Us|UK Modern Slavery Statement|Sustainability|Amazon Science|Make Money with Us|Sell on Amazon|Sell on Amazon Business|Sell on Amazon Handmade|Sell on Amazon Launchpad|Protect and build your brand|Associates Programme|Fulfilment by Amazon|Seller Fulfilled Prime|Advertise Your Products|Independently Publish with Us|Amazon Pay|Host an Amazon Hub|›|See More Make Money with Us|Amazon Payment Methods|Amazon Platinum Mastercard|Amazon Classic Mastercard|Amazon Money Store|Gift Cards|Amazon Currency Converter|Payment Methods Help|Shop with Points|Top Up Your Account|Top Up Your Account in Store|Let Us Help You|COVID-19 and Amazon|Track Packages or View Orders|Delivery Rates & Policies|Amazon Prime|Returns & Replacements|Recycling|Manage Your Content and Devices|Amazon Mobile App|Customer Service|Accessibility|Australia|Brazil|Canada|China|France|Germany|India|Italy|Japan|Mexico|Netherlands|Poland|Singapore|Spain|Turkey|United Arab Emirates|United States|Amazon Music|Stream millions|of songs|AbeBooks|Books, art|& collectables|ACX|Audiobook Publishing|Made Easy|Amazon Web Services|Scalable Cloud|Computing Services|Audible|Download Audiobooks|Book Depository|Books With Free|Delivery Worldwide|DPReview|Digital|Photography|Goodreads|Book reviews|& recommendations|Amazon Home Services|Experienced pros|Happiness Guarantee|IMDb|Movies, TV|& Celebrities|Kindle Direct Publishing|Indie Digital & Print Publishing|Made Easy|Shopbop|Designer|Fashion Brands|Amazon Warehouse|Deep Discounts|Open-Box Products|Amazon Business|Service for|business customers|Whole Foods Market|We Believe in|Real Food|Conditions of Use & Sale|Privacy Notice|Cookies Notice|Interest-Based Ads Notice|© 1996-2022, Amazon.com, Inc. or its affiliates",
          "|The accident happened on a dark, blind spot section of the road. The car hit a tree with such force that it wrapped around the trunk, instantly killing Bolan. Jones was fortunate enough to survive the crash but sustained serious injuries, including a broken arm and jaw.|The news of Bolan’s tragic death shocked his fans and the music industry. Bolan was a charismatic and influential figure in the glam rock era of the 1970s, with hits like “Get It On” and “Telegram Sam” that made him a household name. He was just 29 years old at the time of his death.|The accident on Gipsy Lane highlighted the dangers of driving on poorly lit, rural roads. Bolan’s death also highlighted the importance of wearing seat belts, as it was later revealed that Bolan had not been wearing one at the time of the crash.|Despite the tragedy, Bolan’s music and legacy continue to inspire new generations of musicians and fans. The impact of his death was felt throughout the music industry, with artists like David Bowie paying tribute to his talent and influence.|Eerily Bolan did have some|premonitions|on how he would die, in a|car crash|Linked image from (|https://www.marc-bolan.net/members/index-2.html|)|Marc Bolan Shrine|There is a Marc Bolan Shrine, on the B306 not far from Barnes Rail station 10 gipsy lane London SW15 5RG.|Advertisements|S.E London Hypnotherapy Practice: Short Goodbye Message:|MULTI MODAL THERAPY:|Online & Locations of|Blackheath & Chistlehurst. (Cognitive, Behavioural, Hypnotherapy, Mindfulness etc.)|THERAPIST|: Former City Analyst, City of London, Singapore, Zurich and Frankfurt.|If you are seeking Therapy please reach out for an initial|free consultation call|.|Bohangar Hypnotherapy Practice. Hope you enjoy this blog post, would love to hear your comments|Free CONSULTATION|S.E London Hypnotherapy Practice: Welcome|-Bohangar Practice –|Seeking Multi Discpline Therapy?|Online &|Blackheath & Chistlehurst|Therapist|: Former City Analyst, Speciality Problem Simplification|Free CONSULTATION|Marc Bolan’s London House in Hackney: The Early Years|Marc Bolan was a British musician, singer-songwriter, and guitarist, who is best known as the founder, frontman, and driving force|Read More »|The Haunting Secrets Behind Marc Bolan’s Shrine|In 1977 Marc Bolan, a singer from Glam rock group T.Rex died in a car crash in London. The Singer,|Read More »|Step Back in Time with the Iconic Marc Bolan TV Show|Produced by Muriel Young, directed by Nicolas Ferguson, and shown on Granada Television for ITV. The year was 1977, and|Read More »|Bolan’s Premonitions on death: Fear of Driving|Marc Bolan was a legendary musician, songwriter, and frontman of the iconic British rock band T. Rex. His unique style|Read More »|Glam Rock Explained: The Marc Bolan Influence|What is Glam Rock? Glam rock, also known as glitter rock, is a music and fashion movement that originated in|Read More »|30th August 2014 Kate Bush 1st live comback after 35 years|21st September 1971 passing Old Grey Whistle Test, but what was it?|More Projects|0|0|votes|Article Rating|Subscribe|Notify of|new follow-up comments|new replies to my comments|I allow to use my email address and send notification about new comments and replies (you can unsubscribe at any time).|Label|{}|[+]|Name*|Email*|Label|{}|[+]|Name*|Email*|0|Comments|Inline Feedbacks|View all comments|Chris Burden American Pickup Truck at the Gagosian|Barbican Estate: Why it’s London’s Best-Kept Secret|What is the Lord Mayor’s Show Procession, The 692nd Lord Mayor – published Pictures!|Celebrating Zandra Rhodes’ Birthday ’40|Private Message the Hanger|HangerLondon | The London Blog | Written, filmed and photographed by the London bloggers. A photographic journey mixing travels to London’s Art & Culture and delving into the capital’s rich and diverse Historical back catalog.|As an Amazon Associate I earn from qualifying purchases|Website design photography and art by Hangerlondon|Copyright Notice of the Hangerlondon|Privacy, Terms & Conditions & other usage info|Disclaimer|© 2018-2020 All rights reserved | This website and its content is copyright of hangerlondon|wpDiscuz|0|0|Would love your thoughts, please comment.|x|(|)|x|||Reply|Insert|report this ad|x",
          "|Hardcover – 21 Sept. 2017|by|John Bramley|(Author)|4.5|4.5 out of 5 stars|77 ratings|See all formats and editions|Sorry, there was a problem loading this page. Try again.|Amazon Price|New from|Used from|Kindle Edition|\"Please retry\"|£7.33|—|—|Hardcover|\"Please retry\"|£7.21|—|£7.21|Kindle Edition|£7.33|Read with Our|Free App|Hardcover|£7.21|8 Used|from|£7.21|1 Collectible|from|£14.78|Marc Bolan was the wizard who brought magic to rock music - his heart beat to the rhythm of rock. Moving from early folk influences and songs on the mythology of Tolkien, he transformed himself into a unique, sparkling and effervescent glam-rock icon. His boogie roots combined with Marc's own natural glitter dust, and propelled him forward on an adventure, with fortunes that were to ebb and flow over a decade. His diamond-studded halo was extinguished on 16 September 1977, at a time when his music was in the ascendancy.|The annals of history are strewn with stories of artists who passed away in shocking circumstances of those that died too young, from substance abuse, mysterious illnesses or even murder. Sometimes, the shock of their passing immediately elevates their standing in cultural memory and cements their work in a favourable light. Marc Bolan died at twenty-nine years of age, in a tragic car crash - an accident that could have been avoided. However, it took many years for people to start appreciating what Marc Bolan brought to a rock music scene in the early seventies which had stagnated in some corners after the explosion of creativity in the sixties. Yet, gradually, acclaim has grown for how he enriched the period, bringing colour and humour to an increasingly leaden genre.|Much like Hendrix before him, and Cobain after him, his natural charisma and striking beauty have underpinned his status as a dreamlike bard, an enigmatic pin-up whom boys wished they looked like and girls wished they were with. Yet it was his scorching talent as a performer and songwriter which have formed the bedrock for longevity as a legend.|Including rare and unpublished photographs, and works of Marc's own poetry, this book is put together by a true, original fan - one who followed Marc Bolan on tour, who bought every piece of vinyl he released and who was fortunate enough to have made Marc's acquaintance during the peak of his career. Published forty years on from Bolan's death,|Beautiful Dreamer|is unashamedly a book of love, a book that every Marc Bolan fan will identify with, because it paints a picture of the man that the fans idolised, worshipped and continue to cherish to this day.|Read more|Previous page|Print length|272 pages|Language|English|Publisher|Music Press Books|Publication date|21 Sept. 2017|Dimensions|16 x 2.5 x 24 cm|ISBN-10|1786064480|ISBN-13|978-1786064486|See all details|Next page|What do customers buy after viewing this item?|Page|1|of|1|Start over|Page 1 of 1|Previous page|Highest rated|in this set of products|This item:|Marc Bolan - Beautiful Dreamer: Beautiful Dreamer|John Bramley|4.5 out of 5 stars|77|Hardcover|9 offers from|£7.21|Best Selling | Lowest Price|in this set of products|Bolan: The Rise And Fall of a 20th Century Superstar|Mark Paytress|4.4 out of 5 stars|146|Paperback|£9.95|£|9|.|95|Ride a White Swan: The Lives and Death of Marc Bolan|Lesley-Ann Jones|4.3 out of 5 stars|166|Paperback|£10.99|£|10|.|99|Get it as soon as|Tuesday, Jul 11|FREE Delivery on orders dispatched by Amazon over £10|Only 7 left in stock (more on the way).|Next page|Product description|Book Description|Forty years after his tragic death, this homage to Marc Bolan pays tribute to one of the pioneers of the glam rock movement.|About the Author|John Bramley was born in New York in 1955 and moved to England with his parents at the age of three. Marc Bolan had a massive effect on his life and, between 1980 and 1997, John undertook the rights to the Marc Bolan catalogue, ensuring that the legacy continued. As well as this biography, John has written the Marc Bolan|Illustrated discography,|and is a leading authority on T. Rex.|He attended Sheffield Hallam University, obtaining a degree in Sociology. A qualified generalist Advisor with the CAB, he now works helping people with Alcohol and Drug Addiction.|Product details|Publisher\n                                    ‏\n                                        :\n                                    ‎|Music Press Books (21 Sept. 2017)|Language\n                                    ‏\n                                        :\n                                    ‎|English|Hardcover\n                                    ‏\n                                        :\n                                    ‎|272 pages|ISBN-10\n                                    ‏\n                                        :\n                                    ‎|1786064480|ISBN-13\n                                    ‏\n                                        :\n                                    ‎|978-1786064486|Dimensions\n                                    ‏\n                                        :\n                                    ‎|16 x 2.5 x 24 cm|Best Sellers Rank:|606,962 in Books (|See Top 100 in Books|)|2,969 in|Popular Music|3,611 in|Rock & Pop Musician Biographies|4,662 in|Rock Music|Customer reviews:|4.5|4.5 out of 5 stars|77 ratings|About the author|Follow authors to get new release updates, plus improved recommendations.|John Bramley|Brief content visible, double tap to read full content.|Full content visible, double tap to read brief content.|Discover more of the author’s books, see similar authors, read author blogs and more|Read more|Read less|Products related to this item|Sponsored|Hide feedback|Page|1|of|1|Start over|Page 1 of 1|Previous page of related Sponsored Products|Feedback|TOP OF THE POPS: THE LOST YEARS REDISCOVERED 1964-1975|Peter Checksfield|79|Paperback|£17.65|Feedback|Guitar Exercises for Beginners: 10x Your Guitar Skills in 10 Minutes a Day (Guitar ...|Guitar Head|2,388|Paperback|£14.29|Feedback|Pentatonic Scale Fluency: Learn How To Play the Minor Pentatonic Scale Effortlessly...|Lee Nichols|1,370|Paperback|£6.99|Feedback|Money Power Love: A Novel|Joss Sheldon|222|Hardback|£14.99|Next page of related Sponsored Products|Customer reviews|4.5 out of 5 stars|4.5 out of 5|77 global ratings|5 star|75%|4 star|8%|3 star|10%|2 star|4%|1 star|3%|How customer reviews and ratings work|Customer Reviews, including Product Star Ratings, help customers to learn more about the product and decide whether it is the right product for them.|To calculate the overall star rating and percentage breakdown by star, we don’t use a simple average. Instead, our system considers things like how recent a review is and if the reviewer bought the item on Amazon. It also analyses reviews to verify trustworthiness.|Learn more how customers reviews work on Amazon|Sort reviews by|Top reviews|Most recent|Top reviews|Top reviews from United Kingdom|There was a problem filtering reviews right now. Please try again later.|D R COOPER|4.0 out of 5 stars|One for the Bolan Bookshelf.|Reviewed in the United Kingdom 🇬🇧 on 27 September 2017|Verified Purchase|Nothing wrong with a Bolan biography.|What I object to is shoe-horning gig dates/venues into an ongoing narrative when the selfsame info is comprehensively covered in a separate later section.It simply reads like a publishers intern was told to pad out the text with the former...|Normally I find \"I was there\" gig one-upmanship tedious,but concede you were with Marc from early days onward and therefore commendable,Mr Bramley.|So too the included photo's,most especially those from Kathleen Heron Andryszewski-who every Bolan fan should be eternally grateful to for giving Marc the hug we all continue to give his memory down the years.|Read more|8 people found this helpful|Helpful|Report|staceygrove|5.0 out of 5 stars|Must have for any Bolan fan|Reviewed in the United Kingdom 🇬🇧 on 13 November 2017|Verified Purchase|Great read by someone who knows what he is talking about, so nice to read a book that is written from a fans perspective and John Bramley is a long term fan. John and his wife Shan carried on the Bolan name in a time when there was no internet or mobile phones for fans to see or hear their idols. In a word there would have been no hope of ever hearing anything about Marc once he had died,but they continued  tirelessly sending out issues of Rarn magazine each month, which I for one could not wait to receive. I particularly liked the list of dates and venues T.Rex had played at, as you get older you forget these details. Great to see participation from other life long fans as well, this book was very nostalgic and bought back loads of wonderful memories|Read more|9 people found this helpful|Helpful|Report|Michael Stafford|5.0 out of 5 stars|Excellent book !|Reviewed in the United Kingdom 🇬🇧 on 1 December 2017|Verified Purchase|As a Bolan fan of more than 45 years, and having read countless books and articles on the ‘ Main Man ‘ I thought I knew all there was to know on the subject of Marc Bolan. How wrong I was ! John Bramley has written a book brimming with enthusiasm about his subject as you might expect, and it is packed with detail much of which was new to me. The photographs are fantastic as well, and many of them were also new to me. I enjoyed the book so much that I ordered another copy as a Christmas present. I’d recommend this not just to Bolan fans but to anyone with any interest in pop culture. It’s been a pleasure reading this book and being transported back to my teenage years !|Read more|6 people found this helpful|Helpful|Report|chris black|4.0 out of 5 stars|Interesting Read|Reviewed in the United Kingdom 🇬🇧 on 25 August 2018|Verified Purchase|Many Bolan fans will already know / have some of the articles featured in this book but still contained enough interesting thoughts about the Main Man himself. Contains some amazing photos of Marc alongside the advertising pages used to promote the albums and gigs featured. If you are a fan of Marc and his music then this is a must-read as its written by the fans for the Children Of The Revolution out there.|Read more|One person found this helpful|Helpful|Report|Desdemona|2.0 out of 5 stars|Whatever Happened to the....Fan Facts?|Reviewed in the United Kingdom 🇬🇧 on 3 October 2017|Verified Purchase|I was so looking forward to this Bolan Book especially as it was coming from a Huge Bolan Fan...I found it rushed and the mistakes must have missed the intern proof reader...Marc and June were not living in Marble Arch when Ride A White Swan was put to demo tape..Weeley August 1971...”the set included several songs that were to appear on the Slider and single flip sides nearly two years later “Weeley Summer 1971-Slider Summer 72! There was no official merchandise available at Wembley Concert March 1972...we just got the Melody Maker and Record Mirror Specials from WH Smiths..The Unofficial Sellers outside the venue got our new pence..The photographs are uninspired...nothing from the Pete Sanders archive..looks like just a few clicks from the Getty website.Captions are dire..”relishing the bright lights of the Television stage” why not include the correct timeline of Don  Kirschners Rock Concert October 8 1974?  T.rex Perform On Top of The Pops in 1970 page 90..again lifted from Getty but another incorrect caption.Should Read 1972..A Die Hard Fan should have noticed the mistake..Blurred photo from the Essen 1973 Concert..I have been a Fan since Desdemona..(yes 50 Years! ) and I may sound a bit “nit picky “ but with very few good books on Bolan this should have been much better especially considering the authors Bolan History...Disappointing...|Read more|12 people found this helpful|Helpful|Report|Amazon Customer|5.0 out of 5 stars|I love this book great value for money|Reviewed in the United Kingdom 🇬🇧 on 20 February 2018|Verified Purchase|I love this book great value for money.  The wonderful Marc Bolan so Missed taking me back to my memories of hanging out|24/7 around Marc in the 70s in London. A fabulous book. I adore the cover too, the colours are so Bolan.  The most colourful person Full of|Light I've ever seen. The Greatest Star we ever had.  He oozed Star quality. I love him miss him and this book is so helpful for me|taking me back where I can almost feel his presence.  Fantastic.|Read more|One person found this helpful|Helpful|Report|Mr D quotrex|5.0 out of 5 stars|Well Mr John Bramley this book is terrible..|Reviewed in the United Kingdom 🇬🇧 on 9 November 2017|Verified Purchase|Well Mr John Bramley this book is terrible..........if you want to lose track of time !! Thought I'd read for a few minutes in bed... 1hour later.. next night 2+hrs..... Why! because its so different from other MARC books out there and so well written, its just flows along with every page turn!!|P.S John....if (hope) you write another one. PLEASE ask the publishers to put a 'RED WARNING' label on cover...\"Warning to readers,  Don't read as a little LIGHT read in bed.  LOL|Read more|One person found this helpful|Helpful|Report|Mr. John Brooks Jnr|5.0 out of 5 stars|Loved it|Reviewed in the United Kingdom 🇬🇧 on 3 December 2017|Verified Purchase|Loved reading  great for any Bolan. Fan and non Bolan fan a like.. Pity I couldn't get my review of seeing Marc live published in the book as I was at our caravan and my wl fi was playing up...I particular liked the fans contribution and all the tour dates of marcs career.. It was an easy read with some colourful pictures and wrote by a real Bolan fan for us the Bolan community... So its 5 stars from me|Read more|One person found this helpful|Helpful|Report|See all reviews|Your recently viewed items and featured recommendations|›|View or edit your browsing history|After viewing product detail pages, look here to find an easy way to navigate back to pages you are interested in.|Your recently viewed items and featured recommendations|›|View or edit your browsing history|After viewing product detail pages, look here to find an easy way to navigate back to pages you are interested in.|Back to top|Get to Know Us|Careers|About Us|UK Modern Slavery Statement|Sustainability|Amazon Science|Make Money with Us|Sell on Amazon|Sell on Amazon Business|Sell on Amazon Handmade|Sell on Amazon Launchpad|Protect and build your brand|Associates Programme|Fulfilment by Amazon|Seller Fulfilled Prime|Advertise Your Products|Independently Publish with Us|Amazon Pay|Host an Amazon Hub|›|See More Make Money with Us|Amazon Payment Methods|Amazon Platinum Mastercard|Amazon Classic Mastercard|Amazon Money Store|Gift Cards|Amazon Currency Converter|Payment Methods Help|Shop with Points|Top Up Your Account|Top Up Your Account in Store|Let Us Help You|COVID-19 and Amazon|Track Packages or View Orders|Delivery Rates & Policies|Amazon Prime|Returns & Replacements|Recycling|Manage Your Content and Devices|Amazon Mobile App|Customer Service|Accessibility|Australia|Brazil|Canada|China|France|Germany|India|Italy|Japan|Mexico|Netherlands|Poland|Singapore|Spain|Turkey|United Arab Emirates|United States|Amazon Music|Stream millions|of songs|AbeBooks|Books, art|& collectables|ACX|Audiobook Publishing|Made Easy|Amazon Web Services|Scalable Cloud|Computing Services|Audible|Download Audiobooks|Book Depository|Books With Free|Delivery Worldwide|DPReview|Digital|Photography|Goodreads|Book reviews|& recommendations|Amazon Home Services|Experienced pros|Happiness Guarantee|IMDb|Movies, TV|& Celebrities|Kindle Direct Publishing|Indie Digital & Print Publishing|Made Easy|Shopbop|Designer|Fashion Brands|Amazon Warehouse|Deep Discounts|Open-Box Products|Amazon Business|Service for|business customers|Whole Foods Market|We Believe in|Real Food|Conditions of Use & Sale|Privacy Notice|Cookies Notice|Interest-Based Ads Notice|© 1996-2022, Amazon.com, Inc. or its affiliates",
          "|Marc Bolan was a British musician, singer-songwriter, and guitarist, who is best known as the founder, frontman, and driving force behind the legendary glam rock band T. Rex. Born Mark Feld in London in 1947, Bolan’s life and career were marked by his passionate love of music, his unique artistic vision, and his ability to capture the spirit of the times in his music.",
          "|Marc Bolan, born Mark Feld on 30/9/1947  grew up in London’s Stoke Newington and lived in this house at 25 Stoke Newington Common. Stoke Newington was an area that was undergoing significant social and cultural changes during the 1950s and 1960s. It was a diverse neighborhood that was home to a vibrant artistic community, and Bolan was deeply influenced by the music, fashion, and literature that surrounded him. He attended the local William Patten Primary School and then the Uppingham School in Rutland before dropping out at the age of 15 to pursue a career in music.|Street signs on the corner house next to where Bolan Lived|Top Book Picks on Stoke Newington on the Amazon Store|As young children, Bolan and his brother were not allowed to be street urchins when younger. Supportive hard-working parents. Bolan had a traditional time playing around the home, and small yard, making plasticine dinosaurs, and enjoying family trips to local parks swans and deer, and places like Margate seaside.|Bolan’s Education|Marc Bolan went to Northwold Primary School, and as is the tradition in England, the school was a short walk from his home.|Northwold Primary School that Mark Bolan attended Hackney London|Northwold Primary school where Mark Bolan went to school.|Bolan the dyslexic|As Bolan grew up more demands were being made by the school of the education system, and the school of Life.  Learning differences were not well understood or even spotted back then, let alone catered for. Even in modern times, this is still somewhat of a challenge for anyone to cope with.|Perhaps being someone with dyslexia was where the outsider comes from, many people with learning differences learn to adapt, fit in, observe others, mimic find other ways to do things and overcome. At the age of 9, he was interested in learning to play the guitar and through his mother’s tenacity received his very own instrument.|Bolan and the 11 Plus Exam|Then came the school of life, the social hopscotch we all go through.  Finding our identity, interests, role models, and friends’ hobbies.  Bolan did not pass the 11 plus exam, and so did not attend the strict grammar school world.|Stoke Newington Common Opposite the house where Marc Bolan grew up|Boys stone sign Northwold Primary school were Marc Bolan went to school.|Bolan Expelled from School|He was expelled from school, by his mid-teens for bad behavior. But Bolan educated himself, as he did go to the library on Church Street. It is known he was read to by others too. Books such as Tolkien, Hobbit, and Lord of the Rings. He also read about poets and was captivated by a historic character Beau Brummel who he took on as a role model.|Hackney Empire|Bolan’s Family Roots and cultural influences|The cosmopolitan influences he was exposed to also came because his family heritage came from diverse backgrounds Father’s connections were Jewish Rusian and Polish. His mother was of a different cultural background but they formed a modern integrated adaptation. Bolan went to Jewish Youth clubs in the Stamford Hill area. At School formed a band and one of the young local girl singers was Helen Shapiro!|Musicians that inspired Bolan|Eddie Cochran, Elvis, Cliff Richard, Chuck Berry, Gene Vincent, Arthur Crudup. He also met Eddie Cochran when he performed in London briefly because he had the nerve to ask him if he could carry his guitar from the venue of the Hackney Empire to his waiting limo car when he was around 13.  Bolan and his friends also went to the Empire on a regular basis because it is where the TV show OH Boy! was filmed.|The exploration of Bolan’s London explores the boyhood home and haunts in Stoke Newington to what made Bolan a standout Music Legend in the Glam Rock Music genre|Marc Bolan still has a fan base all over the world, and made his mark in rock history, but what was his secret how did this London born Lad with mild dyslexia, break into the music business and become associated as someone who gave Glam Rock its punch poetry and above all Masculine and Feminine Power.|Top pick Marc Bolan books on the Amazon Store|Angelheaded Hipster: The Songs of Marc Bolan & T. Rex on Vinyl Record|Ride a White Swan – The Lives and Death of Marc Bolan – Lesley-Anne Jones|Marc Bolan Ride On – DVD|What made Bolan stand out?|Maintaining masculine energy whilst somehow being able to pull off the look of wearing clothes normally found in a woman’s wardrobe. Doing this alienates no one and still maintains dignity, kudos, and appeal to both women and men whilst getting them into your songs is no mean feat. He had sensitivity, sensuality, poetic mysticism, photogenic aura, and exhibitionist traits, a trendsetter who flirted with sexual ambiguity, but then also able to come across as a straight-dressing lad of the times in jeans and t-shirt down the pub. Being able to reach high and low notes. Maintaining some power behind the music, whilst resurrecting Rock-and-roll.|Bolan and Glitter|It is not clear if it was an assistant or Bolan who thought of using glitter. Either way, he seems one of the first to have dabbed the glitter on his face. He used feathers, seen wearing Mary Jane ladies’ shoes, or platforms, metallic glitter fabrics. He wore a big vintage-looking top hat. Iconic in many photos of him. Slash from Guns and Roses has similar hair and an iconic hat. Boland wore vivid colours such as electric peacock blues, and greens, rich mauve pinks.  Textures such as velvet, satin, fitted 70s style jackets, with flared trousers. Males wore eye makeup too, a smudgy sort of shadow, or black eyeliner.|The Melange of his predecessors|Having idols such as 50s Rock-and-roll Stars, Eddie Cochran, and Elvis, going through the mod and teddy boy and hippy experiments enabled his sound to blend that eerie nostalgia with something of the new frontiers that the 1970s bought. Perhaps the song lyrics “But you won’t fool the children of the revolution.” Sums up the fact that people were looking for something deeper more spiritual but with a vibrant punchiness, and laid-back coolness.  A culmination of the sounds of the decades before and yet still being able to call it their unique time. The 1970’s no matter what part of it you look at definitely was a magical revolving door that transformed the 60s to the 80s.|Stoke Newington Common opposite the house where Marc Bolan grew up|Advertisements|“Children of the Revolution”|Revolutionaries often conjure up being outsiders, rebels uncared for, neglected, and tough upbringings. Somewhat a different story with Bolan, which makes one wonder, how he went on to become a  revolutionary music-fashion God, of the Glam Rock era of the 1970s.  To understand what inspired and shaped people often one only has to go back to where they came from and explore and get an insight into influences as they grew up.|Bolan’s Fashion and Dressing to Impress|Fashions were changing and stars of the day dressed the part. Bolan became more aware of having to look and dress the part to gain social mobility, he had frequented the west end on the bus 73 route that went door to door from the home where he grew up, facing Stoke Newington Common. His mother worked in Soho at Berwick Market. His obsession with fashion is seen.|Bolan joined a model agency John Temple clothing catalogue which also displayed cardboard cutouts of models in shops. Bolan was photogenic.|Near Soho, Old Compton Street was the famous 2i’s coffee shop which was a launchpad for new artists of the day, where they could be talent-spotted. Cliff Richard and many other household names went through this place. Bolan visited it, it is now called Poppies Fish and Chips. Soho was a hive of activity.|There is more to this story and character, just like there are more songs to be sung and places in London to do with Bolan that we will return to. On the anniversary of his passing, here is a rose from the yards in front of the house area where he grew up.|I hope you enjoyed the article as much as we did tour these sites, taking the photographs. Please browse the site for other articles…enjoy|Closing Thoughts|In Stoke Newington, Bolan is still remembered fondly as a local hero. In 2002, a plaque was unveiled in his honor at the site of his childhood home on Queens Drive. The plaque reads: “Marc Bolan, 1947-1977, rock musician, poet, and visionary was born here and spent his childhood in Stoke Newington. He inspired us with his unique talent and remains an icon of our times.|Marc Bolan’s Map|S.E London Hypnotherapy Practice: Short Goodbye Message:|MULTI MODAL THERAPY:|Online & Locations of|Blackheath & Chistlehurst. (Cognitive, Behavioural, Hypnotherapy, Mindfulness etc.)|THERAPIST|: Former City Analyst, City of London, Singapore, Zurich and Frankfurt.|If you are seeking Therapy please reach out for an initial|free consultation call|.|Bohangar Hypnotherapy Practice. Hope you enjoy this blog post, would love to hear your comments|Free CONSULTATION|S.E London Hypnotherapy Practice: Welcome|-Bohangar Practice –|Seeking Multi Discpline Therapy?|Online &|Blackheath & Chistlehurst|Therapist|: Former City Analyst, Speciality Problem Simplification|Free CONSULTATION|Marc Bolan’s London House in Hackney: The Early Years|Marc Bolan was a British musician, singer-songwriter, and guitarist, who is best known as the founder, frontman, and driving force|Read More »|The Haunting Secrets Behind Marc Bolan’s Shrine|In 1977 Marc Bolan, a singer from Glam rock group T.Rex died in a car crash in London. The Singer,|Read More »|Step Back in Time with the Iconic Marc Bolan TV Show|Produced by Muriel Young, directed by Nicolas Ferguson, and shown on Granada Television for ITV. The year was 1977, and|Read More »|Bolan’s Premonitions on death: Fear of Driving|Marc Bolan was a legendary musician, songwriter, and frontman of the iconic British rock band T. Rex. His unique style|Read More »|Glam Rock Explained: The Marc Bolan Influence|What is Glam Rock? Glam rock, also known as glitter rock, is a music and fashion movement that originated in|Read More »|Discover London’s Rich Heritage at Goldsmiths’ Centre|The Secrets Behind London’s Rare Bronze RAF Squadron Badges: Revealed!|More Projects|4|2|votes|Article Rating|Subscribe|Notify of|new follow-up comments|new replies to my comments|I allow to use my email address and send notification about new comments and replies (you can unsubscribe at any time).|Label|{}|[+]|Name*|Email*|Label|{}|[+]|Name*|Email*|0|Comments|Inline Feedbacks|View all comments|Wembley Park Winterfest Light Trail Tech Explored|Light up your Hanukkah with the Laser Menorah festival in Islington|The remarkable journey of London’s Embankment from Wren to Bazalgette|A Festive Farewell: London’s Last Christmas Before Covid-19|report this ad|Private Message the Hanger|HangerLondon | The London Blog | Written, filmed and photographed by the London bloggers. A photographic journey mixing travels to London’s Art & Culture and delving into the capital’s rich and diverse Historical back catalog.|As an Amazon Associate I earn from qualifying purchases|Website design photography and art by Hangerlondon|Copyright Notice of the Hangerlondon|Privacy, Terms & Conditions & other usage info|Disclaimer|© 2018-2020 All rights reserved | This website and its content is copyright of hangerlondon|wpDiscuz|0|0|Would love your thoughts, please comment.|x|(|)|x|||Reply|Insert|x",
          "|The accident happened on a dark, blind spot section of the road. The car hit a tree with such force that it wrapped around the trunk, instantly killing Bolan. Jones was fortunate enough to survive the crash but sustained serious injuries, including a broken arm and jaw.|The news of Bolan’s tragic death shocked his fans and the music industry. Bolan was a charismatic and influential figure in the glam rock era of the 1970s, with hits like “Get It On” and “Telegram Sam” that made him a household name. He was just 29 years old at the time of his death.|The accident on Gipsy Lane highlighted the dangers of driving on poorly lit, rural roads. Bolan’s death also highlighted the importance of wearing seat belts, as it was later revealed that Bolan had not been wearing one at the time of the crash.|Despite the tragedy, Bolan’s music and legacy continue to inspire new generations of musicians and fans. The impact of his death was felt throughout the music industry, with artists like David Bowie paying tribute to his talent and influence.|Eerily Bolan did have some|premonitions|on how he would die, in a|car crash|Linked image from (|https://www.marc-bolan.net/members/index-2.html|)|Marc Bolan Shrine|There is a Marc Bolan Shrine, on the B306 not far from Barnes Rail station 10 gipsy lane London SW15 5RG.|Advertisements|S.E London Hypnotherapy Practice: Short Goodbye Message:|MULTI MODAL THERAPY:|Online & Locations of|Blackheath & Chistlehurst. (Cognitive, Behavioural, Hypnotherapy, Mindfulness etc.)|THERAPIST|: Former City Analyst, City of London, Singapore, Zurich and Frankfurt.|If you are seeking Therapy please reach out for an initial|free consultation call|.|Bohangar Hypnotherapy Practice. Hope you enjoy this blog post, would love to hear your comments|Free CONSULTATION|S.E London Hypnotherapy Practice: Welcome|-Bohangar Practice –|Seeking Multi Discpline Therapy?|Online &|Blackheath & Chistlehurst|Therapist|: Former City Analyst, Speciality Problem Simplification|Free CONSULTATION|Marc Bolan’s London House in Hackney: The Early Years|Marc Bolan was a British musician, singer-songwriter, and guitarist, who is best known as the founder, frontman, and driving force|Read More »|The Haunting Secrets Behind Marc Bolan’s Shrine|In 1977 Marc Bolan, a singer from Glam rock group T.Rex died in a car crash in London. The Singer,|Read More »|Step Back in Time with the Iconic Marc Bolan TV Show|Produced by Muriel Young, directed by Nicolas Ferguson, and shown on Granada Television for ITV. The year was 1977, and|Read More »|Bolan’s Premonitions on death: Fear of Driving|Marc Bolan was a legendary musician, songwriter, and frontman of the iconic British rock band T. Rex. His unique style|Read More »|Glam Rock Explained: The Marc Bolan Influence|What is Glam Rock? Glam rock, also known as glitter rock, is a music and fashion movement that originated in|Read More »|30th August 2014 Kate Bush 1st live comback after 35 years|21st September 1971 passing Old Grey Whistle Test, but what was it?|More Projects|0|0|votes|Article Rating|Subscribe|Notify of|new follow-up comments|new replies to my comments|I allow to use my email address and send notification about new comments and replies (you can unsubscribe at any time).|Label|{}|[+]|Name*|Email*|Label|{}|[+]|Name*|Email*|0|Comments|Inline Feedbacks|View all comments|Chris Burden American Pickup Truck at the Gagosian|Barbican Estate: Why it’s London’s Best-Kept Secret|What is the Lord Mayor’s Show Procession, The 692nd Lord Mayor – published Pictures!|Celebrating Zandra Rhodes’ Birthday ’40|Private Message the Hanger|HangerLondon | The London Blog | Written, filmed and photographed by the London bloggers. A photographic journey mixing travels to London’s Art & Culture and delving into the capital’s rich and diverse Historical back catalog.|As an Amazon Associate I earn from qualifying purchases|Website design photography and art by Hangerlondon|Copyright Notice of the Hangerlondon|Privacy, Terms & Conditions & other usage info|Disclaimer|© 2018-2020 All rights reserved | This website and its content is copyright of hangerlondon|wpDiscuz|0|0|Would love your thoughts, please comment.|x|(|)|x|||Reply|Insert|report this ad|x",
          "|Hardcover – 21 Sept. 2017|by|John Bramley|(Author)|4.5|4.5 out of 5 stars|77 ratings|See all formats and editions|Sorry, there was a problem loading this page. Try again.|Amazon Price|New from|Used from|Kindle Edition|\"Please retry\"|£7.33|—|—|Hardcover|\"Please retry\"|£7.21|—|£7.21|Kindle Edition|£7.33|Read with Our|Free App|Hardcover|£7.21|8 Used|from|£7.21|1 Collectible|from|£14.78|Marc Bolan was the wizard who brought magic to rock music - his heart beat to the rhythm of rock. Moving from early folk influences and songs on the mythology of Tolkien, he transformed himself into a unique, sparkling and effervescent glam-rock icon. His boogie roots combined with Marc's own natural glitter dust, and propelled him forward on an adventure, with fortunes that were to ebb and flow over a decade. His diamond-studded halo was extinguished on 16 September 1977, at a time when his music was in the ascendancy.|The annals of history are strewn with stories of artists who passed away in shocking circumstances of those that died too young, from substance abuse, mysterious illnesses or even murder. Sometimes, the shock of their passing immediately elevates their standing in cultural memory and cements their work in a favourable light. Marc Bolan died at twenty-nine years of age, in a tragic car crash - an accident that could have been avoided. However, it took many years for people to start appreciating what Marc Bolan brought to a rock music scene in the early seventies which had stagnated in some corners after the explosion of creativity in the sixties. Yet, gradually, acclaim has grown for how he enriched the period, bringing colour and humour to an increasingly leaden genre.|Much like Hendrix before him, and Cobain after him, his natural charisma and striking beauty have underpinned his status as a dreamlike bard, an enigmatic pin-up whom boys wished they looked like and girls wished they were with. Yet it was his scorching talent as a performer and songwriter which have formed the bedrock for longevity as a legend.|Including rare and unpublished photographs, and works of Marc's own poetry, this book is put together by a true, original fan - one who followed Marc Bolan on tour, who bought every piece of vinyl he released and who was fortunate enough to have made Marc's acquaintance during the peak of his career. Published forty years on from Bolan's death,|Beautiful Dreamer|is unashamedly a book of love, a book that every Marc Bolan fan will identify with, because it paints a picture of the man that the fans idolised, worshipped and continue to cherish to this day.|Read more|Previous page|Print length|272 pages|Language|English|Publisher|Music Press Books|Publication date|21 Sept. 2017|Dimensions|16 x 2.5 x 24 cm|ISBN-10|1786064480|ISBN-13|978-1786064486|See all details|Next page|What do customers buy after viewing this item?|Page|1|of|1|Start over|Page 1 of 1|Previous page|Highest rated|in this set of products|This item:|Marc Bolan - Beautiful Dreamer: Beautiful Dreamer|John Bramley|4.5 out of 5 stars|77|Hardcover|9 offers from|£7.21|Best Selling | Lowest Price|in this set of products|Bolan: The Rise And Fall of a 20th Century Superstar|Mark Paytress|4.4 out of 5 stars|146|Paperback|£9.95|£|9|.|95|Ride a White Swan: The Lives and Death of Marc Bolan|Lesley-Ann Jones|4.3 out of 5 stars|166|Paperback|£10.99|£|10|.|99|Get it as soon as|Tuesday, Jul 11|FREE Delivery on orders dispatched by Amazon over £10|Only 7 left in stock (more on the way).|Next page|Product description|Book Description|Forty years after his tragic death, this homage to Marc Bolan pays tribute to one of the pioneers of the glam rock movement.|About the Author|John Bramley was born in New York in 1955 and moved to England with his parents at the age of three. Marc Bolan had a massive effect on his life and, between 1980 and 1997, John undertook the rights to the Marc Bolan catalogue, ensuring that the legacy continued. As well as this biography, John has written the Marc Bolan|Illustrated discography,|and is a leading authority on T. Rex.|He attended Sheffield Hallam University, obtaining a degree in Sociology. A qualified generalist Advisor with the CAB, he now works helping people with Alcohol and Drug Addiction.|Product details|Publisher\n                                    ‏\n                                        :\n                                    ‎|Music Press Books (21 Sept. 2017)|Language\n                                    ‏\n                                        :\n                                    ‎|English|Hardcover\n                                    ‏\n                                        :\n                                    ‎|272 pages|ISBN-10\n                                    ‏\n                                        :\n                                    ‎|1786064480|ISBN-13\n                                    ‏\n                                        :\n                                    ‎|978-1786064486|Dimensions\n                                    ‏\n                                        :\n                                    ‎|16 x 2.5 x 24 cm|Best Sellers Rank:|606,962 in Books (|See Top 100 in Books|)|2,969 in|Popular Music|3,611 in|Rock & Pop Musician Biographies|4,662 in|Rock Music|Customer reviews:|4.5|4.5 out of 5 stars|77 ratings|About the author|Follow authors to get new release updates, plus improved recommendations.|John Bramley|Brief content visible, double tap to read full content.|Full content visible, double tap to read brief content.|Discover more of the author’s books, see similar authors, read author blogs and more|Read more|Read less|Products related to this item|Sponsored|Hide feedback|Page|1|of|1|Start over|Page 1 of 1|Previous page of related Sponsored Products|Feedback|TOP OF THE POPS: THE LOST YEARS REDISCOVERED 1964-1975|Peter Checksfield|79|Paperback|£17.65|Feedback|Guitar Exercises for Beginners: 10x Your Guitar Skills in 10 Minutes a Day (Guitar ...|Guitar Head|2,388|Paperback|£14.29|Feedback|Pentatonic Scale Fluency: Learn How To Play the Minor Pentatonic Scale Effortlessly...|Lee Nichols|1,370|Paperback|£6.99|Feedback|Money Power Love: A Novel|Joss Sheldon|222|Hardback|£14.99|Next page of related Sponsored Products|Customer reviews|4.5 out of 5 stars|4.5 out of 5|77 global ratings|5 star|75%|4 star|8%|3 star|10%|2 star|4%|1 star|3%|How customer reviews and ratings work|Customer Reviews, including Product Star Ratings, help customers to learn more about the product and decide whether it is the right product for them.|To calculate the overall star rating and percentage breakdown by star, we don’t use a simple average. Instead, our system considers things like how recent a review is and if the reviewer bought the item on Amazon. It also analyses reviews to verify trustworthiness.|Learn more how customers reviews work on Amazon|Sort reviews by|Top reviews|Most recent|Top reviews|Top reviews from United Kingdom|There was a problem filtering reviews right now. Please try again later.|D R COOPER|4.0 out of 5 stars|One for the Bolan Bookshelf.|Reviewed in the United Kingdom 🇬🇧 on 27 September 2017|Verified Purchase|Nothing wrong with a Bolan biography.|What I object to is shoe-horning gig dates/venues into an ongoing narrative when the selfsame info is comprehensively covered in a separate later section.It simply reads like a publishers intern was told to pad out the text with the former...|Normally I find \"I was there\" gig one-upmanship tedious,but concede you were with Marc from early days onward and therefore commendable,Mr Bramley.|So too the included photo's,most especially those from Kathleen Heron Andryszewski-who every Bolan fan should be eternally grateful to for giving Marc the hug we all continue to give his memory down the years.|Read more|8 people found this helpful|Helpful|Report|staceygrove|5.0 out of 5 stars|Must have for any Bolan fan|Reviewed in the United Kingdom 🇬🇧 on 13 November 2017|Verified Purchase|Great read by someone who knows what he is talking about, so nice to read a book that is written from a fans perspective and John Bramley is a long term fan. John and his wife Shan carried on the Bolan name in a time when there was no internet or mobile phones for fans to see or hear their idols. In a word there would have been no hope of ever hearing anything about Marc once he had died,but they continued  tirelessly sending out issues of Rarn magazine each month, which I for one could not wait to receive. I particularly liked the list of dates and venues T.Rex had played at, as you get older you forget these details. Great to see participation from other life long fans as well, this book was very nostalgic and bought back loads of wonderful memories|Read more|9 people found this helpful|Helpful|Report|Michael Stafford|5.0 out of 5 stars|Excellent book !|Reviewed in the United Kingdom 🇬🇧 on 1 December 2017|Verified Purchase|As a Bolan fan of more than 45 years, and having read countless books and articles on the ‘ Main Man ‘ I thought I knew all there was to know on the subject of Marc Bolan. How wrong I was ! John Bramley has written a book brimming with enthusiasm about his subject as you might expect, and it is packed with detail much of which was new to me. The photographs are fantastic as well, and many of them were also new to me. I enjoyed the book so much that I ordered another copy as a Christmas present. I’d recommend this not just to Bolan fans but to anyone with any interest in pop culture. It’s been a pleasure reading this book and being transported back to my teenage years !|Read more|6 people found this helpful|Helpful|Report|chris black|4.0 out of 5 stars|Interesting Read|Reviewed in the United Kingdom 🇬🇧 on 25 August 2018|Verified Purchase|Many Bolan fans will already know / have some of the articles featured in this book but still contained enough interesting thoughts about the Main Man himself. Contains some amazing photos of Marc alongside the advertising pages used to promote the albums and gigs featured. If you are a fan of Marc and his music then this is a must-read as its written by the fans for the Children Of The Revolution out there.|Read more|One person found this helpful|Helpful|Report|Desdemona|2.0 out of 5 stars|Whatever Happened to the....Fan Facts?|Reviewed in the United Kingdom 🇬🇧 on 3 October 2017|Verified Purchase|I was so looking forward to this Bolan Book especially as it was coming from a Huge Bolan Fan...I found it rushed and the mistakes must have missed the intern proof reader...Marc and June were not living in Marble Arch when Ride A White Swan was put to demo tape..Weeley August 1971...”the set included several songs that were to appear on the Slider and single flip sides nearly two years later “Weeley Summer 1971-Slider Summer 72! There was no official merchandise available at Wembley Concert March 1972...we just got the Melody Maker and Record Mirror Specials from WH Smiths..The Unofficial Sellers outside the venue got our new pence..The photographs are uninspired...nothing from the Pete Sanders archive..looks like just a few clicks from the Getty website.Captions are dire..”relishing the bright lights of the Television stage” why not include the correct timeline of Don  Kirschners Rock Concert October 8 1974?  T.rex Perform On Top of The Pops in 1970 page 90..again lifted from Getty but another incorrect caption.Should Read 1972..A Die Hard Fan should have noticed the mistake..Blurred photo from the Essen 1973 Concert..I have been a Fan since Desdemona..(yes 50 Years! ) and I may sound a bit “nit picky “ but with very few good books on Bolan this should have been much better especially considering the authors Bolan History...Disappointing...|Read more|12 people found this helpful|Helpful|Report|Amazon Customer|5.0 out of 5 stars|I love this book great value for money|Reviewed in the United Kingdom 🇬🇧 on 20 February 2018|Verified Purchase|I love this book great value for money.  The wonderful Marc Bolan so Missed taking me back to my memories of hanging out|24/7 around Marc in the 70s in London. A fabulous book. I adore the cover too, the colours are so Bolan.  The most colourful person Full of|Light I've ever seen. The Greatest Star we ever had.  He oozed Star quality. I love him miss him and this book is so helpful for me|taking me back where I can almost feel his presence.  Fantastic.|Read more|One person found this helpful|Helpful|Report|Mr D quotrex|5.0 out of 5 stars|Well Mr John Bramley this book is terrible..|Reviewed in the United Kingdom 🇬🇧 on 9 November 2017|Verified Purchase|Well Mr John Bramley this book is terrible..........if you want to lose track of time !! Thought I'd read for a few minutes in bed... 1hour later.. next night 2+hrs..... Why! because its so different from other MARC books out there and so well written, its just flows along with every page turn!!|P.S John....if (hope) you write another one. PLEASE ask the publishers to put a 'RED WARNING' label on cover...\"Warning to readers,  Don't read as a little LIGHT read in bed.  LOL|Read more|One person found this helpful|Helpful|Report|Mr. John Brooks Jnr|5.0 out of 5 stars|Loved it|Reviewed in the United Kingdom 🇬🇧 on 3 December 2017|Verified Purchase|Loved reading  great for any Bolan. Fan and non Bolan fan a like.. Pity I couldn't get my review of seeing Marc live published in the book as I was at our caravan and my wl fi was playing up...I particular liked the fans contribution and all the tour dates of marcs career.. It was an easy read with some colourful pictures and wrote by a real Bolan fan for us the Bolan community... So its 5 stars from me|Read more|One person found this helpful|Helpful|Report|See all reviews|Your recently viewed items and featured recommendations|›|View or edit your browsing history|After viewing product detail pages, look here to find an easy way to navigate back to pages you are interested in.|Your recently viewed items and featured recommendations|›|View or edit your browsing history|After viewing product detail pages, look here to find an easy way to navigate back to pages you are interested in.|Back to top|Get to Know Us|Careers|About Us|UK Modern Slavery Statement|Sustainability|Amazon Science|Make Money with Us|Sell on Amazon|Sell on Amazon Business|Sell on Amazon Handmade|Sell on Amazon Launchpad|Protect and build your brand|Associates Programme|Fulfilment by Amazon|Seller Fulfilled Prime|Advertise Your Products|Independently Publish with Us|Amazon Pay|Host an Amazon Hub|›|See More Make Money with Us|Amazon Payment Methods|Amazon Platinum Mastercard|Amazon Classic Mastercard|Amazon Money Store|Gift Cards|Amazon Currency Converter|Payment Methods Help|Shop with Points|Top Up Your Account|Top Up Your Account in Store|Let Us Help You|COVID-19 and Amazon|Track Packages or View Orders|Delivery Rates & Policies|Amazon Prime|Returns & Replacements|Recycling|Manage Your Content and Devices|Amazon Mobile App|Customer Service|Accessibility|Australia|Brazil|Canada|China|France|Germany|India|Italy|Japan|Mexico|Netherlands|Poland|Singapore|Spain|Turkey|United Arab Emirates|United States|Amazon Music|Stream millions|of songs|AbeBooks|Books, art|& collectables|ACX|Audiobook Publishing|Made Easy|Amazon Web Services|Scalable Cloud|Computing Services|Audible|Download Audiobooks|Book Depository|Books With Free|Delivery Worldwide|DPReview|Digital|Photography|Goodreads|Book reviews|& recommendations|Amazon Home Services|Experienced pros|Happiness Guarantee|IMDb|Movies, TV|& Celebrities|Kindle Direct Publishing|Indie Digital & Print Publishing|Made Easy|Shopbop|Designer|Fashion Brands|Amazon Warehouse|Deep Discounts|Open-Box Products|Amazon Business|Service for|business customers|Whole Foods Market|We Believe in|Real Food|Conditions of Use & Sale|Privacy Notice|Cookies Notice|Interest-Based Ads Notice|© 1996-2022, Amazon.com, Inc. or its affiliates",
          "|The accident happened on a dark, blind spot section of the road. The car hit a tree with such force that it wrapped around the trunk, instantly killing Bolan. Jones was fortunate enough to survive the crash but sustained serious injuries, including a broken arm and jaw.|The news of Bolan’s tragic death shocked his fans and the music industry. Bolan was a charismatic and influential figure in the glam rock era of the 1970s, with hits like “Get It On” and “Telegram Sam” that made him a household name. He was just 29 years old at the time of his death.|The accident on Gipsy Lane highlighted the dangers of driving on poorly lit, rural roads. Bolan’s death also highlighted the importance of wearing seat belts, as it was later revealed that Bolan had not been wearing one at the time of the crash.|Despite the tragedy, Bolan’s music and legacy continue to inspire new generations of musicians and fans. The impact of his death was felt throughout the music industry, with artists like David Bowie paying tribute to his talent and influence.|Eerily Bolan did have some|premonitions|on how he would die, in a|car crash|Linked image from (|https://www.marc-bolan.net/members/index-2.html|)|Marc Bolan Shrine|There is a Marc Bolan Shrine, on the B306 not far from Barnes Rail station 10 gipsy lane London SW15 5RG.|Advertisements|S.E London Hypnotherapy Practice: Short Goodbye Message:|MULTI MODAL THERAPY:|Online & Locations of|Blackheath & Chistlehurst. (Cognitive, Behavioural, Hypnotherapy, Mindfulness etc.)|THERAPIST|: Former City Analyst, City of London, Singapore, Zurich and Frankfurt.|If you are seeking Therapy please reach out for an initial|free consultation call|.|Bohangar Hypnotherapy Practice. Hope you enjoy this blog post, would love to hear your comments|Free CONSULTATION|S.E London Hypnotherapy Practice: Welcome|-Bohangar Practice –|Seeking Multi Discpline Therapy?|Online &|Blackheath & Chistlehurst|Therapist|: Former City Analyst, Speciality Problem Simplification|Free CONSULTATION|Marc Bolan’s London House in Hackney: The Early Years|Marc Bolan was a British musician, singer-songwriter, and guitarist, who is best known as the founder, frontman, and driving force|Read More »|The Haunting Secrets Behind Marc Bolan’s Shrine|In 1977 Marc Bolan, a singer from Glam rock group T.Rex died in a car crash in London. The Singer,|Read More »|Step Back in Time with the Iconic Marc Bolan TV Show|Produced by Muriel Young, directed by Nicolas Ferguson, and shown on Granada Television for ITV. The year was 1977, and|Read More »|Bolan’s Premonitions on death: Fear of Driving|Marc Bolan was a legendary musician, songwriter, and frontman of the iconic British rock band T. Rex. His unique style|Read More »|Glam Rock Explained: The Marc Bolan Influence|What is Glam Rock? Glam rock, also known as glitter rock, is a music and fashion movement that originated in|Read More »|30th August 2014 Kate Bush 1st live comback after 35 years|21st September 1971 passing Old Grey Whistle Test, but what was it?|More Projects|0|0|votes|Article Rating|Subscribe|Notify of|new follow-up comments|new replies to my comments|I allow to use my email address and send notification about new comments and replies (you can unsubscribe at any time).|Label|{}|[+]|Name*|Email*|Label|{}|[+]|Name*|Email*|0|Comments|Inline Feedbacks|View all comments|Chris Burden American Pickup Truck at the Gagosian|Barbican Estate: Why it’s London’s Best-Kept Secret|What is the Lord Mayor’s Show Procession, The 692nd Lord Mayor – published Pictures!|Celebrating Zandra Rhodes’ Birthday ’40|Private Message the Hanger|HangerLondon | The London Blog | Written, filmed and photographed by the London bloggers. A photographic journey mixing travels to London’s Art & Culture and delving into the capital’s rich and diverse Historical back catalog.|As an Amazon Associate I earn from qualifying purchases|Website design photography and art by Hangerlondon|Copyright Notice of the Hangerlondon|Privacy, Terms & Conditions & other usage info|Disclaimer|© 2018-2020 All rights reserved | This website and its content is copyright of hangerlondon|wpDiscuz|0|0|Would love your thoughts, please comment.|x|(|)|x|||Reply|Insert|report this ad|x",
          "|Hardcover – 21 Sept. 2017|by|John Bramley|(Author)|4.5|4.5 out of 5 stars|77 ratings|See all formats and editions|Sorry, there was a problem loading this page. Try again.|Amazon Price|New from|Used from|Kindle Edition|\"Please retry\"|£7.33|—|—|Hardcover|\"Please retry\"|£7.21|—|£7.21|Kindle Edition|£7.33|Read with Our|Free App|Hardcover|£7.21|8 Used|from|£7.21|1 Collectible|from|£14.78|Marc Bolan was the wizard who brought magic to rock music - his heart beat to the rhythm of rock. Moving from early folk influences and songs on the mythology of Tolkien, he transformed himself into a unique, sparkling and effervescent glam-rock icon. His boogie roots combined with Marc's own natural glitter dust, and propelled him forward on an adventure, with fortunes that were to ebb and flow over a decade. His diamond-studded halo was extinguished on 16 September 1977, at a time when his music was in the ascendancy.|The annals of history are strewn with stories of artists who passed away in shocking circumstances of those that died too young, from substance abuse, mysterious illnesses or even murder. Sometimes, the shock of their passing immediately elevates their standing in cultural memory and cements their work in a favourable light. Marc Bolan died at twenty-nine years of age, in a tragic car crash - an accident that could have been avoided. However, it took many years for people to start appreciating what Marc Bolan brought to a rock music scene in the early seventies which had stagnated in some corners after the explosion of creativity in the sixties. Yet, gradually, acclaim has grown for how he enriched the period, bringing colour and humour to an increasingly leaden genre.|Much like Hendrix before him, and Cobain after him, his natural charisma and striking beauty have underpinned his status as a dreamlike bard, an enigmatic pin-up whom boys wished they looked like and girls wished they were with. Yet it was his scorching talent as a performer and songwriter which have formed the bedrock for longevity as a legend.|Including rare and unpublished photographs, and works of Marc's own poetry, this book is put together by a true, original fan - one who followed Marc Bolan on tour, who bought every piece of vinyl he released and who was fortunate enough to have made Marc's acquaintance during the peak of his career. Published forty years on from Bolan's death,|Beautiful Dreamer|is unashamedly a book of love, a book that every Marc Bolan fan will identify with, because it paints a picture of the man that the fans idolised, worshipped and continue to cherish to this day.|Read more|Previous page|Print length|272 pages|Language|English|Publisher|Music Press Books|Publication date|21 Sept. 2017|Dimensions|16 x 2.5 x 24 cm|ISBN-10|1786064480|ISBN-13|978-1786064486|See all details|Next page|What do customers buy after viewing this item?|Page|1|of|1|Start over|Page 1 of 1|Previous page|Highest rated|in this set of products|This item:|Marc Bolan - Beautiful Dreamer: Beautiful Dreamer|John Bramley|4.5 out of 5 stars|77|Hardcover|9 offers from|£7.21|Best Selling | Lowest Price|in this set of products|Bolan: The Rise And Fall of a 20th Century Superstar|Mark Paytress|4.4 out of 5 stars|146|Paperback|£9.95|£|9|.|95|Ride a White Swan: The Lives and Death of Marc Bolan|Lesley-Ann Jones|4.3 out of 5 stars|166|Paperback|£10.99|£|10|.|99|Get it as soon as|Tuesday, Jul 11|FREE Delivery on orders dispatched by Amazon over £10|Only 7 left in stock (more on the way).|Next page|Product description|Book Description|Forty years after his tragic death, this homage to Marc Bolan pays tribute to one of the pioneers of the glam rock movement.|About the Author|John Bramley was born in New York in 1955 and moved to England with his parents at the age of three. Marc Bolan had a massive effect on his life and, between 1980 and 1997, John undertook the rights to the Marc Bolan catalogue, ensuring that the legacy continued. As well as this biography, John has written the Marc Bolan|Illustrated discography,|and is a leading authority on T. Rex.|He attended Sheffield Hallam University, obtaining a degree in Sociology. A qualified generalist Advisor with the CAB, he now works helping people with Alcohol and Drug Addiction.|Product details|Publisher\n                                    ‏\n                                        :\n                                    ‎|Music Press Books (21 Sept. 2017)|Language\n                                    ‏\n                                        :\n                                    ‎|English|Hardcover\n                                    ‏\n                                        :\n                                    ‎|272 pages|ISBN-10\n                                    ‏\n                                        :\n                                    ‎|1786064480|ISBN-13\n                                    ‏\n                                        :\n                                    ‎|978-1786064486|Dimensions\n                                    ‏\n                                        :\n                                    ‎|16 x 2.5 x 24 cm|Best Sellers Rank:|606,962 in Books (|See Top 100 in Books|)|2,969 in|Popular Music|3,611 in|Rock & Pop Musician Biographies|4,662 in|Rock Music|Customer reviews:|4.5|4.5 out of 5 stars|77 ratings|About the author|Follow authors to get new release updates, plus improved recommendations.|John Bramley|Brief content visible, double tap to read full content.|Full content visible, double tap to read brief content.|Discover more of the author’s books, see similar authors, read author blogs and more|Read more|Read less|Products related to this item|Sponsored|Hide feedback|Page|1|of|1|Start over|Page 1 of 1|Previous page of related Sponsored Products|Feedback|TOP OF THE POPS: THE LOST YEARS REDISCOVERED 1964-1975|Peter Checksfield|79|Paperback|£17.65|Feedback|Guitar Exercises for Beginners: 10x Your Guitar Skills in 10 Minutes a Day (Guitar ...|Guitar Head|2,388|Paperback|£14.29|Feedback|Pentatonic Scale Fluency: Learn How To Play the Minor Pentatonic Scale Effortlessly...|Lee Nichols|1,370|Paperback|£6.99|Feedback|Money Power Love: A Novel|Joss Sheldon|222|Hardback|£14.99|Next page of related Sponsored Products|Customer reviews|4.5 out of 5 stars|4.5 out of 5|77 global ratings|5 star|75%|4 star|8%|3 star|10%|2 star|4%|1 star|3%|How customer reviews and ratings work|Customer Reviews, including Product Star Ratings, help customers to learn more about the product and decide whether it is the right product for them.|To calculate the overall star rating and percentage breakdown by star, we don’t use a simple average. Instead, our system considers things like how recent a review is and if the reviewer bought the item on Amazon. It also analyses reviews to verify trustworthiness.|Learn more how customers reviews work on Amazon|Sort reviews by|Top reviews|Most recent|Top reviews|Top reviews from United Kingdom|There was a problem filtering reviews right now. Please try again later.|D R COOPER|4.0 out of 5 stars|One for the Bolan Bookshelf.|Reviewed in the United Kingdom 🇬🇧 on 27 September 2017|Verified Purchase|Nothing wrong with a Bolan biography.|What I object to is shoe-horning gig dates/venues into an ongoing narrative when the selfsame info is comprehensively covered in a separate later section.It simply reads like a publishers intern was told to pad out the text with the former...|Normally I find \"I was there\" gig one-upmanship tedious,but concede you were with Marc from early days onward and therefore commendable,Mr Bramley.|So too the included photo's,most especially those from Kathleen Heron Andryszewski-who every Bolan fan should be eternally grateful to for giving Marc the hug we all continue to give his memory down the years.|Read more|8 people found this helpful|Helpful|Report|staceygrove|5.0 out of 5 stars|Must have for any Bolan fan|Reviewed in the United Kingdom 🇬🇧 on 13 November 2017|Verified Purchase|Great read by someone who knows what he is talking about, so nice to read a book that is written from a fans perspective and John Bramley is a long term fan. John and his wife Shan carried on the Bolan name in a time when there was no internet or mobile phones for fans to see or hear their idols. In a word there would have been no hope of ever hearing anything about Marc once he had died,but they continued  tirelessly sending out issues of Rarn magazine each month, which I for one could not wait to receive. I particularly liked the list of dates and venues T.Rex had played at, as you get older you forget these details. Great to see participation from other life long fans as well, this book was very nostalgic and bought back loads of wonderful memories|Read more|9 people found this helpful|Helpful|Report|Michael Stafford|5.0 out of 5 stars|Excellent book !|Reviewed in the United Kingdom 🇬🇧 on 1 December 2017|Verified Purchase|As a Bolan fan of more than 45 years, and having read countless books and articles on the ‘ Main Man ‘ I thought I knew all there was to know on the subject of Marc Bolan. How wrong I was ! John Bramley has written a book brimming with enthusiasm about his subject as you might expect, and it is packed with detail much of which was new to me. The photographs are fantastic as well, and many of them were also new to me. I enjoyed the book so much that I ordered another copy as a Christmas present. I’d recommend this not just to Bolan fans but to anyone with any interest in pop culture. It’s been a pleasure reading this book and being transported back to my teenage years !|Read more|6 people found this helpful|Helpful|Report|chris black|4.0 out of 5 stars|Interesting Read|Reviewed in the United Kingdom 🇬🇧 on 25 August 2018|Verified Purchase|Many Bolan fans will already know / have some of the articles featured in this book but still contained enough interesting thoughts about the Main Man himself. Contains some amazing photos of Marc alongside the advertising pages used to promote the albums and gigs featured. If you are a fan of Marc and his music then this is a must-read as its written by the fans for the Children Of The Revolution out there.|Read more|One person found this helpful|Helpful|Report|Desdemona|2.0 out of 5 stars|Whatever Happened to the....Fan Facts?|Reviewed in the United Kingdom 🇬🇧 on 3 October 2017|Verified Purchase|I was so looking forward to this Bolan Book especially as it was coming from a Huge Bolan Fan...I found it rushed and the mistakes must have missed the intern proof reader...Marc and June were not living in Marble Arch when Ride A White Swan was put to demo tape..Weeley August 1971...”the set included several songs that were to appear on the Slider and single flip sides nearly two years later “Weeley Summer 1971-Slider Summer 72! There was no official merchandise available at Wembley Concert March 1972...we just got the Melody Maker and Record Mirror Specials from WH Smiths..The Unofficial Sellers outside the venue got our new pence..The photographs are uninspired...nothing from the Pete Sanders archive..looks like just a few clicks from the Getty website.Captions are dire..”relishing the bright lights of the Television stage” why not include the correct timeline of Don  Kirschners Rock Concert October 8 1974?  T.rex Perform On Top of The Pops in 1970 page 90..again lifted from Getty but another incorrect caption.Should Read 1972..A Die Hard Fan should have noticed the mistake..Blurred photo from the Essen 1973 Concert..I have been a Fan since Desdemona..(yes 50 Years! ) and I may sound a bit “nit picky “ but with very few good books on Bolan this should have been much better especially considering the authors Bolan History...Disappointing...|Read more|12 people found this helpful|Helpful|Report|Amazon Customer|5.0 out of 5 stars|I love this book great value for money|Reviewed in the United Kingdom 🇬🇧 on 20 February 2018|Verified Purchase|I love this book great value for money.  The wonderful Marc Bolan so Missed taking me back to my memories of hanging out|24/7 around Marc in the 70s in London. A fabulous book. I adore the cover too, the colours are so Bolan.  The most colourful person Full of|Light I've ever seen. The Greatest Star we ever had.  He oozed Star quality. I love him miss him and this book is so helpful for me|taking me back where I can almost feel his presence.  Fantastic.|Read more|One person found this helpful|Helpful|Report|Mr D quotrex|5.0 out of 5 stars|Well Mr John Bramley this book is terrible..|Reviewed in the United Kingdom 🇬🇧 on 9 November 2017|Verified Purchase|Well Mr John Bramley this book is terrible..........if you want to lose track of time !! Thought I'd read for a few minutes in bed... 1hour later.. next night 2+hrs..... Why! because its so different from other MARC books out there and so well written, its just flows along with every page turn!!|P.S John....if (hope) you write another one. PLEASE ask the publishers to put a 'RED WARNING' label on cover...\"Warning to readers,  Don't read as a little LIGHT read in bed.  LOL|Read more|One person found this helpful|Helpful|Report|Mr. John Brooks Jnr|5.0 out of 5 stars|Loved it|Reviewed in the United Kingdom 🇬🇧 on 3 December 2017|Verified Purchase|Loved reading  great for any Bolan. Fan and non Bolan fan a like.. Pity I couldn't get my review of seeing Marc live published in the book as I was at our caravan and my wl fi was playing up...I particular liked the fans contribution and all the tour dates of marcs career.. It was an easy read with some colourful pictures and wrote by a real Bolan fan for us the Bolan community... So its 5 stars from me|Read more|One person found this helpful|Helpful|Report|See all reviews|Your recently viewed items and featured recommendations|›|View or edit your browsing history|After viewing product detail pages, look here to find an easy way to navigate back to pages you are interested in.|Your recently viewed items and featured recommendations|›|View or edit your browsing history|After viewing product detail pages, look here to find an easy way to navigate back to pages you are interested in.|Back to top|Get to Know Us|Careers|About Us|UK Modern Slavery Statement|Sustainability|Amazon Science|Make Money with Us|Sell on Amazon|Sell on Amazon Business|Sell on Amazon Handmade|Sell on Amazon Launchpad|Protect and build your brand|Associates Programme|Fulfilment by Amazon|Seller Fulfilled Prime|Advertise Your Products|Independently Publish with Us|Amazon Pay|Host an Amazon Hub|›|See More Make Money with Us|Amazon Payment Methods|Amazon Platinum Mastercard|Amazon Classic Mastercard|Amazon Money Store|Gift Cards|Amazon Currency Converter|Payment Methods Help|Shop with Points|Top Up Your Account|Top Up Your Account in Store|Let Us Help You|COVID-19 and Amazon|Track Packages or View Orders|Delivery Rates & Policies|Amazon Prime|Returns & Replacements|Recycling|Manage Your Content and Devices|Amazon Mobile App|Customer Service|Accessibility|Australia|Brazil|Canada|China|France|Germany|India|Italy|Japan|Mexico|Netherlands|Poland|Singapore|Spain|Turkey|United Arab Emirates|United States|Amazon Music|Stream millions|of songs|AbeBooks|Books, art|& collectables|ACX|Audiobook Publishing|Made Easy|Amazon Web Services|Scalable Cloud|Computing Services|Audible|Download Audiobooks|Book Depository|Books With Free|Delivery Worldwide|DPReview|Digital|Photography|Goodreads|Book reviews|& recommendations|Amazon Home Services|Experienced pros|Happiness Guarantee|IMDb|Movies, TV|& Celebrities|Kindle Direct Publishing|Indie Digital & Print Publishing|Made Easy|Shopbop|Designer|Fashion Brands|Amazon Warehouse|Deep Discounts|Open-Box Products|Amazon Business|Service for|business customers|Whole Foods Market|We Believe in|Real Food|Conditions of Use & Sale|Privacy Notice|Cookies Notice|Interest-Based Ads Notice|© 1996-2022, Amazon.com, Inc. or its affiliates",
          "|Marc Bolan was a British musician, singer-songwriter, and guitarist, who is best known as the founder, frontman, and driving force behind the legendary glam rock band T. Rex. Born Mark Feld in London in 1947, Bolan’s life and career were marked by his passionate love of music, his unique artistic vision, and his ability to capture the spirit of the times in his music.",
          "|Marc Bolan, born Mark Feld on 30/9/1947  grew up in London’s Stoke Newington and lived in this house at 25 Stoke Newington Common. Stoke Newington was an area that was undergoing significant social and cultural changes during the 1950s and 1960s. It was a diverse neighborhood that was home to a vibrant artistic community, and Bolan was deeply influenced by the music, fashion, and literature that surrounded him. He attended the local William Patten Primary School and then the Uppingham School in Rutland before dropping out at the age of 15 to pursue a career in music.|Street signs on the corner house next to where Bolan Lived|Top Book Picks on Stoke Newington on the Amazon Store|As young children, Bolan and his brother were not allowed to be street urchins when younger. Supportive hard-working parents. Bolan had a traditional time playing around the home, and small yard, making plasticine dinosaurs, and enjoying family trips to local parks swans and deer, and places like Margate seaside.|Bolan’s Education|Marc Bolan went to Northwold Primary School, and as is the tradition in England, the school was a short walk from his home.|Northwold Primary School that Mark Bolan attended Hackney London|Northwold Primary school where Mark Bolan went to school.|Bolan the dyslexic|As Bolan grew up more demands were being made by the school of the education system, and the school of Life.  Learning differences were not well understood or even spotted back then, let alone catered for. Even in modern times, this is still somewhat of a challenge for anyone to cope with.|Perhaps being someone with dyslexia was where the outsider comes from, many people with learning differences learn to adapt, fit in, observe others, mimic find other ways to do things and overcome. At the age of 9, he was interested in learning to play the guitar and through his mother’s tenacity received his very own instrument.|Bolan and the 11 Plus Exam|Then came the school of life, the social hopscotch we all go through.  Finding our identity, interests, role models, and friends’ hobbies.  Bolan did not pass the 11 plus exam, and so did not attend the strict grammar school world.|Stoke Newington Common Opposite the house where Marc Bolan grew up|Boys stone sign Northwold Primary school were Marc Bolan went to school.|Bolan Expelled from School|He was expelled from school, by his mid-teens for bad behavior. But Bolan educated himself, as he did go to the library on Church Street. It is known he was read to by others too. Books such as Tolkien, Hobbit, and Lord of the Rings. He also read about poets and was captivated by a historic character Beau Brummel who he took on as a role model.|Hackney Empire|Bolan’s Family Roots and cultural influences|The cosmopolitan influences he was exposed to also came because his family heritage came from diverse backgrounds Father’s connections were Jewish Rusian and Polish. His mother was of a different cultural background but they formed a modern integrated adaptation. Bolan went to Jewish Youth clubs in the Stamford Hill area. At School formed a band and one of the young local girl singers was Helen Shapiro!|Musicians that inspired Bolan|Eddie Cochran, Elvis, Cliff Richard, Chuck Berry, Gene Vincent, Arthur Crudup. He also met Eddie Cochran when he performed in London briefly because he had the nerve to ask him if he could carry his guitar from the venue of the Hackney Empire to his waiting limo car when he was around 13.  Bolan and his friends also went to the Empire on a regular basis because it is where the TV show OH Boy! was filmed.|The exploration of Bolan’s London explores the boyhood home and haunts in Stoke Newington to what made Bolan a standout Music Legend in the Glam Rock Music genre|Marc Bolan still has a fan base all over the world, and made his mark in rock history, but what was his secret how did this London born Lad with mild dyslexia, break into the music business and become associated as someone who gave Glam Rock its punch poetry and above all Masculine and Feminine Power.|Top pick Marc Bolan books on the Amazon Store|Angelheaded Hipster: The Songs of Marc Bolan & T. Rex on Vinyl Record|Ride a White Swan – The Lives and Death of Marc Bolan – Lesley-Anne Jones|Marc Bolan Ride On – DVD|What made Bolan stand out?|Maintaining masculine energy whilst somehow being able to pull off the look of wearing clothes normally found in a woman’s wardrobe. Doing this alienates no one and still maintains dignity, kudos, and appeal to both women and men whilst getting them into your songs is no mean feat. He had sensitivity, sensuality, poetic mysticism, photogenic aura, and exhibitionist traits, a trendsetter who flirted with sexual ambiguity, but then also able to come across as a straight-dressing lad of the times in jeans and t-shirt down the pub. Being able to reach high and low notes. Maintaining some power behind the music, whilst resurrecting Rock-and-roll.|Bolan and Glitter|It is not clear if it was an assistant or Bolan who thought of using glitter. Either way, he seems one of the first to have dabbed the glitter on his face. He used feathers, seen wearing Mary Jane ladies’ shoes, or platforms, metallic glitter fabrics. He wore a big vintage-looking top hat. Iconic in many photos of him. Slash from Guns and Roses has similar hair and an iconic hat. Boland wore vivid colours such as electric peacock blues, and greens, rich mauve pinks.  Textures such as velvet, satin, fitted 70s style jackets, with flared trousers. Males wore eye makeup too, a smudgy sort of shadow, or black eyeliner.|The Melange of his predecessors|Having idols such as 50s Rock-and-roll Stars, Eddie Cochran, and Elvis, going through the mod and teddy boy and hippy experiments enabled his sound to blend that eerie nostalgia with something of the new frontiers that the 1970s bought. Perhaps the song lyrics “But you won’t fool the children of the revolution.” Sums up the fact that people were looking for something deeper more spiritual but with a vibrant punchiness, and laid-back coolness.  A culmination of the sounds of the decades before and yet still being able to call it their unique time. The 1970’s no matter what part of it you look at definitely was a magical revolving door that transformed the 60s to the 80s.|Stoke Newington Common opposite the house where Marc Bolan grew up|Advertisements|“Children of the Revolution”|Revolutionaries often conjure up being outsiders, rebels uncared for, neglected, and tough upbringings. Somewhat a different story with Bolan, which makes one wonder, how he went on to become a  revolutionary music-fashion God, of the Glam Rock era of the 1970s.  To understand what inspired and shaped people often one only has to go back to where they came from and explore and get an insight into influences as they grew up.|Bolan’s Fashion and Dressing to Impress|Fashions were changing and stars of the day dressed the part. Bolan became more aware of having to look and dress the part to gain social mobility, he had frequented the west end on the bus 73 route that went door to door from the home where he grew up, facing Stoke Newington Common. His mother worked in Soho at Berwick Market. His obsession with fashion is seen.|Bolan joined a model agency John Temple clothing catalogue which also displayed cardboard cutouts of models in shops. Bolan was photogenic.|Near Soho, Old Compton Street was the famous 2i’s coffee shop which was a launchpad for new artists of the day, where they could be talent-spotted. Cliff Richard and many other household names went through this place. Bolan visited it, it is now called Poppies Fish and Chips. Soho was a hive of activity.|There is more to this story and character, just like there are more songs to be sung and places in London to do with Bolan that we will return to. On the anniversary of his passing, here is a rose from the yards in front of the house area where he grew up.|I hope you enjoyed the article as much as we did tour these sites, taking the photographs. Please browse the site for other articles…enjoy|Closing Thoughts|In Stoke Newington, Bolan is still remembered fondly as a local hero. In 2002, a plaque was unveiled in his honor at the site of his childhood home on Queens Drive. The plaque reads: “Marc Bolan, 1947-1977, rock musician, poet, and visionary was born here and spent his childhood in Stoke Newington. He inspired us with his unique talent and remains an icon of our times.|Marc Bolan’s Map|S.E London Hypnotherapy Practice: Short Goodbye Message:|MULTI MODAL THERAPY:|Online & Locations of|Blackheath & Chistlehurst. (Cognitive, Behavioural, Hypnotherapy, Mindfulness etc.)|THERAPIST|: Former City Analyst, City of London, Singapore, Zurich and Frankfurt.|If you are seeking Therapy please reach out for an initial|free consultation call|.|Bohangar Hypnotherapy Practice. Hope you enjoy this blog post, would love to hear your comments|Free CONSULTATION|S.E London Hypnotherapy Practice: Welcome|-Bohangar Practice –|Seeking Multi Discpline Therapy?|Online &|Blackheath & Chistlehurst|Therapist|: Former City Analyst, Speciality Problem Simplification|Free CONSULTATION|Marc Bolan’s London House in Hackney: The Early Years|Marc Bolan was a British musician, singer-songwriter, and guitarist, who is best known as the founder, frontman, and driving force|Read More »|The Haunting Secrets Behind Marc Bolan’s Shrine|In 1977 Marc Bolan, a singer from Glam rock group T.Rex died in a car crash in London. The Singer,|Read More »|Step Back in Time with the Iconic Marc Bolan TV Show|Produced by Muriel Young, directed by Nicolas Ferguson, and shown on Granada Television for ITV. The year was 1977, and|Read More »|Bolan’s Premonitions on death: Fear of Driving|Marc Bolan was a legendary musician, songwriter, and frontman of the iconic British rock band T. Rex. His unique style|Read More »|Glam Rock Explained: The Marc Bolan Influence|What is Glam Rock? Glam rock, also known as glitter rock, is a music and fashion movement that originated in|Read More »|Discover London’s Rich Heritage at Goldsmiths’ Centre|The Secrets Behind London’s Rare Bronze RAF Squadron Badges: Revealed!|More Projects|4|2|votes|Article Rating|Subscribe|Notify of|new follow-up comments|new replies to my comments|I allow to use my email address and send notification about new comments and replies (you can unsubscribe at any time).|Label|{}|[+]|Name*|Email*|Label|{}|[+]|Name*|Email*|0|Comments|Inline Feedbacks|View all comments|Wembley Park Winterfest Light Trail Tech Explored|Light up your Hanukkah with the Laser Menorah festival in Islington|The remarkable journey of London’s Embankment from Wren to Bazalgette|A Festive Farewell: London’s Last Christmas Before Covid-19|report this ad|Private Message the Hanger|HangerLondon | The London Blog | Written, filmed and photographed by the London bloggers. A photographic journey mixing travels to London’s Art & Culture and delving into the capital’s rich and diverse Historical back catalog.|As an Amazon Associate I earn from qualifying purchases|Website design photography and art by Hangerlondon|Copyright Notice of the Hangerlondon|Privacy, Terms & Conditions & other usage info|Disclaimer|© 2018-2020 All rights reserved | This website and its content is copyright of hangerlondon|wpDiscuz|0|0|Would love your thoughts, please comment.|x|(|)|x|||Reply|Insert|x"
        ],
        "image_links": [
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Premonitions-768x432.png",
          "https://www.renemagritte.org/images/paintings/sixteenth-of-september.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2020/06/bolans-london-300x168.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2019/09/Marc-Bolan-Shrine-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-TV-Show-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Premonitions-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Glam-Rock-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-TV-Show-768x432.png",
          "https://www.hangerlondon.com/wp-content/uploads/2020/06/bolans-london-300x168.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2019/09/Marc-Bolan-Shrine-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-TV-Show-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Premonitions-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Glam-Rock-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2019/09/Marc-Bolan-Shrine-768x432.png",
          "https://www.marc-bolan.net/members/0-gallery-marc-1977-2/images/1977%20pic%2076%20car%20crash.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2020/06/bolans-london-300x168.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2019/09/Marc-Bolan-Shrine-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-TV-Show-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Premonitions-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Glam-Rock-300x169.png",
          "https://m.media-amazon.com/images/I/51Y2e2eJoxL._SY445_SX342_.jpg",
          "https://images-eu.ssl-images-amazon.com/images/I/71IEatJT88L._AC_UL200_SR200,200_.jpg",
          "https://images-eu.ssl-images-amazon.com/images/I/714c4JbH1iS._AC_UL200_SR200,200_.jpg",
          "https://images-eu.ssl-images-amazon.com/images/I/91oXwsUYpJL._AC_UL200_SR200,200_.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2020/06/bolans-london-768x429.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2018/09/Bolanstokehome10-ptf.jpg",
          "//ws-eu.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1786064480&Format=_SL250_&ID=AsinImage&MarketPlace=GB&ServiceVersion=20070822&WS=1&tag=hangerlondo02-21&language=en_GB",
          "https://ir-uk.amazon-adsystem.com/e/ir?t=hangerlondo02-21&language=en_GB&l=li3&o=2&a=1786064480",
          "//ws-eu.amazon-adsystem.com/widgets/q?_encoding=UTF8&MarketPlace=GB&ASIN=0750990910&ServiceVersion=20070822&ID=AsinImage&WS=1&Format=_SL250_&tag=hangerlondo02-21",
          "//ws-eu.amazon-adsystem.com/widgets/q?_encoding=UTF8&MarketPlace=GB&ASIN=0750937165&ServiceVersion=20070822&ID=AsinImage&WS=1&Format=_SL250_&tag=hangerlondo02-21",
          "https://www.hangerlondon.com/wp-content/uploads/2018/09/BolanSchoolNorthwold1-ptf-scaled-631x420.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2018/09/Bolanschoolnorthwold3-ptf-scaled-631x420.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2018/09/stokenewingtonCommon1-ptf-scaled-631x420.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2018/09/BolanSchoolNorthwold4-ptf-scaled-631x420.jpg",
          "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B0863TL17Q&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=hangerlondonu-20&language=en_US",
          "https://ir-na.amazon-adsystem.com/e/ir?t=hangerlondonu-20&language=en_US&l=li3&o=1&a=B0863TL17Q",
          "//ws-eu.amazon-adsystem.com/widgets/q?_encoding=UTF8&MarketPlace=GB&ASIN=1444758799&ServiceVersion=20070822&ID=AsinImage&WS=1&Format=_SL250_&tag=hangerlondo02-21",
          "//ws-eu.amazon-adsystem.com/widgets/q?_encoding=UTF8&MarketPlace=GB&ASIN=B08F2DCPKD&ServiceVersion=20070822&ID=AsinImage&WS=1&Format=_SL250_&tag=hangerlondo02-21",
          "https://www.hangerlondon.com/wp-content/uploads/2018/09/STokenewingtoncommon-ptf.jpg",
          "https://i2.wp.com/www.hangerlondon.com/wp-content/uploads/2018/09/Bolanrosenearhome-ptf-scaled.jpg?ssl=1",
          "https://i0.wp.com/www.hangerlondon.com/wp-content/uploads/2018/09/BolanBusroute73-ptf-scaled.jpg?ssl=1",
          "https://www.hangerlondon.com/wp-content/uploads/2020/06/bolans-london-300x168.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2019/09/Marc-Bolan-Shrine-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-TV-Show-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Premonitions-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Glam-Rock-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Premonitions-768x432.png",
          "https://www.renemagritte.org/images/paintings/sixteenth-of-september.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2020/06/bolans-london-300x168.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2019/09/Marc-Bolan-Shrine-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-TV-Show-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Premonitions-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Glam-Rock-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-TV-Show-768x432.png",
          "https://www.hangerlondon.com/wp-content/uploads/2020/06/bolans-london-300x168.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2019/09/Marc-Bolan-Shrine-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-TV-Show-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Premonitions-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Glam-Rock-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2019/09/Marc-Bolan-Shrine-768x432.png",
          "https://www.marc-bolan.net/members/0-gallery-marc-1977-2/images/1977%20pic%2076%20car%20crash.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2020/06/bolans-london-300x168.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2019/09/Marc-Bolan-Shrine-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-TV-Show-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Premonitions-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Glam-Rock-300x169.png",
          "https://m.media-amazon.com/images/I/51Y2e2eJoxL._SY445_SX342_.jpg",
          "https://images-eu.ssl-images-amazon.com/images/I/71IEatJT88L._AC_UL200_SR200,200_.jpg",
          "https://images-eu.ssl-images-amazon.com/images/I/714c4JbH1iS._AC_UL200_SR200,200_.jpg",
          "https://images-eu.ssl-images-amazon.com/images/I/91oXwsUYpJL._AC_UL200_SR200,200_.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2020/06/bolans-london-768x429.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2018/09/Bolanstokehome10-ptf.jpg",
          "//ws-eu.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1786064480&Format=_SL250_&ID=AsinImage&MarketPlace=GB&ServiceVersion=20070822&WS=1&tag=hangerlondo02-21&language=en_GB",
          "https://ir-uk.amazon-adsystem.com/e/ir?t=hangerlondo02-21&language=en_GB&l=li3&o=2&a=1786064480",
          "//ws-eu.amazon-adsystem.com/widgets/q?_encoding=UTF8&MarketPlace=GB&ASIN=0750990910&ServiceVersion=20070822&ID=AsinImage&WS=1&Format=_SL250_&tag=hangerlondo02-21",
          "//ws-eu.amazon-adsystem.com/widgets/q?_encoding=UTF8&MarketPlace=GB&ASIN=0750937165&ServiceVersion=20070822&ID=AsinImage&WS=1&Format=_SL250_&tag=hangerlondo02-21",
          "https://www.hangerlondon.com/wp-content/uploads/2018/09/BolanSchoolNorthwold1-ptf-scaled-631x420.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2018/09/Bolanschoolnorthwold3-ptf-scaled-631x420.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2018/09/stokenewingtonCommon1-ptf-scaled-631x420.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2018/09/BolanSchoolNorthwold4-ptf-scaled-631x420.jpg",
          "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B0863TL17Q&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=hangerlondonu-20&language=en_US",
          "https://ir-na.amazon-adsystem.com/e/ir?t=hangerlondonu-20&language=en_US&l=li3&o=1&a=B0863TL17Q",
          "//ws-eu.amazon-adsystem.com/widgets/q?_encoding=UTF8&MarketPlace=GB&ASIN=1444758799&ServiceVersion=20070822&ID=AsinImage&WS=1&Format=_SL250_&tag=hangerlondo02-21",
          "//ws-eu.amazon-adsystem.com/widgets/q?_encoding=UTF8&MarketPlace=GB&ASIN=B08F2DCPKD&ServiceVersion=20070822&ID=AsinImage&WS=1&Format=_SL250_&tag=hangerlondo02-21",
          "https://www.hangerlondon.com/wp-content/uploads/2018/09/STokenewingtoncommon-ptf.jpg",
          "https://i2.wp.com/www.hangerlondon.com/wp-content/uploads/2018/09/Bolanrosenearhome-ptf-scaled.jpg?ssl=1",
          "https://i0.wp.com/www.hangerlondon.com/wp-content/uploads/2018/09/BolanBusroute73-ptf-scaled.jpg?ssl=1",
          "https://www.hangerlondon.com/wp-content/uploads/2020/06/bolans-london-300x168.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2019/09/Marc-Bolan-Shrine-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-TV-Show-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Premonitions-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Glam-Rock-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Premonitions-768x432.png",
          "https://www.renemagritte.org/images/paintings/sixteenth-of-september.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2020/06/bolans-london-300x168.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2019/09/Marc-Bolan-Shrine-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-TV-Show-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Premonitions-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Glam-Rock-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-TV-Show-768x432.png",
          "https://www.hangerlondon.com/wp-content/uploads/2020/06/bolans-london-300x168.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2019/09/Marc-Bolan-Shrine-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-TV-Show-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Premonitions-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Glam-Rock-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2019/09/Marc-Bolan-Shrine-768x432.png",
          "https://www.marc-bolan.net/members/0-gallery-marc-1977-2/images/1977%20pic%2076%20car%20crash.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2020/06/bolans-london-300x168.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2019/09/Marc-Bolan-Shrine-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-TV-Show-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Premonitions-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Glam-Rock-300x169.png",
          "https://m.media-amazon.com/images/I/51Y2e2eJoxL._SY445_SX342_.jpg",
          "https://images-eu.ssl-images-amazon.com/images/I/71IEatJT88L._AC_UL200_SR200,200_.jpg",
          "https://images-eu.ssl-images-amazon.com/images/I/714c4JbH1iS._AC_UL200_SR200,200_.jpg",
          "https://images-eu.ssl-images-amazon.com/images/I/91oXwsUYpJL._AC_UL200_SR200,200_.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2020/06/bolans-london-768x429.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2018/09/Bolanstokehome10-ptf.jpg",
          "//ws-eu.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1786064480&Format=_SL250_&ID=AsinImage&MarketPlace=GB&ServiceVersion=20070822&WS=1&tag=hangerlondo02-21&language=en_GB",
          "https://ir-uk.amazon-adsystem.com/e/ir?t=hangerlondo02-21&language=en_GB&l=li3&o=2&a=1786064480",
          "//ws-eu.amazon-adsystem.com/widgets/q?_encoding=UTF8&MarketPlace=GB&ASIN=0750990910&ServiceVersion=20070822&ID=AsinImage&WS=1&Format=_SL250_&tag=hangerlondo02-21",
          "//ws-eu.amazon-adsystem.com/widgets/q?_encoding=UTF8&MarketPlace=GB&ASIN=0750937165&ServiceVersion=20070822&ID=AsinImage&WS=1&Format=_SL250_&tag=hangerlondo02-21",
          "https://www.hangerlondon.com/wp-content/uploads/2018/09/BolanSchoolNorthwold1-ptf-scaled-631x420.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2018/09/Bolanschoolnorthwold3-ptf-scaled-631x420.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2018/09/stokenewingtonCommon1-ptf-scaled-631x420.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2018/09/BolanSchoolNorthwold4-ptf-scaled-631x420.jpg",
          "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B0863TL17Q&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=hangerlondonu-20&language=en_US",
          "https://ir-na.amazon-adsystem.com/e/ir?t=hangerlondonu-20&language=en_US&l=li3&o=1&a=B0863TL17Q",
          "//ws-eu.amazon-adsystem.com/widgets/q?_encoding=UTF8&MarketPlace=GB&ASIN=1444758799&ServiceVersion=20070822&ID=AsinImage&WS=1&Format=_SL250_&tag=hangerlondo02-21",
          "//ws-eu.amazon-adsystem.com/widgets/q?_encoding=UTF8&MarketPlace=GB&ASIN=B08F2DCPKD&ServiceVersion=20070822&ID=AsinImage&WS=1&Format=_SL250_&tag=hangerlondo02-21",
          "https://www.hangerlondon.com/wp-content/uploads/2018/09/STokenewingtoncommon-ptf.jpg",
          "https://i2.wp.com/www.hangerlondon.com/wp-content/uploads/2018/09/Bolanrosenearhome-ptf-scaled.jpg?ssl=1",
          "https://i0.wp.com/www.hangerlondon.com/wp-content/uploads/2018/09/BolanBusroute73-ptf-scaled.jpg?ssl=1",
          "https://www.hangerlondon.com/wp-content/uploads/2020/06/bolans-london-300x168.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2019/09/Marc-Bolan-Shrine-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-TV-Show-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Premonitions-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Glam-Rock-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Premonitions-768x432.png",
          "https://www.renemagritte.org/images/paintings/sixteenth-of-september.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2020/06/bolans-london-300x168.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2019/09/Marc-Bolan-Shrine-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-TV-Show-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Premonitions-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Glam-Rock-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-TV-Show-768x432.png",
          "https://www.hangerlondon.com/wp-content/uploads/2020/06/bolans-london-300x168.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2019/09/Marc-Bolan-Shrine-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-TV-Show-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Premonitions-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Glam-Rock-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2019/09/Marc-Bolan-Shrine-768x432.png",
          "https://www.marc-bolan.net/members/0-gallery-marc-1977-2/images/1977%20pic%2076%20car%20crash.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2020/06/bolans-london-300x168.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2019/09/Marc-Bolan-Shrine-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-TV-Show-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Premonitions-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Glam-Rock-300x169.png",
          "https://m.media-amazon.com/images/I/51Y2e2eJoxL._SY445_SX342_.jpg",
          "https://images-eu.ssl-images-amazon.com/images/I/71IEatJT88L._AC_UL200_SR200,200_.jpg",
          "https://images-eu.ssl-images-amazon.com/images/I/714c4JbH1iS._AC_UL200_SR200,200_.jpg",
          "https://images-eu.ssl-images-amazon.com/images/I/91oXwsUYpJL._AC_UL200_SR200,200_.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2020/06/bolans-london-768x429.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2018/09/Bolanstokehome10-ptf.jpg",
          "//ws-eu.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=1786064480&Format=_SL250_&ID=AsinImage&MarketPlace=GB&ServiceVersion=20070822&WS=1&tag=hangerlondo02-21&language=en_GB",
          "https://ir-uk.amazon-adsystem.com/e/ir?t=hangerlondo02-21&language=en_GB&l=li3&o=2&a=1786064480",
          "//ws-eu.amazon-adsystem.com/widgets/q?_encoding=UTF8&MarketPlace=GB&ASIN=0750990910&ServiceVersion=20070822&ID=AsinImage&WS=1&Format=_SL250_&tag=hangerlondo02-21",
          "//ws-eu.amazon-adsystem.com/widgets/q?_encoding=UTF8&MarketPlace=GB&ASIN=0750937165&ServiceVersion=20070822&ID=AsinImage&WS=1&Format=_SL250_&tag=hangerlondo02-21",
          "https://www.hangerlondon.com/wp-content/uploads/2018/09/BolanSchoolNorthwold1-ptf-scaled-631x420.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2018/09/Bolanschoolnorthwold3-ptf-scaled-631x420.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2018/09/stokenewingtonCommon1-ptf-scaled-631x420.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2018/09/BolanSchoolNorthwold4-ptf-scaled-631x420.jpg",
          "//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B0863TL17Q&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=hangerlondonu-20&language=en_US",
          "https://ir-na.amazon-adsystem.com/e/ir?t=hangerlondonu-20&language=en_US&l=li3&o=1&a=B0863TL17Q",
          "//ws-eu.amazon-adsystem.com/widgets/q?_encoding=UTF8&MarketPlace=GB&ASIN=1444758799&ServiceVersion=20070822&ID=AsinImage&WS=1&Format=_SL250_&tag=hangerlondo02-21",
          "//ws-eu.amazon-adsystem.com/widgets/q?_encoding=UTF8&MarketPlace=GB&ASIN=B08F2DCPKD&ServiceVersion=20070822&ID=AsinImage&WS=1&Format=_SL250_&tag=hangerlondo02-21",
          "https://www.hangerlondon.com/wp-content/uploads/2018/09/STokenewingtoncommon-ptf.jpg",
          "https://i2.wp.com/www.hangerlondon.com/wp-content/uploads/2018/09/Bolanrosenearhome-ptf-scaled.jpg?ssl=1",
          "https://i0.wp.com/www.hangerlondon.com/wp-content/uploads/2018/09/BolanBusroute73-ptf-scaled.jpg?ssl=1",
          "https://www.hangerlondon.com/wp-content/uploads/2020/06/bolans-london-300x168.jpg",
          "https://www.hangerlondon.com/wp-content/uploads/2019/09/Marc-Bolan-Shrine-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-TV-Show-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Premonitions-300x169.png",
          "https://www.hangerlondon.com/wp-content/uploads/2021/12/Marc-Bolan-Glam-Rock-300x169.png"
        ]
      }
    }
  }
}