{
  "Marc Bolan": {
    "Stoke Newington": {
      "https://londonist.com/2011/10/marc-bolans-london-photographed-and-mapped": {
        "title": "Marc Bolan's London Photographed And Mapped",
        "text": "17 Oct 2011 — With his wife June, Marc moved into an attic flat at 57 Blenheim Crescent, just off Ladbroke Grove. It's over 25 years since his death so how ...",
        "google search terms": [
          "Stoke Newington",
          "T Rex",
          "Tyrannosaurus Rex",
          "Hackney",
          "Jewish"
        ],
        "image search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld",
          "Rolan",
          "Bolan",
          "Newington",
          "dyslexia",
          "Glam Rock",
          "Jewish",
          "songwriter"
        ],
        "page search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld"
        ],
        "page_text_snippets": [
          "Marc Bolan's London Photographed And Mapped | Londonist|Home|Food & Drink|Things To Do|Free & Cheap|Museums|Competitions|Pubs|Today|Weekend|This Week|Shop|Advertise|Subscribe|Browse Londonist|Search|Londonist|Food & Drink|Pubs|Things To Do|Beyond London|Twitter|Facebook|Instagram|Youtube|Youtube|Subscribe|More search options|Marc Bolan's London Photographed And Mapped|By|Londonist|Last edited 141 months ago|Londonist|Marc Bolan's London Photographed And Mapped|Bronze bust of Marc Bolan by sculptor Jean Robillard, at the site of his death on Queen's Ride / photo by Ian Mole|Site of the 2I Coffee Bar at 59 Old Compton Street / photo by Ian Mole|Berwick Street Market, where Bolan's mother used to work / photo by Ian Mole|57 Blenheim Crescent, Bolan's home between 1968-1971 / photo by Ian Mole|What used to be the Middle Earth club in King Street, Covent Garden / photo by Ian Mole|The Bolan Tree on Queen's Ride / photo by Ian Mole|Like his sparring partner David Bowie, Marc Bolan was a real London boy, starting from his birth at Hackney General Hospital on 30th September 1947, until his death in a car-crash on Barnes Common almost exactly 30 years later.|He came from a working class Jewish family and grew up at 25 Stoke Newington Common in Stamford Hill, attending William Wordsworth Secondary School. The teenage Mark Feld, to give him his original name, sometimes helped his mother with her job on a stall in Berwick Street Market in Soho. He also worked on the counter at the legendary 2I’s coffee bar at 59 Old Compton Street, which was the spiritual home of British rock n roll. The major home-grown talent – Tommy Steele, Cliff Richard and Adam Faith - had all played there but the precocious Mark failed to get a gig. Mind you, he was only in his early teens at the time.|He moved with his family to Sun Cottages, Summerstown in Wimbledon and attended Hillcroft School in Beechcroft Road, Tooting (now known as Ernest Bevin College). However, he was much more interested in making a career in music and he became friendly with a teenage star called Allen Warren, who was a presenter on a kids’ TV programme called ‘Five O’clock Club’. He moved into Allen’s flat at 81 Lexham Gardens in Kensington and soon they had produced a record entitled ‘You’re No Good’, which rapidly went nowhere."
        ],
        "image_links": [
          "https://assets.londonist.com/uploads/2011/10/i875/bolan1.jpg",
          "https://assets.londonist.com/uploads/2011/10/i875/bolan2.jpg",
          "https://assets.londonist.com/uploads/2011/10/i875/bolan3.jpg",
          "https://assets.londonist.com/uploads/2011/10/i875/bolan4.jpg",
          "https://assets.londonist.com/uploads/2011/10/i875/bolan5.jpg",
          "https://assets.londonist.com/uploads/2011/10/i875/bolan6.jpg",
          "https://assets.londonist.com/uploads/2011/10/i875/bolan_feature.jpg"
        ]
      }
    }
  }
}