{
  "Marc Bolan": {
    "T Rex": {
      "https://faroutmagazine.co.uk/marc-bolan-t-rex-10-greatest-songs-of-all-time/": {
        "title": "Marc Bolan and T. Rex's 10 greatest songs of all time",
        "text": "30 Sept 2020 — Marc Bolan is one of rock music's most tragic figure. Lost to the world far too young, the real sadness comes when you understand that just ...",
        "google search terms": [
          "Stoke Newington",
          "T Rex",
          "Tyrannosaurus Rex",
          "Hackney",
          "Jewish"
        ],
        "image search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld",
          "Rolan",
          "Bolan",
          "Newington",
          "dyslexia",
          "Glam Rock",
          "Jewish",
          "songwriter"
        ],
        "page search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld"
        ],
        "page_text_snippets": [
          "Marc Bolan and T. Rex's 10 greatest songs of all time|Music|Go Back|Music News|Features|Go Back|Interviews|Music Opinion|Ranking|Lists|New Music|Go Back|Album Reviews|From The Vault|Vinyl Corner|Film|Go Back|Film News|Cutting Room Floor|Features|Go Back|Classic Film|Interviews|Film Opinion|Lists|Ranking|New Reviews|TV / Series|Travel|Go Back|Travel News|Travel Features|Through The Lens|A Hotel To Call Home|Art|Go Back|Exhibitions|Photography|Playlists|Connect with us|Music|Music|Film|Film|Travel|Travel|Art|Art|Playlists|Playlists|Music|Film|Travel|Art|Playlists|(Credit: Gloria Stavers / Copyright Danny Fields)|Jack Whatley|September 30, 2020|Marc Bolan and T. Rex's 10 greatest songs of all time|Marc Bolan is one of rock music’s most tragic figure. Lost to the world far too young, the real sadness comes when you understand that just months before his untimely death Bolan had finally gotten himself back on track after years spent lost in a glittered kaleidoscope of ecstatic highs and tempestuous lows. Bolan had kicked his major vices and, after chatting with his friend David Bowie, was ready to get back to music.|For some years before his death, Bolan’s career had begun to wane. Brought up alongside Bowie as part of the influx of singer-songwriters that swelled the streets of London in the mid-to-late sixties. Born Mark Feld, the singer would soon convince the entire world that he was actually a glam rock god alongside his band T.Rex, only for the crown to slip once the glitter of glam rock began to fade. Soon enough, Bolan was drinking far too heavily and invariably finding his way to cocaine. However, before his death he rekindled his love affair with music, after all, it had been so incredibly fruitful for him.|Below, we’ve pulled together a list of Marc Bolan’s 10 greatest songs of all time, which, considering his comparatively short time with us, is a jam-packed list full of bonafide hits and pure and potent party starters. It’s fitting that an artist who had devoted himself so entirely to music should highlight exactly what makes music so important in the first place."
        ],
        "image_links": [
          "https://faroutmagazine.co.uk/static/uploads/1/2020/05/Marc-Bolan.jpg",
          "https://i.ytimg.com/vi/VcCQCYok3pg/hqdefault.jpg",
          "https://i.ytimg.com/vi/SlimsLXEkAc/hqdefault.jpg"
        ]
      }
    }
  }
}