{
  "Marc Bolan": {
    "Stoke Newington": {
      "https://summerstown182.wordpress.com/2021/01/18/marc-bolans-teenage-dream/": {
        "title": "Marc Bolan's Teenage Dream - Summerstown182",
        "text": "18 Jan 2021 — It's all a very long way from Carnaby Street and Stoke Newington, ... We are now planning a 'Marc Bolan Teenage Dream' tour.",
        "google search terms": [
          "Stoke Newington",
          "T Rex",
          "Tyrannosaurus Rex",
          "Hackney",
          "Jewish"
        ],
        "image search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld",
          "Rolan",
          "Bolan",
          "Newington",
          "dyslexia",
          "Glam Rock",
          "Jewish",
          "songwriter"
        ],
        "page search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld"
        ],
        "page_text_snippets": [
          "|.  By the time Mark arrived they were all still there, and are still here today! Some of the allotments have been converted to sewage treatment works and a strip of car showrooms, warehouses and light industry are dissected by an intimidating procession of electricity pylons. It",
          "|s all a very long way from Carnaby Street and Stoke Newington, but this is where the Feld family; Sid, Phyllis, Harry and Mark came to live in the early sixties.",
          "|Their prefab was on a road running alongside the famous Wimbledon Greyhound Stadium where dog racing and speedway were still attracting huge crowds. The local glamour boys at the time were the speedway stars who rode for the Wimbledon Dons. Its unlikely that the thirteen year old Marc was impressed. Their home might have been brand new, with fitted furniture and TV, but being rehoused on the other side of London away from all his friends would have been a huge shock. There’s a certain vibe around here that I feel must have helped kickstart his teenage dream – driving a van, flipping burgers or going to the dog track was definitely a world he needed to get away from. Having said that, the sport crowds might have meant good opportunities for busking, as was the proximity of a cluster of local pubs; The Prince of Wales, The White Lion, The Corner Pin and The Plough, all literally minutes from his front door. According to Mark Paytress, author of",
          "|after leaving school, the teenage dreamer spent a lot of time kicking-back on his own in that prefab – reading, listening to music and planning his escape route whilst the rest of the family were at work. Sid drove a delivery van for the nearby Airfix factory which made model aeroplane kits. Phyllis gave up her job on a fruit stall at Berwick Street market and now worked for the Post Office Savings Bank at Olympia. Brother Harry, with whom he now shared a bedroom had an office job in Wardour Street.|Over the last seven or eight years I’ve been promoting local history in this area. A great way of doing that is by putting up plaques which are paid for by donations from people who come on my regular guided walks. We called our project ‘Summerstown182’ because the first thing we did was research 182 names on a local First World War memorial. About 25 of them lived in the road into which the Felds moved; indeed many of their relatives were still around. A hugely popular topic on the walks has been Marc’s connection with the area. The prefabs are long gone but I alway liked to stop close to the site of his home to talk about him. The Felds new residence was a highly-desirable Scandinavian-designed ‘Sun Cottage’ prefab. Described in the blurb as|‘20 by 18 feet, containing a lounge, two bedrooms, kitchen, bathroom and all fixtures, fittings and furniture’|. Mark Paytress wrote that it was like|‘a luxury caravan with a pointed roof’|. Wandsworth Council put sixteen of them up on a site opposite the stadium in 1961. From the mid to late sixties Marc pulled away from the area as he got deeper into the music, drawn to the clubs and boutiques in the West End. It was still very much his family home though and ‘Wimbledon 0697’ was the prefab telephone number used by Marc in July 1967 in an advert in Melody Maker to recruit for his new band ‘Tyrannosaurus Rex’. It was also where payment was sent by the BBC the following year after an appearance on John Peel’s ‘Top Gear’ show.|The family connection would however continue for some years. An electoral roll from 1970 shows his parents, Simeon (Sid) and Phyllis still there, at No27 Summerstown, their younger son on the cusp of international fame. They moved a few miles up the road to live on the Ashburton estate in Putney where Sid worked as a caretaker. Marc later bought a property nearby at 142 Upper Richmond Road which was where he and Gloria were driving on the fateful night when he was killed, 16th September 1977.|I’ve met a number of people on my walks who remembered Mark Feld from his early Summerstown days. It was a long time ago, but one person recalled|‘my cousin practising with him at my Auntie’s house on Headworth Street’|. Someone did his Mum’s hair in the salon on Aboyne Road. Others spoke of a very well-dressed young man buying cakes in Carter’s bakery. He had a swagger and was often seen with a guitar slung over his shoulder. People reminisce about his brief time at Hillcroft School (now Ernest Bevin College) on local social media, where he appears to have been one of the first Mods. John Ford, who went on to form The Strawbs and have some big hits himself recalls being in the same leaving year there as Mark in 1963 and hanging out at his home in Summerstown.|Another old friend mentioned him being part of a teen band called ‘The Cabinet’. They practised in the youth club at Tranmere Road School (now Earlsfield Primary). Friday night there was ‘Record Night’ and there were regular Sunday morning sessions outside the prefab jamming old Elvis numbers. They performed at wedding receptions on Henry Prince Estate.|‘We got paid about a fiver and all the beer we could drink’.|Occasionally they went to a jazz club in the Surrey Tavern pub at the top of Burntwood Lane. Mark’s part-time jobs included washing dishes at the well-loved Wimpy burger bar and a brief stint at Edgar’s menswear shop near Tooting Broadway. Mark Paytress recounts a visit to the local labour exchange ended up with Mark filling in a form stating his profession as ‘a poet’. Quite a few people refer to his modelling and the fact he was always very well-turned out.|He had been featured in an article about the emerging Mod scene in ‘Town’ magazine and must have relished the fact that Tooting was full of tailors shops at the time. His friends recall Mark buying a pair of jodphurs from a riding and saddlery shop on Garratt Lane called Rawle & Son. Its very fondly recollected for having a life-size model of a horse in the window. The boots would have helped with the modelling which was his main source of income around the age of 15. Occasional work with some very well known clothing chains included John Temple and even an appearance in a Littlewoods catalogue. He is remembered as being generous with his clothing, often giving any spare gear to his friends.|Another local memory recalls Mark buying a guitar at ‘The Treasure Chest’- an ‘aladdin’s cave’ run by an eccentric Dutch wheeler-dealer known as ‘The Maniac’. Somewhere that might have been passed on the way to school, it set the pulses of local youths racing – as well as musical equipment, selling ‘air-guns, catapults and harpoons’. Its now a grocery store opposite the Tooting Islamic Centre.|He read avidly, Tolkien, Rimbaud, C.S. Lewis and the mystic poetry of Kahlil Gibran. Second hand bookshops were dotted around Tooting Broadway like the one beside the pie and mash shop on Selkirk Road.  When Andy Ellison visited the prefab to have a chat about Marc joining ‘John’s Children’ he recalled him reading a copy of ‘The Tin Drum’ by Gunter Grass. He also served up mushrooms on toast.|I’ve been talking about Marc quite a lot on my walks and would probably have tried organising a plaque for him some years ago were it not for a huge redevelopment in this neighbourhood. The old greyhound stadium site opposite where the Felds lived was demolished a few years ago, the site was flattened and is now being transformed into an enormous housing development cradling a new football stadium which has been up and running since November. It’s a fairytale return to the area for AFC Wimbledon who have been exiled for almost thirty years and though he might not have been much of a sports fan, Marc would surely have appreciated the romance. The pub buildings are all still hanging in there, though in different guises; a tile warehouse, a flooring shop and a supermarket. The Corner Pin is the last great survivor, still doing what it says on the tin and joined by a relatively new kid on the block, a very successful micro-brewery called By the Horns.|There is a photo on the ‘Palaces for the People’ Facebook group which is believed to be the Feld prefab. The location would appear to be about half way down the road called Summerstown and very close to the By the Horns brewery. There’s another very good aerial photo of these dwellings alongside the stadium on the cover of a Wimbledon speedway programme. Apparently the Feld homestead was in the middle of the front row. The Sun Cottages disappeared in the early seventies at about the same time as Marc was storming the pop charts. They’ve been replaced by a string of light industrial units which may not last much longer themselves. Its an odd collection; a carpet shop, a car repair unit and somewhere that makes sash windows, rubbing alongside the hipster brewery. Although all has changed quite drastically, I feel the spirit of Marc hangs over this area, never more vividly than on the night of 16 September 2017, the fortieth anniversary of Marc’s death. I had a word with the DJ who had his decks set up outside The Horns and as the pink sun sank over the old dog track, we raised a glass of Hopadelic to the sound of ‘Solid Gold, Easy Action’. I often think about him when I go past that bakery or the pubs that he busked outside. How much better it would be if there was a plaque with his name on it so that everybody could know about this!|One of those pubs I mentioned, The Prince of Wales is now a Tesco Express. It’s a very old building and will survive the changes all around it. Part of it extends seductively behind the main shopfront, beckoning people towards the stadium and the road called Summerstown where the Felds lived. Its overlooked by a terrace with a rather ornate balustrade, adding a nice touch of theatricals. It seems like a great place for a plaque and that’s where we would like to put it. But we need Tesco to agree so are waiting to hear from them. The above visual was created to show them what we would like to do and the words on it have not yet been finalised.|We would love any fans of Marc to come to Summerstown, to visit the area where he spent his early teenage years. The place where he morphed from Mark Feld to Marc Bolan and set out on his path to stardom. We are now planning a ‘Marc Bolan Teenage Dream’ tour. It will happen in mid-September around the time of Marc’s death when a lot of fans often come to London. We’ll meet at Tooting Broadway tube station and I’ll walk everybody round and introduce the to some key locations. There’s a lot of history here, Marc may not have played at the famous Tooting Granada venue, now a bingo hall, but he was around when The Beatles were there in 1963 and he saw The Rolling Stones there the following year.|At the dawn of the age when people were wearing flowers in their hair, I feel sure that Marc would have appreciated our connection with the daffodil. We’ll walk about a mile or so to Summerstown, passing the site of the old nurseries where Peter Barr ‘The Daffodil King’ cultivated the nation’s favourite flower. We celebrated him with a plaque recently and a campaign called ‘Blooming Tooting’ has encouraged people to plant bulbs. Even if we are still living under restrictions, there will be a self-guided walking tour available to download. That’s what I’ve been doing with all my local history walks, with people using them as their lockdown exercise breaks. You can find all the information here|https://summerstown182.wordpress.com|We may not be able to put up the plaque as planned due to the current pandemic but we would however like to give Marc Bolan fans the opportunity to contribute to making it happen. If lots of people chip in small amounts then we can all say we were part of it. As soon as we know we have permission, we will publicise the fact and set a Crowdfunder up and try to raise the £500 needed. If normal life has returned, we will try to create an event around the unveiling, as we have done in the past. Some speakers, a poetry recital, maybe even a bit of music up on that terrace. We will of course need a special person to do the unveiling. Who could that be? All suggestions are welcome! We would naturally be delighted if any of Marc’s family were able to be involved or attend.|I’m very grateful to a local musician called Jack Hardman who approached me a few months ago pointing out that Marc’s connection to the area is still largely unknown. We’ve decided now is the time to really do something. 2021 seems like an appropriate moment, half a century on from those first unforgettable T.Rex Number Ones, not to mention the significant ‘Electric Warrior’ anniversary and the disappearance of those Summerstown prefabs! The old ‘Prince of Wales’ pub is in a prominent place on a roundabout at the junction of the very busy Garratt Lane. A plaque would be seen by so many people, not least all the football fans going to the new stadium. As local residents, it will be a further reason for us to take pride in the area where we live and encourage future generations to have an awareness and appreciation of Marc’s music.|We intend to keep everyone notified about how this idea progresses but I wanted Marc’s fans all over the world to know that there is another special place, here in a little corner of south west London where his legacy lives on. Whether there is a plaque to look at or not, I really hope you will come to visit and perhaps participate in the proposed ‘Teenage Dream Tour’. In one of his best-known songs, Marc asked ‘Whatever Happened to the Teenage Dream?’ Let me tell you everybody, it is here in Summerstown and ‘Blooming Tooting’ and we can’t wait to share it with you. FLOWER TO THE PEOPLE!|Look out for ‘Marc Bolan’s Tooting Teenage Dream’ Summerstown182 Zoom Talk, happening 7pm, Thursday 25 March. Thanks to everyone on local social media sites whose members contributed their recollections; including ‘I Grew Up in Tooting’. ‘Tooting History Group’, ‘Earlsfield in the 70s/80s’. Mark Paytress’ book|‘Twentieth Century Boy – The Marc Bolan Story’|gives great insights into his time in Summerstown. The ‘Palaces For The People’ website has more about prefabs.|We particularly look forward to welcoming members of the Official Marc Bolan Fan Club to|‘|Blooming Tooting|’|!|Share this:|Twitter|Facebook|Like this:|Like|Loading...|Related|Bookmark the|permalink|.|Post navigation|←|Flower to the People|Toots Musical Roots|→|Leave a Reply|Cancel reply|Enter your comment here...|Fill in your details below or click an icon to log in:|Email|(required)|(Address never made public)|Name|(required)|Website|You are commenting using your WordPress.com account.|(|Log Out|/|Change|)|You are commenting using your Facebook account.|(|Log Out|/|Change|)|Cancel|Connecting to %s|Notify me of new comments via email.|Notify me of new posts via email.|Δ|Search|Recent Posts|476 Garratt Lane|Rollissons Tooting Nursery|The Corruganza Boxmakers|Totterdown Fields Forever|The People of Wardley Street|Follow us on Twitter|My Tweets|Archives|May 2023|March 2023|February 2023|April 2022|June 2021|January 2021|September 2020|July 2020|February 2020|December 2019|September 2019|August 2019|June 2019|March 2019|December 2018|July 2018|June 2018|May 2018|April 2018|March 2018|February 2018|January 2018|December 2017|November 2017|October 2017|September 2017|August 2017|July 2017|June 2017|May 2017|April 2017|March 2017|February 2017|January 2017|December 2016|November 2016|October 2016|September 2016|July 2016|June 2016|May 2016|April 2016|March 2016|February 2016|January 2016|December 2015|November 2015|October 2015|September 2015|August 2015|July 2015|June 2015|May 2015|April 2015|March 2015|February 2015|January 2015|December 2014|November 2014|October 2014|September 2014|August 2014|July 2014|June 2014|May 2014|April 2014|March 2014|February 2014|January 2014|December 2013|Categories|Uncategorized|Meta|Register|Log in|Entries feed|Comments feed|WordPress.com|Recent Comments|The Daffodil King of…|on|The Day of The Daffodil|Mr. C. Knight on|The Jewel in the Crown|Joe Caudle on|The Bootmaker’s Boy|Bill Harding|on|Lavender and Gunpowder|Jane on|The Daffodil King|Create a free website at WordPress.com.|Follow|Following|Summerstown182|Join 89 other followers|Sign me up|Already have a WordPress.com account?|Log in now.|Summerstown182|Customize|Follow|Following|Sign up|Log in|Copy shortlink|Report this content|View post in Reader|Manage subscriptions|Collapse this bar|Loading Comments...|Write a Comment...|Email (Required)|Name (Required)|Website|%d|bloggers like this:",
          "|.  By the time Mark arrived they were all still there, and are still here today! Some of the allotments have been converted to sewage treatment works and a strip of car showrooms, warehouses and light industry are dissected by an intimidating procession of electricity pylons. It",
          "|s all a very long way from Carnaby Street and Stoke Newington, but this is where the Feld family; Sid, Phyllis, Harry and Mark came to live in the early sixties.",
          "|Their prefab was on a road running alongside the famous Wimbledon Greyhound Stadium where dog racing and speedway were still attracting huge crowds. The local glamour boys at the time were the speedway stars who rode for the Wimbledon Dons. Its unlikely that the thirteen year old Marc was impressed. Their home might have been brand new, with fitted furniture and TV, but being rehoused on the other side of London away from all his friends would have been a huge shock. There’s a certain vibe around here that I feel must have helped kickstart his teenage dream – driving a van, flipping burgers or going to the dog track was definitely a world he needed to get away from. Having said that, the sport crowds might have meant good opportunities for busking, as was the proximity of a cluster of local pubs; The Prince of Wales, The White Lion, The Corner Pin and The Plough, all literally minutes from his front door. According to Mark Paytress, author of",
          "|after leaving school, the teenage dreamer spent a lot of time kicking-back on his own in that prefab – reading, listening to music and planning his escape route whilst the rest of the family were at work. Sid drove a delivery van for the nearby Airfix factory which made model aeroplane kits. Phyllis gave up her job on a fruit stall at Berwick Street market and now worked for the Post Office Savings Bank at Olympia. Brother Harry, with whom he now shared a bedroom had an office job in Wardour Street.|Over the last seven or eight years I’ve been promoting local history in this area. A great way of doing that is by putting up plaques which are paid for by donations from people who come on my regular guided walks. We called our project ‘Summerstown182’ because the first thing we did was research 182 names on a local First World War memorial. About 25 of them lived in the road into which the Felds moved; indeed many of their relatives were still around. A hugely popular topic on the walks has been Marc’s connection with the area. The prefabs are long gone but I alway liked to stop close to the site of his home to talk about him. The Felds new residence was a highly-desirable Scandinavian-designed ‘Sun Cottage’ prefab. Described in the blurb as|‘20 by 18 feet, containing a lounge, two bedrooms, kitchen, bathroom and all fixtures, fittings and furniture’|. Mark Paytress wrote that it was like|‘a luxury caravan with a pointed roof’|. Wandsworth Council put sixteen of them up on a site opposite the stadium in 1961. From the mid to late sixties Marc pulled away from the area as he got deeper into the music, drawn to the clubs and boutiques in the West End. It was still very much his family home though and ‘Wimbledon 0697’ was the prefab telephone number used by Marc in July 1967 in an advert in Melody Maker to recruit for his new band ‘Tyrannosaurus Rex’. It was also where payment was sent by the BBC the following year after an appearance on John Peel’s ‘Top Gear’ show.|The family connection would however continue for some years. An electoral roll from 1970 shows his parents, Simeon (Sid) and Phyllis still there, at No27 Summerstown, their younger son on the cusp of international fame. They moved a few miles up the road to live on the Ashburton estate in Putney where Sid worked as a caretaker. Marc later bought a property nearby at 142 Upper Richmond Road which was where he and Gloria were driving on the fateful night when he was killed, 16th September 1977.|I’ve met a number of people on my walks who remembered Mark Feld from his early Summerstown days. It was a long time ago, but one person recalled|‘my cousin practising with him at my Auntie’s house on Headworth Street’|. Someone did his Mum’s hair in the salon on Aboyne Road. Others spoke of a very well-dressed young man buying cakes in Carter’s bakery. He had a swagger and was often seen with a guitar slung over his shoulder. People reminisce about his brief time at Hillcroft School (now Ernest Bevin College) on local social media, where he appears to have been one of the first Mods. John Ford, who went on to form The Strawbs and have some big hits himself recalls being in the same leaving year there as Mark in 1963 and hanging out at his home in Summerstown.|Another old friend mentioned him being part of a teen band called ‘The Cabinet’. They practised in the youth club at Tranmere Road School (now Earlsfield Primary). Friday night there was ‘Record Night’ and there were regular Sunday morning sessions outside the prefab jamming old Elvis numbers. They performed at wedding receptions on Henry Prince Estate.|‘We got paid about a fiver and all the beer we could drink’.|Occasionally they went to a jazz club in the Surrey Tavern pub at the top of Burntwood Lane. Mark’s part-time jobs included washing dishes at the well-loved Wimpy burger bar and a brief stint at Edgar’s menswear shop near Tooting Broadway. Mark Paytress recounts a visit to the local labour exchange ended up with Mark filling in a form stating his profession as ‘a poet’. Quite a few people refer to his modelling and the fact he was always very well-turned out.|He had been featured in an article about the emerging Mod scene in ‘Town’ magazine and must have relished the fact that Tooting was full of tailors shops at the time. His friends recall Mark buying a pair of jodphurs from a riding and saddlery shop on Garratt Lane called Rawle & Son. Its very fondly recollected for having a life-size model of a horse in the window. The boots would have helped with the modelling which was his main source of income around the age of 15. Occasional work with some very well known clothing chains included John Temple and even an appearance in a Littlewoods catalogue. He is remembered as being generous with his clothing, often giving any spare gear to his friends.|Another local memory recalls Mark buying a guitar at ‘The Treasure Chest’- an ‘aladdin’s cave’ run by an eccentric Dutch wheeler-dealer known as ‘The Maniac’. Somewhere that might have been passed on the way to school, it set the pulses of local youths racing – as well as musical equipment, selling ‘air-guns, catapults and harpoons’. Its now a grocery store opposite the Tooting Islamic Centre.|He read avidly, Tolkien, Rimbaud, C.S. Lewis and the mystic poetry of Kahlil Gibran. Second hand bookshops were dotted around Tooting Broadway like the one beside the pie and mash shop on Selkirk Road.  When Andy Ellison visited the prefab to have a chat about Marc joining ‘John’s Children’ he recalled him reading a copy of ‘The Tin Drum’ by Gunter Grass. He also served up mushrooms on toast.|I’ve been talking about Marc quite a lot on my walks and would probably have tried organising a plaque for him some years ago were it not for a huge redevelopment in this neighbourhood. The old greyhound stadium site opposite where the Felds lived was demolished a few years ago, the site was flattened and is now being transformed into an enormous housing development cradling a new football stadium which has been up and running since November. It’s a fairytale return to the area for AFC Wimbledon who have been exiled for almost thirty years and though he might not have been much of a sports fan, Marc would surely have appreciated the romance. The pub buildings are all still hanging in there, though in different guises; a tile warehouse, a flooring shop and a supermarket. The Corner Pin is the last great survivor, still doing what it says on the tin and joined by a relatively new kid on the block, a very successful micro-brewery called By the Horns.|There is a photo on the ‘Palaces for the People’ Facebook group which is believed to be the Feld prefab. The location would appear to be about half way down the road called Summerstown and very close to the By the Horns brewery. There’s another very good aerial photo of these dwellings alongside the stadium on the cover of a Wimbledon speedway programme. Apparently the Feld homestead was in the middle of the front row. The Sun Cottages disappeared in the early seventies at about the same time as Marc was storming the pop charts. They’ve been replaced by a string of light industrial units which may not last much longer themselves. Its an odd collection; a carpet shop, a car repair unit and somewhere that makes sash windows, rubbing alongside the hipster brewery. Although all has changed quite drastically, I feel the spirit of Marc hangs over this area, never more vividly than on the night of 16 September 2017, the fortieth anniversary of Marc’s death. I had a word with the DJ who had his decks set up outside The Horns and as the pink sun sank over the old dog track, we raised a glass of Hopadelic to the sound of ‘Solid Gold, Easy Action’. I often think about him when I go past that bakery or the pubs that he busked outside. How much better it would be if there was a plaque with his name on it so that everybody could know about this!|One of those pubs I mentioned, The Prince of Wales is now a Tesco Express. It’s a very old building and will survive the changes all around it. Part of it extends seductively behind the main shopfront, beckoning people towards the stadium and the road called Summerstown where the Felds lived. Its overlooked by a terrace with a rather ornate balustrade, adding a nice touch of theatricals. It seems like a great place for a plaque and that’s where we would like to put it. But we need Tesco to agree so are waiting to hear from them. The above visual was created to show them what we would like to do and the words on it have not yet been finalised.|We would love any fans of Marc to come to Summerstown, to visit the area where he spent his early teenage years. The place where he morphed from Mark Feld to Marc Bolan and set out on his path to stardom. We are now planning a ‘Marc Bolan Teenage Dream’ tour. It will happen in mid-September around the time of Marc’s death when a lot of fans often come to London. We’ll meet at Tooting Broadway tube station and I’ll walk everybody round and introduce the to some key locations. There’s a lot of history here, Marc may not have played at the famous Tooting Granada venue, now a bingo hall, but he was around when The Beatles were there in 1963 and he saw The Rolling Stones there the following year.|At the dawn of the age when people were wearing flowers in their hair, I feel sure that Marc would have appreciated our connection with the daffodil. We’ll walk about a mile or so to Summerstown, passing the site of the old nurseries where Peter Barr ‘The Daffodil King’ cultivated the nation’s favourite flower. We celebrated him with a plaque recently and a campaign called ‘Blooming Tooting’ has encouraged people to plant bulbs. Even if we are still living under restrictions, there will be a self-guided walking tour available to download. That’s what I’ve been doing with all my local history walks, with people using them as their lockdown exercise breaks. You can find all the information here|https://summerstown182.wordpress.com|We may not be able to put up the plaque as planned due to the current pandemic but we would however like to give Marc Bolan fans the opportunity to contribute to making it happen. If lots of people chip in small amounts then we can all say we were part of it. As soon as we know we have permission, we will publicise the fact and set a Crowdfunder up and try to raise the £500 needed. If normal life has returned, we will try to create an event around the unveiling, as we have done in the past. Some speakers, a poetry recital, maybe even a bit of music up on that terrace. We will of course need a special person to do the unveiling. Who could that be? All suggestions are welcome! We would naturally be delighted if any of Marc’s family were able to be involved or attend.|I’m very grateful to a local musician called Jack Hardman who approached me a few months ago pointing out that Marc’s connection to the area is still largely unknown. We’ve decided now is the time to really do something. 2021 seems like an appropriate moment, half a century on from those first unforgettable T.Rex Number Ones, not to mention the significant ‘Electric Warrior’ anniversary and the disappearance of those Summerstown prefabs! The old ‘Prince of Wales’ pub is in a prominent place on a roundabout at the junction of the very busy Garratt Lane. A plaque would be seen by so many people, not least all the football fans going to the new stadium. As local residents, it will be a further reason for us to take pride in the area where we live and encourage future generations to have an awareness and appreciation of Marc’s music.|We intend to keep everyone notified about how this idea progresses but I wanted Marc’s fans all over the world to know that there is another special place, here in a little corner of south west London where his legacy lives on. Whether there is a plaque to look at or not, I really hope you will come to visit and perhaps participate in the proposed ‘Teenage Dream Tour’. In one of his best-known songs, Marc asked ‘Whatever Happened to the Teenage Dream?’ Let me tell you everybody, it is here in Summerstown and ‘Blooming Tooting’ and we can’t wait to share it with you. FLOWER TO THE PEOPLE!|Look out for ‘Marc Bolan’s Tooting Teenage Dream’ Summerstown182 Zoom Talk, happening 7pm, Thursday 25 March. Thanks to everyone on local social media sites whose members contributed their recollections; including ‘I Grew Up in Tooting’. ‘Tooting History Group’, ‘Earlsfield in the 70s/80s’. Mark Paytress’ book|‘Twentieth Century Boy – The Marc Bolan Story’|gives great insights into his time in Summerstown. The ‘Palaces For The People’ website has more about prefabs.|We particularly look forward to welcoming members of the Official Marc Bolan Fan Club to|‘|Blooming Tooting|’|!|Share this:|Twitter|Facebook|Like this:|Like|Loading...|Related|Bookmark the|permalink|.|Post navigation|←|Flower to the People|Toots Musical Roots|→|Leave a Reply|Cancel reply|Enter your comment here...|Fill in your details below or click an icon to log in:|Email|(required)|(Address never made public)|Name|(required)|Website|You are commenting using your WordPress.com account.|(|Log Out|/|Change|)|You are commenting using your Facebook account.|(|Log Out|/|Change|)|Cancel|Connecting to %s|Notify me of new comments via email.|Notify me of new posts via email.|Δ|Search|Recent Posts|476 Garratt Lane|Rollissons Tooting Nursery|The Corruganza Boxmakers|Totterdown Fields Forever|The People of Wardley Street|Follow us on Twitter|My Tweets|Archives|May 2023|March 2023|February 2023|April 2022|June 2021|January 2021|September 2020|July 2020|February 2020|December 2019|September 2019|August 2019|June 2019|March 2019|December 2018|July 2018|June 2018|May 2018|April 2018|March 2018|February 2018|January 2018|December 2017|November 2017|October 2017|September 2017|August 2017|July 2017|June 2017|May 2017|April 2017|March 2017|February 2017|January 2017|December 2016|November 2016|October 2016|September 2016|July 2016|June 2016|May 2016|April 2016|March 2016|February 2016|January 2016|December 2015|November 2015|October 2015|September 2015|August 2015|July 2015|June 2015|May 2015|April 2015|March 2015|February 2015|January 2015|December 2014|November 2014|October 2014|September 2014|August 2014|July 2014|June 2014|May 2014|April 2014|March 2014|February 2014|January 2014|December 2013|Categories|Uncategorized|Meta|Register|Log in|Entries feed|Comments feed|WordPress.com|Recent Comments|The Daffodil King of…|on|The Day of The Daffodil|Mr. C. Knight on|The Jewel in the Crown|Joe Caudle on|The Bootmaker’s Boy|Bill Harding|on|Lavender and Gunpowder|Jane on|The Daffodil King|Create a free website at WordPress.com.|Follow|Following|Summerstown182|Join 89 other followers|Sign me up|Already have a WordPress.com account?|Log in now.|Summerstown182|Customize|Follow|Following|Sign up|Log in|Copy shortlink|Report this content|View post in Reader|Manage subscriptions|Collapse this bar|Loading Comments...|Write a Comment...|Email (Required)|Name (Required)|Website|%d|bloggers like this:",
          "|.  By the time Mark arrived they were all still there, and are still here today! Some of the allotments have been converted to sewage treatment works and a strip of car showrooms, warehouses and light industry are dissected by an intimidating procession of electricity pylons. It",
          "|s all a very long way from Carnaby Street and Stoke Newington, but this is where the Feld family; Sid, Phyllis, Harry and Mark came to live in the early sixties.",
          "|Their prefab was on a road running alongside the famous Wimbledon Greyhound Stadium where dog racing and speedway were still attracting huge crowds. The local glamour boys at the time were the speedway stars who rode for the Wimbledon Dons. Its unlikely that the thirteen year old Marc was impressed. Their home might have been brand new, with fitted furniture and TV, but being rehoused on the other side of London away from all his friends would have been a huge shock. There’s a certain vibe around here that I feel must have helped kickstart his teenage dream – driving a van, flipping burgers or going to the dog track was definitely a world he needed to get away from. Having said that, the sport crowds might have meant good opportunities for busking, as was the proximity of a cluster of local pubs; The Prince of Wales, The White Lion, The Corner Pin and The Plough, all literally minutes from his front door. According to Mark Paytress, author of",
          "|after leaving school, the teenage dreamer spent a lot of time kicking-back on his own in that prefab – reading, listening to music and planning his escape route whilst the rest of the family were at work. Sid drove a delivery van for the nearby Airfix factory which made model aeroplane kits. Phyllis gave up her job on a fruit stall at Berwick Street market and now worked for the Post Office Savings Bank at Olympia. Brother Harry, with whom he now shared a bedroom had an office job in Wardour Street.|Over the last seven or eight years I’ve been promoting local history in this area. A great way of doing that is by putting up plaques which are paid for by donations from people who come on my regular guided walks. We called our project ‘Summerstown182’ because the first thing we did was research 182 names on a local First World War memorial. About 25 of them lived in the road into which the Felds moved; indeed many of their relatives were still around. A hugely popular topic on the walks has been Marc’s connection with the area. The prefabs are long gone but I alway liked to stop close to the site of his home to talk about him. The Felds new residence was a highly-desirable Scandinavian-designed ‘Sun Cottage’ prefab. Described in the blurb as|‘20 by 18 feet, containing a lounge, two bedrooms, kitchen, bathroom and all fixtures, fittings and furniture’|. Mark Paytress wrote that it was like|‘a luxury caravan with a pointed roof’|. Wandsworth Council put sixteen of them up on a site opposite the stadium in 1961. From the mid to late sixties Marc pulled away from the area as he got deeper into the music, drawn to the clubs and boutiques in the West End. It was still very much his family home though and ‘Wimbledon 0697’ was the prefab telephone number used by Marc in July 1967 in an advert in Melody Maker to recruit for his new band ‘Tyrannosaurus Rex’. It was also where payment was sent by the BBC the following year after an appearance on John Peel’s ‘Top Gear’ show.|The family connection would however continue for some years. An electoral roll from 1970 shows his parents, Simeon (Sid) and Phyllis still there, at No27 Summerstown, their younger son on the cusp of international fame. They moved a few miles up the road to live on the Ashburton estate in Putney where Sid worked as a caretaker. Marc later bought a property nearby at 142 Upper Richmond Road which was where he and Gloria were driving on the fateful night when he was killed, 16th September 1977.|I’ve met a number of people on my walks who remembered Mark Feld from his early Summerstown days. It was a long time ago, but one person recalled|‘my cousin practising with him at my Auntie’s house on Headworth Street’|. Someone did his Mum’s hair in the salon on Aboyne Road. Others spoke of a very well-dressed young man buying cakes in Carter’s bakery. He had a swagger and was often seen with a guitar slung over his shoulder. People reminisce about his brief time at Hillcroft School (now Ernest Bevin College) on local social media, where he appears to have been one of the first Mods. John Ford, who went on to form The Strawbs and have some big hits himself recalls being in the same leaving year there as Mark in 1963 and hanging out at his home in Summerstown.|Another old friend mentioned him being part of a teen band called ‘The Cabinet’. They practised in the youth club at Tranmere Road School (now Earlsfield Primary). Friday night there was ‘Record Night’ and there were regular Sunday morning sessions outside the prefab jamming old Elvis numbers. They performed at wedding receptions on Henry Prince Estate.|‘We got paid about a fiver and all the beer we could drink’.|Occasionally they went to a jazz club in the Surrey Tavern pub at the top of Burntwood Lane. Mark’s part-time jobs included washing dishes at the well-loved Wimpy burger bar and a brief stint at Edgar’s menswear shop near Tooting Broadway. Mark Paytress recounts a visit to the local labour exchange ended up with Mark filling in a form stating his profession as ‘a poet’. Quite a few people refer to his modelling and the fact he was always very well-turned out.|He had been featured in an article about the emerging Mod scene in ‘Town’ magazine and must have relished the fact that Tooting was full of tailors shops at the time. His friends recall Mark buying a pair of jodphurs from a riding and saddlery shop on Garratt Lane called Rawle & Son. Its very fondly recollected for having a life-size model of a horse in the window. The boots would have helped with the modelling which was his main source of income around the age of 15. Occasional work with some very well known clothing chains included John Temple and even an appearance in a Littlewoods catalogue. He is remembered as being generous with his clothing, often giving any spare gear to his friends.|Another local memory recalls Mark buying a guitar at ‘The Treasure Chest’- an ‘aladdin’s cave’ run by an eccentric Dutch wheeler-dealer known as ‘The Maniac’. Somewhere that might have been passed on the way to school, it set the pulses of local youths racing – as well as musical equipment, selling ‘air-guns, catapults and harpoons’. Its now a grocery store opposite the Tooting Islamic Centre.|He read avidly, Tolkien, Rimbaud, C.S. Lewis and the mystic poetry of Kahlil Gibran. Second hand bookshops were dotted around Tooting Broadway like the one beside the pie and mash shop on Selkirk Road.  When Andy Ellison visited the prefab to have a chat about Marc joining ‘John’s Children’ he recalled him reading a copy of ‘The Tin Drum’ by Gunter Grass. He also served up mushrooms on toast.|I’ve been talking about Marc quite a lot on my walks and would probably have tried organising a plaque for him some years ago were it not for a huge redevelopment in this neighbourhood. The old greyhound stadium site opposite where the Felds lived was demolished a few years ago, the site was flattened and is now being transformed into an enormous housing development cradling a new football stadium which has been up and running since November. It’s a fairytale return to the area for AFC Wimbledon who have been exiled for almost thirty years and though he might not have been much of a sports fan, Marc would surely have appreciated the romance. The pub buildings are all still hanging in there, though in different guises; a tile warehouse, a flooring shop and a supermarket. The Corner Pin is the last great survivor, still doing what it says on the tin and joined by a relatively new kid on the block, a very successful micro-brewery called By the Horns.|There is a photo on the ‘Palaces for the People’ Facebook group which is believed to be the Feld prefab. The location would appear to be about half way down the road called Summerstown and very close to the By the Horns brewery. There’s another very good aerial photo of these dwellings alongside the stadium on the cover of a Wimbledon speedway programme. Apparently the Feld homestead was in the middle of the front row. The Sun Cottages disappeared in the early seventies at about the same time as Marc was storming the pop charts. They’ve been replaced by a string of light industrial units which may not last much longer themselves. Its an odd collection; a carpet shop, a car repair unit and somewhere that makes sash windows, rubbing alongside the hipster brewery. Although all has changed quite drastically, I feel the spirit of Marc hangs over this area, never more vividly than on the night of 16 September 2017, the fortieth anniversary of Marc’s death. I had a word with the DJ who had his decks set up outside The Horns and as the pink sun sank over the old dog track, we raised a glass of Hopadelic to the sound of ‘Solid Gold, Easy Action’. I often think about him when I go past that bakery or the pubs that he busked outside. How much better it would be if there was a plaque with his name on it so that everybody could know about this!|One of those pubs I mentioned, The Prince of Wales is now a Tesco Express. It’s a very old building and will survive the changes all around it. Part of it extends seductively behind the main shopfront, beckoning people towards the stadium and the road called Summerstown where the Felds lived. Its overlooked by a terrace with a rather ornate balustrade, adding a nice touch of theatricals. It seems like a great place for a plaque and that’s where we would like to put it. But we need Tesco to agree so are waiting to hear from them. The above visual was created to show them what we would like to do and the words on it have not yet been finalised.|We would love any fans of Marc to come to Summerstown, to visit the area where he spent his early teenage years. The place where he morphed from Mark Feld to Marc Bolan and set out on his path to stardom. We are now planning a ‘Marc Bolan Teenage Dream’ tour. It will happen in mid-September around the time of Marc’s death when a lot of fans often come to London. We’ll meet at Tooting Broadway tube station and I’ll walk everybody round and introduce the to some key locations. There’s a lot of history here, Marc may not have played at the famous Tooting Granada venue, now a bingo hall, but he was around when The Beatles were there in 1963 and he saw The Rolling Stones there the following year.|At the dawn of the age when people were wearing flowers in their hair, I feel sure that Marc would have appreciated our connection with the daffodil. We’ll walk about a mile or so to Summerstown, passing the site of the old nurseries where Peter Barr ‘The Daffodil King’ cultivated the nation’s favourite flower. We celebrated him with a plaque recently and a campaign called ‘Blooming Tooting’ has encouraged people to plant bulbs. Even if we are still living under restrictions, there will be a self-guided walking tour available to download. That’s what I’ve been doing with all my local history walks, with people using them as their lockdown exercise breaks. You can find all the information here|https://summerstown182.wordpress.com|We may not be able to put up the plaque as planned due to the current pandemic but we would however like to give Marc Bolan fans the opportunity to contribute to making it happen. If lots of people chip in small amounts then we can all say we were part of it. As soon as we know we have permission, we will publicise the fact and set a Crowdfunder up and try to raise the £500 needed. If normal life has returned, we will try to create an event around the unveiling, as we have done in the past. Some speakers, a poetry recital, maybe even a bit of music up on that terrace. We will of course need a special person to do the unveiling. Who could that be? All suggestions are welcome! We would naturally be delighted if any of Marc’s family were able to be involved or attend.|I’m very grateful to a local musician called Jack Hardman who approached me a few months ago pointing out that Marc’s connection to the area is still largely unknown. We’ve decided now is the time to really do something. 2021 seems like an appropriate moment, half a century on from those first unforgettable T.Rex Number Ones, not to mention the significant ‘Electric Warrior’ anniversary and the disappearance of those Summerstown prefabs! The old ‘Prince of Wales’ pub is in a prominent place on a roundabout at the junction of the very busy Garratt Lane. A plaque would be seen by so many people, not least all the football fans going to the new stadium. As local residents, it will be a further reason for us to take pride in the area where we live and encourage future generations to have an awareness and appreciation of Marc’s music.|We intend to keep everyone notified about how this idea progresses but I wanted Marc’s fans all over the world to know that there is another special place, here in a little corner of south west London where his legacy lives on. Whether there is a plaque to look at or not, I really hope you will come to visit and perhaps participate in the proposed ‘Teenage Dream Tour’. In one of his best-known songs, Marc asked ‘Whatever Happened to the Teenage Dream?’ Let me tell you everybody, it is here in Summerstown and ‘Blooming Tooting’ and we can’t wait to share it with you. FLOWER TO THE PEOPLE!|Look out for ‘Marc Bolan’s Tooting Teenage Dream’ Summerstown182 Zoom Talk, happening 7pm, Thursday 25 March. Thanks to everyone on local social media sites whose members contributed their recollections; including ‘I Grew Up in Tooting’. ‘Tooting History Group’, ‘Earlsfield in the 70s/80s’. Mark Paytress’ book|‘Twentieth Century Boy – The Marc Bolan Story’|gives great insights into his time in Summerstown. The ‘Palaces For The People’ website has more about prefabs.|We particularly look forward to welcoming members of the Official Marc Bolan Fan Club to|‘|Blooming Tooting|’|!|Share this:|Twitter|Facebook|Like this:|Like|Loading...|Related|Bookmark the|permalink|.|Post navigation|←|Flower to the People|Toots Musical Roots|→|Leave a Reply|Cancel reply|Enter your comment here...|Fill in your details below or click an icon to log in:|Email|(required)|(Address never made public)|Name|(required)|Website|You are commenting using your WordPress.com account.|(|Log Out|/|Change|)|You are commenting using your Facebook account.|(|Log Out|/|Change|)|Cancel|Connecting to %s|Notify me of new comments via email.|Notify me of new posts via email.|Δ|Search|Recent Posts|476 Garratt Lane|Rollissons Tooting Nursery|The Corruganza Boxmakers|Totterdown Fields Forever|The People of Wardley Street|Follow us on Twitter|My Tweets|Archives|May 2023|March 2023|February 2023|April 2022|June 2021|January 2021|September 2020|July 2020|February 2020|December 2019|September 2019|August 2019|June 2019|March 2019|December 2018|July 2018|June 2018|May 2018|April 2018|March 2018|February 2018|January 2018|December 2017|November 2017|October 2017|September 2017|August 2017|July 2017|June 2017|May 2017|April 2017|March 2017|February 2017|January 2017|December 2016|November 2016|October 2016|September 2016|July 2016|June 2016|May 2016|April 2016|March 2016|February 2016|January 2016|December 2015|November 2015|October 2015|September 2015|August 2015|July 2015|June 2015|May 2015|April 2015|March 2015|February 2015|January 2015|December 2014|November 2014|October 2014|September 2014|August 2014|July 2014|June 2014|May 2014|April 2014|March 2014|February 2014|January 2014|December 2013|Categories|Uncategorized|Meta|Register|Log in|Entries feed|Comments feed|WordPress.com|Recent Comments|The Daffodil King of…|on|The Day of The Daffodil|Mr. C. Knight on|The Jewel in the Crown|Joe Caudle on|The Bootmaker’s Boy|Bill Harding|on|Lavender and Gunpowder|Jane on|The Daffodil King|Create a free website at WordPress.com.|Follow|Following|Summerstown182|Join 89 other followers|Sign me up|Already have a WordPress.com account?|Log in now.|Summerstown182|Customize|Follow|Following|Sign up|Log in|Copy shortlink|Report this content|View post in Reader|Manage subscriptions|Collapse this bar|Loading Comments...|Write a Comment...|Email (Required)|Name (Required)|Website|%d|bloggers like this:",
          "|.  By the time Mark arrived they were all still there, and are still here today! Some of the allotments have been converted to sewage treatment works and a strip of car showrooms, warehouses and light industry are dissected by an intimidating procession of electricity pylons. It",
          "|s all a very long way from Carnaby Street and Stoke Newington, but this is where the Feld family; Sid, Phyllis, Harry and Mark came to live in the early sixties.",
          "|Their prefab was on a road running alongside the famous Wimbledon Greyhound Stadium where dog racing and speedway were still attracting huge crowds. The local glamour boys at the time were the speedway stars who rode for the Wimbledon Dons. Its unlikely that the thirteen year old Marc was impressed. Their home might have been brand new, with fitted furniture and TV, but being rehoused on the other side of London away from all his friends would have been a huge shock. There’s a certain vibe around here that I feel must have helped kickstart his teenage dream – driving a van, flipping burgers or going to the dog track was definitely a world he needed to get away from. Having said that, the sport crowds might have meant good opportunities for busking, as was the proximity of a cluster of local pubs; The Prince of Wales, The White Lion, The Corner Pin and The Plough, all literally minutes from his front door. According to Mark Paytress, author of",
          "|after leaving school, the teenage dreamer spent a lot of time kicking-back on his own in that prefab – reading, listening to music and planning his escape route whilst the rest of the family were at work. Sid drove a delivery van for the nearby Airfix factory which made model aeroplane kits. Phyllis gave up her job on a fruit stall at Berwick Street market and now worked for the Post Office Savings Bank at Olympia. Brother Harry, with whom he now shared a bedroom had an office job in Wardour Street.|Over the last seven or eight years I’ve been promoting local history in this area. A great way of doing that is by putting up plaques which are paid for by donations from people who come on my regular guided walks. We called our project ‘Summerstown182’ because the first thing we did was research 182 names on a local First World War memorial. About 25 of them lived in the road into which the Felds moved; indeed many of their relatives were still around. A hugely popular topic on the walks has been Marc’s connection with the area. The prefabs are long gone but I alway liked to stop close to the site of his home to talk about him. The Felds new residence was a highly-desirable Scandinavian-designed ‘Sun Cottage’ prefab. Described in the blurb as|‘20 by 18 feet, containing a lounge, two bedrooms, kitchen, bathroom and all fixtures, fittings and furniture’|. Mark Paytress wrote that it was like|‘a luxury caravan with a pointed roof’|. Wandsworth Council put sixteen of them up on a site opposite the stadium in 1961. From the mid to late sixties Marc pulled away from the area as he got deeper into the music, drawn to the clubs and boutiques in the West End. It was still very much his family home though and ‘Wimbledon 0697’ was the prefab telephone number used by Marc in July 1967 in an advert in Melody Maker to recruit for his new band ‘Tyrannosaurus Rex’. It was also where payment was sent by the BBC the following year after an appearance on John Peel’s ‘Top Gear’ show.|The family connection would however continue for some years. An electoral roll from 1970 shows his parents, Simeon (Sid) and Phyllis still there, at No27 Summerstown, their younger son on the cusp of international fame. They moved a few miles up the road to live on the Ashburton estate in Putney where Sid worked as a caretaker. Marc later bought a property nearby at 142 Upper Richmond Road which was where he and Gloria were driving on the fateful night when he was killed, 16th September 1977.|I’ve met a number of people on my walks who remembered Mark Feld from his early Summerstown days. It was a long time ago, but one person recalled|‘my cousin practising with him at my Auntie’s house on Headworth Street’|. Someone did his Mum’s hair in the salon on Aboyne Road. Others spoke of a very well-dressed young man buying cakes in Carter’s bakery. He had a swagger and was often seen with a guitar slung over his shoulder. People reminisce about his brief time at Hillcroft School (now Ernest Bevin College) on local social media, where he appears to have been one of the first Mods. John Ford, who went on to form The Strawbs and have some big hits himself recalls being in the same leaving year there as Mark in 1963 and hanging out at his home in Summerstown.|Another old friend mentioned him being part of a teen band called ‘The Cabinet’. They practised in the youth club at Tranmere Road School (now Earlsfield Primary). Friday night there was ‘Record Night’ and there were regular Sunday morning sessions outside the prefab jamming old Elvis numbers. They performed at wedding receptions on Henry Prince Estate.|‘We got paid about a fiver and all the beer we could drink’.|Occasionally they went to a jazz club in the Surrey Tavern pub at the top of Burntwood Lane. Mark’s part-time jobs included washing dishes at the well-loved Wimpy burger bar and a brief stint at Edgar’s menswear shop near Tooting Broadway. Mark Paytress recounts a visit to the local labour exchange ended up with Mark filling in a form stating his profession as ‘a poet’. Quite a few people refer to his modelling and the fact he was always very well-turned out.|He had been featured in an article about the emerging Mod scene in ‘Town’ magazine and must have relished the fact that Tooting was full of tailors shops at the time. His friends recall Mark buying a pair of jodphurs from a riding and saddlery shop on Garratt Lane called Rawle & Son. Its very fondly recollected for having a life-size model of a horse in the window. The boots would have helped with the modelling which was his main source of income around the age of 15. Occasional work with some very well known clothing chains included John Temple and even an appearance in a Littlewoods catalogue. He is remembered as being generous with his clothing, often giving any spare gear to his friends.|Another local memory recalls Mark buying a guitar at ‘The Treasure Chest’- an ‘aladdin’s cave’ run by an eccentric Dutch wheeler-dealer known as ‘The Maniac’. Somewhere that might have been passed on the way to school, it set the pulses of local youths racing – as well as musical equipment, selling ‘air-guns, catapults and harpoons’. Its now a grocery store opposite the Tooting Islamic Centre.|He read avidly, Tolkien, Rimbaud, C.S. Lewis and the mystic poetry of Kahlil Gibran. Second hand bookshops were dotted around Tooting Broadway like the one beside the pie and mash shop on Selkirk Road.  When Andy Ellison visited the prefab to have a chat about Marc joining ‘John’s Children’ he recalled him reading a copy of ‘The Tin Drum’ by Gunter Grass. He also served up mushrooms on toast.|I’ve been talking about Marc quite a lot on my walks and would probably have tried organising a plaque for him some years ago were it not for a huge redevelopment in this neighbourhood. The old greyhound stadium site opposite where the Felds lived was demolished a few years ago, the site was flattened and is now being transformed into an enormous housing development cradling a new football stadium which has been up and running since November. It’s a fairytale return to the area for AFC Wimbledon who have been exiled for almost thirty years and though he might not have been much of a sports fan, Marc would surely have appreciated the romance. The pub buildings are all still hanging in there, though in different guises; a tile warehouse, a flooring shop and a supermarket. The Corner Pin is the last great survivor, still doing what it says on the tin and joined by a relatively new kid on the block, a very successful micro-brewery called By the Horns.|There is a photo on the ‘Palaces for the People’ Facebook group which is believed to be the Feld prefab. The location would appear to be about half way down the road called Summerstown and very close to the By the Horns brewery. There’s another very good aerial photo of these dwellings alongside the stadium on the cover of a Wimbledon speedway programme. Apparently the Feld homestead was in the middle of the front row. The Sun Cottages disappeared in the early seventies at about the same time as Marc was storming the pop charts. They’ve been replaced by a string of light industrial units which may not last much longer themselves. Its an odd collection; a carpet shop, a car repair unit and somewhere that makes sash windows, rubbing alongside the hipster brewery. Although all has changed quite drastically, I feel the spirit of Marc hangs over this area, never more vividly than on the night of 16 September 2017, the fortieth anniversary of Marc’s death. I had a word with the DJ who had his decks set up outside The Horns and as the pink sun sank over the old dog track, we raised a glass of Hopadelic to the sound of ‘Solid Gold, Easy Action’. I often think about him when I go past that bakery or the pubs that he busked outside. How much better it would be if there was a plaque with his name on it so that everybody could know about this!|One of those pubs I mentioned, The Prince of Wales is now a Tesco Express. It’s a very old building and will survive the changes all around it. Part of it extends seductively behind the main shopfront, beckoning people towards the stadium and the road called Summerstown where the Felds lived. Its overlooked by a terrace with a rather ornate balustrade, adding a nice touch of theatricals. It seems like a great place for a plaque and that’s where we would like to put it. But we need Tesco to agree so are waiting to hear from them. The above visual was created to show them what we would like to do and the words on it have not yet been finalised.|We would love any fans of Marc to come to Summerstown, to visit the area where he spent his early teenage years. The place where he morphed from Mark Feld to Marc Bolan and set out on his path to stardom. We are now planning a ‘Marc Bolan Teenage Dream’ tour. It will happen in mid-September around the time of Marc’s death when a lot of fans often come to London. We’ll meet at Tooting Broadway tube station and I’ll walk everybody round and introduce the to some key locations. There’s a lot of history here, Marc may not have played at the famous Tooting Granada venue, now a bingo hall, but he was around when The Beatles were there in 1963 and he saw The Rolling Stones there the following year.|At the dawn of the age when people were wearing flowers in their hair, I feel sure that Marc would have appreciated our connection with the daffodil. We’ll walk about a mile or so to Summerstown, passing the site of the old nurseries where Peter Barr ‘The Daffodil King’ cultivated the nation’s favourite flower. We celebrated him with a plaque recently and a campaign called ‘Blooming Tooting’ has encouraged people to plant bulbs. Even if we are still living under restrictions, there will be a self-guided walking tour available to download. That’s what I’ve been doing with all my local history walks, with people using them as their lockdown exercise breaks. You can find all the information here|https://summerstown182.wordpress.com|We may not be able to put up the plaque as planned due to the current pandemic but we would however like to give Marc Bolan fans the opportunity to contribute to making it happen. If lots of people chip in small amounts then we can all say we were part of it. As soon as we know we have permission, we will publicise the fact and set a Crowdfunder up and try to raise the £500 needed. If normal life has returned, we will try to create an event around the unveiling, as we have done in the past. Some speakers, a poetry recital, maybe even a bit of music up on that terrace. We will of course need a special person to do the unveiling. Who could that be? All suggestions are welcome! We would naturally be delighted if any of Marc’s family were able to be involved or attend.|I’m very grateful to a local musician called Jack Hardman who approached me a few months ago pointing out that Marc’s connection to the area is still largely unknown. We’ve decided now is the time to really do something. 2021 seems like an appropriate moment, half a century on from those first unforgettable T.Rex Number Ones, not to mention the significant ‘Electric Warrior’ anniversary and the disappearance of those Summerstown prefabs! The old ‘Prince of Wales’ pub is in a prominent place on a roundabout at the junction of the very busy Garratt Lane. A plaque would be seen by so many people, not least all the football fans going to the new stadium. As local residents, it will be a further reason for us to take pride in the area where we live and encourage future generations to have an awareness and appreciation of Marc’s music.|We intend to keep everyone notified about how this idea progresses but I wanted Marc’s fans all over the world to know that there is another special place, here in a little corner of south west London where his legacy lives on. Whether there is a plaque to look at or not, I really hope you will come to visit and perhaps participate in the proposed ‘Teenage Dream Tour’. In one of his best-known songs, Marc asked ‘Whatever Happened to the Teenage Dream?’ Let me tell you everybody, it is here in Summerstown and ‘Blooming Tooting’ and we can’t wait to share it with you. FLOWER TO THE PEOPLE!|Look out for ‘Marc Bolan’s Tooting Teenage Dream’ Summerstown182 Zoom Talk, happening 7pm, Thursday 25 March. Thanks to everyone on local social media sites whose members contributed their recollections; including ‘I Grew Up in Tooting’. ‘Tooting History Group’, ‘Earlsfield in the 70s/80s’. Mark Paytress’ book|‘Twentieth Century Boy – The Marc Bolan Story’|gives great insights into his time in Summerstown. The ‘Palaces For The People’ website has more about prefabs.|We particularly look forward to welcoming members of the Official Marc Bolan Fan Club to|‘|Blooming Tooting|’|!|Share this:|Twitter|Facebook|Like this:|Like|Loading...|Related|Bookmark the|permalink|.|Post navigation|←|Flower to the People|Toots Musical Roots|→|Leave a Reply|Cancel reply|Enter your comment here...|Fill in your details below or click an icon to log in:|Email|(required)|(Address never made public)|Name|(required)|Website|You are commenting using your WordPress.com account.|(|Log Out|/|Change|)|You are commenting using your Facebook account.|(|Log Out|/|Change|)|Cancel|Connecting to %s|Notify me of new comments via email.|Notify me of new posts via email.|Δ|Search|Recent Posts|476 Garratt Lane|Rollissons Tooting Nursery|The Corruganza Boxmakers|Totterdown Fields Forever|The People of Wardley Street|Follow us on Twitter|My Tweets|Archives|May 2023|March 2023|February 2023|April 2022|June 2021|January 2021|September 2020|July 2020|February 2020|December 2019|September 2019|August 2019|June 2019|March 2019|December 2018|July 2018|June 2018|May 2018|April 2018|March 2018|February 2018|January 2018|December 2017|November 2017|October 2017|September 2017|August 2017|July 2017|June 2017|May 2017|April 2017|March 2017|February 2017|January 2017|December 2016|November 2016|October 2016|September 2016|July 2016|June 2016|May 2016|April 2016|March 2016|February 2016|January 2016|December 2015|November 2015|October 2015|September 2015|August 2015|July 2015|June 2015|May 2015|April 2015|March 2015|February 2015|January 2015|December 2014|November 2014|October 2014|September 2014|August 2014|July 2014|June 2014|May 2014|April 2014|March 2014|February 2014|January 2014|December 2013|Categories|Uncategorized|Meta|Register|Log in|Entries feed|Comments feed|WordPress.com|Recent Comments|The Daffodil King of…|on|The Day of The Daffodil|Mr. C. Knight on|The Jewel in the Crown|Joe Caudle on|The Bootmaker’s Boy|Bill Harding|on|Lavender and Gunpowder|Jane on|The Daffodil King|Create a free website at WordPress.com.|Follow|Following|Summerstown182|Join 89 other followers|Sign me up|Already have a WordPress.com account?|Log in now.|Summerstown182|Customize|Follow|Following|Sign up|Log in|Copy shortlink|Report this content|View post in Reader|Manage subscriptions|Collapse this bar|Loading Comments...|Write a Comment...|Email (Required)|Name (Required)|Website|%d|bloggers like this:",
          "Abuse — WordPress.com|WordPress.com|Menu|Features|Themes|Plans|Blog|Support|Sign Up|Log In|Report Content on WordPress.com|We strongly believe in freedom of speech. The WordPress.com community is spread across many cultures, countries, and backgrounds with varying values, and our service is designed to let people publish ideas and opinions without us censoring or endorsing them. But if you find a site on WordPress.com that you feel violates our|User Guidelines|or|Terms of Service|, please let us know.|I would like to report…|“https://summerstown182.wordpress.com/2021/01/18/marc-bolans-teenage-dream/”|Abuse|Abusive content, harassment, and defamation.|Privacy|Concerns about my private information.|Person at Risk|A person at imminent risk of death or severe physical harm.|Regulated Material|The sale of prohibited or highly regulated items. Gambling and explicit material.|Technological Harm|Malware, spyware, adware etc. Phishing. Spam or machine-generated content.|Legal|Copyright and Trademark infringement.|Get Started|Create your own website|Products|WordPress Hosting|Domain Names|Website Builder|Create a Blog|Professional Email|P2: WordPress for Teams|Enterprise Solutions|Website Design Services|Features|Overview|WordPress Themes|WordPress Plugins|Google Apps|Resources|WordPress.com Support|WordPress Forums|WordPress News|Website Building Tips|Business Name Generator|Logo Maker|Popular Topics|Daily Webinars|Learn WordPress|Developer Resources|Company|About|Partners|Press|Terms of Service|Privacy Policy|Do Not Sell or Share My Personal Information|Privacy Notice for California Users|An|Automattic|Creation",
          "|.  By the time Mark arrived they were all still there, and are still here today! Some of the allotments have been converted to sewage treatment works and a strip of car showrooms, warehouses and light industry are dissected by an intimidating procession of electricity pylons. It",
          "|s all a very long way from Carnaby Street and Stoke Newington, but this is where the Feld family; Sid, Phyllis, Harry and Mark came to live in the early sixties.",
          "|Their prefab was on a road running alongside the famous Wimbledon Greyhound Stadium where dog racing and speedway were still attracting huge crowds. The local glamour boys at the time were the speedway stars who rode for the Wimbledon Dons. Its unlikely that the thirteen year old Marc was impressed. Their home might have been brand new, with fitted furniture and TV, but being rehoused on the other side of London away from all his friends would have been a huge shock. There’s a certain vibe around here that I feel must have helped kickstart his teenage dream – driving a van, flipping burgers or going to the dog track was definitely a world he needed to get away from. Having said that, the sport crowds might have meant good opportunities for busking, as was the proximity of a cluster of local pubs; The Prince of Wales, The White Lion, The Corner Pin and The Plough, all literally minutes from his front door. According to Mark Paytress, author of",
          "|after leaving school, the teenage dreamer spent a lot of time kicking-back on his own in that prefab – reading, listening to music and planning his escape route whilst the rest of the family were at work. Sid drove a delivery van for the nearby Airfix factory which made model aeroplane kits. Phyllis gave up her job on a fruit stall at Berwick Street market and now worked for the Post Office Savings Bank at Olympia. Brother Harry, with whom he now shared a bedroom had an office job in Wardour Street.|Over the last seven or eight years I’ve been promoting local history in this area. A great way of doing that is by putting up plaques which are paid for by donations from people who come on my regular guided walks. We called our project ‘Summerstown182’ because the first thing we did was research 182 names on a local First World War memorial. About 25 of them lived in the road into which the Felds moved; indeed many of their relatives were still around. A hugely popular topic on the walks has been Marc’s connection with the area. The prefabs are long gone but I alway liked to stop close to the site of his home to talk about him. The Felds new residence was a highly-desirable Scandinavian-designed ‘Sun Cottage’ prefab. Described in the blurb as|‘20 by 18 feet, containing a lounge, two bedrooms, kitchen, bathroom and all fixtures, fittings and furniture’|. Mark Paytress wrote that it was like|‘a luxury caravan with a pointed roof’|. Wandsworth Council put sixteen of them up on a site opposite the stadium in 1961. From the mid to late sixties Marc pulled away from the area as he got deeper into the music, drawn to the clubs and boutiques in the West End. It was still very much his family home though and ‘Wimbledon 0697’ was the prefab telephone number used by Marc in July 1967 in an advert in Melody Maker to recruit for his new band ‘Tyrannosaurus Rex’. It was also where payment was sent by the BBC the following year after an appearance on John Peel’s ‘Top Gear’ show.|The family connection would however continue for some years. An electoral roll from 1970 shows his parents, Simeon (Sid) and Phyllis still there, at No27 Summerstown, their younger son on the cusp of international fame. They moved a few miles up the road to live on the Ashburton estate in Putney where Sid worked as a caretaker. Marc later bought a property nearby at 142 Upper Richmond Road which was where he and Gloria were driving on the fateful night when he was killed, 16th September 1977.|I’ve met a number of people on my walks who remembered Mark Feld from his early Summerstown days. It was a long time ago, but one person recalled|‘my cousin practising with him at my Auntie’s house on Headworth Street’|. Someone did his Mum’s hair in the salon on Aboyne Road. Others spoke of a very well-dressed young man buying cakes in Carter’s bakery. He had a swagger and was often seen with a guitar slung over his shoulder. People reminisce about his brief time at Hillcroft School (now Ernest Bevin College) on local social media, where he appears to have been one of the first Mods. John Ford, who went on to form The Strawbs and have some big hits himself recalls being in the same leaving year there as Mark in 1963 and hanging out at his home in Summerstown.|Another old friend mentioned him being part of a teen band called ‘The Cabinet’. They practised in the youth club at Tranmere Road School (now Earlsfield Primary). Friday night there was ‘Record Night’ and there were regular Sunday morning sessions outside the prefab jamming old Elvis numbers. They performed at wedding receptions on Henry Prince Estate.|‘We got paid about a fiver and all the beer we could drink’.|Occasionally they went to a jazz club in the Surrey Tavern pub at the top of Burntwood Lane. Mark’s part-time jobs included washing dishes at the well-loved Wimpy burger bar and a brief stint at Edgar’s menswear shop near Tooting Broadway. Mark Paytress recounts a visit to the local labour exchange ended up with Mark filling in a form stating his profession as ‘a poet’. Quite a few people refer to his modelling and the fact he was always very well-turned out.|He had been featured in an article about the emerging Mod scene in ‘Town’ magazine and must have relished the fact that Tooting was full of tailors shops at the time. His friends recall Mark buying a pair of jodphurs from a riding and saddlery shop on Garratt Lane called Rawle & Son. Its very fondly recollected for having a life-size model of a horse in the window. The boots would have helped with the modelling which was his main source of income around the age of 15. Occasional work with some very well known clothing chains included John Temple and even an appearance in a Littlewoods catalogue. He is remembered as being generous with his clothing, often giving any spare gear to his friends.|Another local memory recalls Mark buying a guitar at ‘The Treasure Chest’- an ‘aladdin’s cave’ run by an eccentric Dutch wheeler-dealer known as ‘The Maniac’. Somewhere that might have been passed on the way to school, it set the pulses of local youths racing – as well as musical equipment, selling ‘air-guns, catapults and harpoons’. Its now a grocery store opposite the Tooting Islamic Centre.|He read avidly, Tolkien, Rimbaud, C.S. Lewis and the mystic poetry of Kahlil Gibran. Second hand bookshops were dotted around Tooting Broadway like the one beside the pie and mash shop on Selkirk Road.  When Andy Ellison visited the prefab to have a chat about Marc joining ‘John’s Children’ he recalled him reading a copy of ‘The Tin Drum’ by Gunter Grass. He also served up mushrooms on toast.|I’ve been talking about Marc quite a lot on my walks and would probably have tried organising a plaque for him some years ago were it not for a huge redevelopment in this neighbourhood. The old greyhound stadium site opposite where the Felds lived was demolished a few years ago, the site was flattened and is now being transformed into an enormous housing development cradling a new football stadium which has been up and running since November. It’s a fairytale return to the area for AFC Wimbledon who have been exiled for almost thirty years and though he might not have been much of a sports fan, Marc would surely have appreciated the romance. The pub buildings are all still hanging in there, though in different guises; a tile warehouse, a flooring shop and a supermarket. The Corner Pin is the last great survivor, still doing what it says on the tin and joined by a relatively new kid on the block, a very successful micro-brewery called By the Horns.|There is a photo on the ‘Palaces for the People’ Facebook group which is believed to be the Feld prefab. The location would appear to be about half way down the road called Summerstown and very close to the By the Horns brewery. There’s another very good aerial photo of these dwellings alongside the stadium on the cover of a Wimbledon speedway programme. Apparently the Feld homestead was in the middle of the front row. The Sun Cottages disappeared in the early seventies at about the same time as Marc was storming the pop charts. They’ve been replaced by a string of light industrial units which may not last much longer themselves. Its an odd collection; a carpet shop, a car repair unit and somewhere that makes sash windows, rubbing alongside the hipster brewery. Although all has changed quite drastically, I feel the spirit of Marc hangs over this area, never more vividly than on the night of 16 September 2017, the fortieth anniversary of Marc’s death. I had a word with the DJ who had his decks set up outside The Horns and as the pink sun sank over the old dog track, we raised a glass of Hopadelic to the sound of ‘Solid Gold, Easy Action’. I often think about him when I go past that bakery or the pubs that he busked outside. How much better it would be if there was a plaque with his name on it so that everybody could know about this!|One of those pubs I mentioned, The Prince of Wales is now a Tesco Express. It’s a very old building and will survive the changes all around it. Part of it extends seductively behind the main shopfront, beckoning people towards the stadium and the road called Summerstown where the Felds lived. Its overlooked by a terrace with a rather ornate balustrade, adding a nice touch of theatricals. It seems like a great place for a plaque and that’s where we would like to put it. But we need Tesco to agree so are waiting to hear from them. The above visual was created to show them what we would like to do and the words on it have not yet been finalised.|We would love any fans of Marc to come to Summerstown, to visit the area where he spent his early teenage years. The place where he morphed from Mark Feld to Marc Bolan and set out on his path to stardom. We are now planning a ‘Marc Bolan Teenage Dream’ tour. It will happen in mid-September around the time of Marc’s death when a lot of fans often come to London. We’ll meet at Tooting Broadway tube station and I’ll walk everybody round and introduce the to some key locations. There’s a lot of history here, Marc may not have played at the famous Tooting Granada venue, now a bingo hall, but he was around when The Beatles were there in 1963 and he saw The Rolling Stones there the following year.|At the dawn of the age when people were wearing flowers in their hair, I feel sure that Marc would have appreciated our connection with the daffodil. We’ll walk about a mile or so to Summerstown, passing the site of the old nurseries where Peter Barr ‘The Daffodil King’ cultivated the nation’s favourite flower. We celebrated him with a plaque recently and a campaign called ‘Blooming Tooting’ has encouraged people to plant bulbs. Even if we are still living under restrictions, there will be a self-guided walking tour available to download. That’s what I’ve been doing with all my local history walks, with people using them as their lockdown exercise breaks. You can find all the information here|https://summerstown182.wordpress.com|We may not be able to put up the plaque as planned due to the current pandemic but we would however like to give Marc Bolan fans the opportunity to contribute to making it happen. If lots of people chip in small amounts then we can all say we were part of it. As soon as we know we have permission, we will publicise the fact and set a Crowdfunder up and try to raise the £500 needed. If normal life has returned, we will try to create an event around the unveiling, as we have done in the past. Some speakers, a poetry recital, maybe even a bit of music up on that terrace. We will of course need a special person to do the unveiling. Who could that be? All suggestions are welcome! We would naturally be delighted if any of Marc’s family were able to be involved or attend.|I’m very grateful to a local musician called Jack Hardman who approached me a few months ago pointing out that Marc’s connection to the area is still largely unknown. We’ve decided now is the time to really do something. 2021 seems like an appropriate moment, half a century on from those first unforgettable T.Rex Number Ones, not to mention the significant ‘Electric Warrior’ anniversary and the disappearance of those Summerstown prefabs! The old ‘Prince of Wales’ pub is in a prominent place on a roundabout at the junction of the very busy Garratt Lane. A plaque would be seen by so many people, not least all the football fans going to the new stadium. As local residents, it will be a further reason for us to take pride in the area where we live and encourage future generations to have an awareness and appreciation of Marc’s music.|We intend to keep everyone notified about how this idea progresses but I wanted Marc’s fans all over the world to know that there is another special place, here in a little corner of south west London where his legacy lives on. Whether there is a plaque to look at or not, I really hope you will come to visit and perhaps participate in the proposed ‘Teenage Dream Tour’. In one of his best-known songs, Marc asked ‘Whatever Happened to the Teenage Dream?’ Let me tell you everybody, it is here in Summerstown and ‘Blooming Tooting’ and we can’t wait to share it with you. FLOWER TO THE PEOPLE!|Look out for ‘Marc Bolan’s Tooting Teenage Dream’ Summerstown182 Zoom Talk, happening 7pm, Thursday 25 March. Thanks to everyone on local social media sites whose members contributed their recollections; including ‘I Grew Up in Tooting’. ‘Tooting History Group’, ‘Earlsfield in the 70s/80s’. Mark Paytress’ book|‘Twentieth Century Boy – The Marc Bolan Story’|gives great insights into his time in Summerstown. The ‘Palaces For The People’ website has more about prefabs.|We particularly look forward to welcoming members of the Official Marc Bolan Fan Club to|‘|Blooming Tooting|’|!|Share this:|Twitter|Facebook|Like this:|Like|Loading...|Related|Bookmark the|permalink|.|Post navigation|←|Flower to the People|Toots Musical Roots|→|Leave a Reply|Cancel reply|Enter your comment here...|Fill in your details below or click an icon to log in:|Email|(required)|(Address never made public)|Name|(required)|Website|You are commenting using your WordPress.com account.|(|Log Out|/|Change|)|You are commenting using your Facebook account.|(|Log Out|/|Change|)|Cancel|Connecting to %s|Notify me of new comments via email.|Notify me of new posts via email.|Δ|Search|Recent Posts|476 Garratt Lane|Rollissons Tooting Nursery|The Corruganza Boxmakers|Totterdown Fields Forever|The People of Wardley Street|Follow us on Twitter|My Tweets|Archives|May 2023|March 2023|February 2023|April 2022|June 2021|January 2021|September 2020|July 2020|February 2020|December 2019|September 2019|August 2019|June 2019|March 2019|December 2018|July 2018|June 2018|May 2018|April 2018|March 2018|February 2018|January 2018|December 2017|November 2017|October 2017|September 2017|August 2017|July 2017|June 2017|May 2017|April 2017|March 2017|February 2017|January 2017|December 2016|November 2016|October 2016|September 2016|July 2016|June 2016|May 2016|April 2016|March 2016|February 2016|January 2016|December 2015|November 2015|October 2015|September 2015|August 2015|July 2015|June 2015|May 2015|April 2015|March 2015|February 2015|January 2015|December 2014|November 2014|October 2014|September 2014|August 2014|July 2014|June 2014|May 2014|April 2014|March 2014|February 2014|January 2014|December 2013|Categories|Uncategorized|Meta|Register|Log in|Entries feed|Comments feed|WordPress.com|Recent Comments|The Daffodil King of…|on|The Day of The Daffodil|Mr. C. Knight on|The Jewel in the Crown|Joe Caudle on|The Bootmaker’s Boy|Bill Harding|on|Lavender and Gunpowder|Jane on|The Daffodil King|Create a free website at WordPress.com.|Follow|Following|Summerstown182|Join 89 other followers|Sign me up|Already have a WordPress.com account?|Log in now.|Summerstown182|Customize|Follow|Following|Sign up|Log in|Copy shortlink|Report this content|View post in Reader|Manage subscriptions|Collapse this bar|Loading Comments...|Write a Comment...|Email (Required)|Name (Required)|Website|%d|bloggers like this:",
          "|.  By the time Mark arrived they were all still there, and are still here today! Some of the allotments have been converted to sewage treatment works and a strip of car showrooms, warehouses and light industry are dissected by an intimidating procession of electricity pylons. It",
          "|s all a very long way from Carnaby Street and Stoke Newington, but this is where the Feld family; Sid, Phyllis, Harry and Mark came to live in the early sixties.",
          "|Their prefab was on a road running alongside the famous Wimbledon Greyhound Stadium where dog racing and speedway were still attracting huge crowds. The local glamour boys at the time were the speedway stars who rode for the Wimbledon Dons. Its unlikely that the thirteen year old Marc was impressed. Their home might have been brand new, with fitted furniture and TV, but being rehoused on the other side of London away from all his friends would have been a huge shock. There’s a certain vibe around here that I feel must have helped kickstart his teenage dream – driving a van, flipping burgers or going to the dog track was definitely a world he needed to get away from. Having said that, the sport crowds might have meant good opportunities for busking, as was the proximity of a cluster of local pubs; The Prince of Wales, The White Lion, The Corner Pin and The Plough, all literally minutes from his front door. According to Mark Paytress, author of",
          "|after leaving school, the teenage dreamer spent a lot of time kicking-back on his own in that prefab – reading, listening to music and planning his escape route whilst the rest of the family were at work. Sid drove a delivery van for the nearby Airfix factory which made model aeroplane kits. Phyllis gave up her job on a fruit stall at Berwick Street market and now worked for the Post Office Savings Bank at Olympia. Brother Harry, with whom he now shared a bedroom had an office job in Wardour Street.|Over the last seven or eight years I’ve been promoting local history in this area. A great way of doing that is by putting up plaques which are paid for by donations from people who come on my regular guided walks. We called our project ‘Summerstown182’ because the first thing we did was research 182 names on a local First World War memorial. About 25 of them lived in the road into which the Felds moved; indeed many of their relatives were still around. A hugely popular topic on the walks has been Marc’s connection with the area. The prefabs are long gone but I alway liked to stop close to the site of his home to talk about him. The Felds new residence was a highly-desirable Scandinavian-designed ‘Sun Cottage’ prefab. Described in the blurb as|‘20 by 18 feet, containing a lounge, two bedrooms, kitchen, bathroom and all fixtures, fittings and furniture’|. Mark Paytress wrote that it was like|‘a luxury caravan with a pointed roof’|. Wandsworth Council put sixteen of them up on a site opposite the stadium in 1961. From the mid to late sixties Marc pulled away from the area as he got deeper into the music, drawn to the clubs and boutiques in the West End. It was still very much his family home though and ‘Wimbledon 0697’ was the prefab telephone number used by Marc in July 1967 in an advert in Melody Maker to recruit for his new band ‘Tyrannosaurus Rex’. It was also where payment was sent by the BBC the following year after an appearance on John Peel’s ‘Top Gear’ show.|The family connection would however continue for some years. An electoral roll from 1970 shows his parents, Simeon (Sid) and Phyllis still there, at No27 Summerstown, their younger son on the cusp of international fame. They moved a few miles up the road to live on the Ashburton estate in Putney where Sid worked as a caretaker. Marc later bought a property nearby at 142 Upper Richmond Road which was where he and Gloria were driving on the fateful night when he was killed, 16th September 1977.|I’ve met a number of people on my walks who remembered Mark Feld from his early Summerstown days. It was a long time ago, but one person recalled|‘my cousin practising with him at my Auntie’s house on Headworth Street’|. Someone did his Mum’s hair in the salon on Aboyne Road. Others spoke of a very well-dressed young man buying cakes in Carter’s bakery. He had a swagger and was often seen with a guitar slung over his shoulder. People reminisce about his brief time at Hillcroft School (now Ernest Bevin College) on local social media, where he appears to have been one of the first Mods. John Ford, who went on to form The Strawbs and have some big hits himself recalls being in the same leaving year there as Mark in 1963 and hanging out at his home in Summerstown.|Another old friend mentioned him being part of a teen band called ‘The Cabinet’. They practised in the youth club at Tranmere Road School (now Earlsfield Primary). Friday night there was ‘Record Night’ and there were regular Sunday morning sessions outside the prefab jamming old Elvis numbers. They performed at wedding receptions on Henry Prince Estate.|‘We got paid about a fiver and all the beer we could drink’.|Occasionally they went to a jazz club in the Surrey Tavern pub at the top of Burntwood Lane. Mark’s part-time jobs included washing dishes at the well-loved Wimpy burger bar and a brief stint at Edgar’s menswear shop near Tooting Broadway. Mark Paytress recounts a visit to the local labour exchange ended up with Mark filling in a form stating his profession as ‘a poet’. Quite a few people refer to his modelling and the fact he was always very well-turned out.|He had been featured in an article about the emerging Mod scene in ‘Town’ magazine and must have relished the fact that Tooting was full of tailors shops at the time. His friends recall Mark buying a pair of jodphurs from a riding and saddlery shop on Garratt Lane called Rawle & Son. Its very fondly recollected for having a life-size model of a horse in the window. The boots would have helped with the modelling which was his main source of income around the age of 15. Occasional work with some very well known clothing chains included John Temple and even an appearance in a Littlewoods catalogue. He is remembered as being generous with his clothing, often giving any spare gear to his friends.|Another local memory recalls Mark buying a guitar at ‘The Treasure Chest’- an ‘aladdin’s cave’ run by an eccentric Dutch wheeler-dealer known as ‘The Maniac’. Somewhere that might have been passed on the way to school, it set the pulses of local youths racing – as well as musical equipment, selling ‘air-guns, catapults and harpoons’. Its now a grocery store opposite the Tooting Islamic Centre.|He read avidly, Tolkien, Rimbaud, C.S. Lewis and the mystic poetry of Kahlil Gibran. Second hand bookshops were dotted around Tooting Broadway like the one beside the pie and mash shop on Selkirk Road.  When Andy Ellison visited the prefab to have a chat about Marc joining ‘John’s Children’ he recalled him reading a copy of ‘The Tin Drum’ by Gunter Grass. He also served up mushrooms on toast.|I’ve been talking about Marc quite a lot on my walks and would probably have tried organising a plaque for him some years ago were it not for a huge redevelopment in this neighbourhood. The old greyhound stadium site opposite where the Felds lived was demolished a few years ago, the site was flattened and is now being transformed into an enormous housing development cradling a new football stadium which has been up and running since November. It’s a fairytale return to the area for AFC Wimbledon who have been exiled for almost thirty years and though he might not have been much of a sports fan, Marc would surely have appreciated the romance. The pub buildings are all still hanging in there, though in different guises; a tile warehouse, a flooring shop and a supermarket. The Corner Pin is the last great survivor, still doing what it says on the tin and joined by a relatively new kid on the block, a very successful micro-brewery called By the Horns.|There is a photo on the ‘Palaces for the People’ Facebook group which is believed to be the Feld prefab. The location would appear to be about half way down the road called Summerstown and very close to the By the Horns brewery. There’s another very good aerial photo of these dwellings alongside the stadium on the cover of a Wimbledon speedway programme. Apparently the Feld homestead was in the middle of the front row. The Sun Cottages disappeared in the early seventies at about the same time as Marc was storming the pop charts. They’ve been replaced by a string of light industrial units which may not last much longer themselves. Its an odd collection; a carpet shop, a car repair unit and somewhere that makes sash windows, rubbing alongside the hipster brewery. Although all has changed quite drastically, I feel the spirit of Marc hangs over this area, never more vividly than on the night of 16 September 2017, the fortieth anniversary of Marc’s death. I had a word with the DJ who had his decks set up outside The Horns and as the pink sun sank over the old dog track, we raised a glass of Hopadelic to the sound of ‘Solid Gold, Easy Action’. I often think about him when I go past that bakery or the pubs that he busked outside. How much better it would be if there was a plaque with his name on it so that everybody could know about this!|One of those pubs I mentioned, The Prince of Wales is now a Tesco Express. It’s a very old building and will survive the changes all around it. Part of it extends seductively behind the main shopfront, beckoning people towards the stadium and the road called Summerstown where the Felds lived. Its overlooked by a terrace with a rather ornate balustrade, adding a nice touch of theatricals. It seems like a great place for a plaque and that’s where we would like to put it. But we need Tesco to agree so are waiting to hear from them. The above visual was created to show them what we would like to do and the words on it have not yet been finalised.|We would love any fans of Marc to come to Summerstown, to visit the area where he spent his early teenage years. The place where he morphed from Mark Feld to Marc Bolan and set out on his path to stardom. We are now planning a ‘Marc Bolan Teenage Dream’ tour. It will happen in mid-September around the time of Marc’s death when a lot of fans often come to London. We’ll meet at Tooting Broadway tube station and I’ll walk everybody round and introduce the to some key locations. There’s a lot of history here, Marc may not have played at the famous Tooting Granada venue, now a bingo hall, but he was around when The Beatles were there in 1963 and he saw The Rolling Stones there the following year.|At the dawn of the age when people were wearing flowers in their hair, I feel sure that Marc would have appreciated our connection with the daffodil. We’ll walk about a mile or so to Summerstown, passing the site of the old nurseries where Peter Barr ‘The Daffodil King’ cultivated the nation’s favourite flower. We celebrated him with a plaque recently and a campaign called ‘Blooming Tooting’ has encouraged people to plant bulbs. Even if we are still living under restrictions, there will be a self-guided walking tour available to download. That’s what I’ve been doing with all my local history walks, with people using them as their lockdown exercise breaks. You can find all the information here|https://summerstown182.wordpress.com|We may not be able to put up the plaque as planned due to the current pandemic but we would however like to give Marc Bolan fans the opportunity to contribute to making it happen. If lots of people chip in small amounts then we can all say we were part of it. As soon as we know we have permission, we will publicise the fact and set a Crowdfunder up and try to raise the £500 needed. If normal life has returned, we will try to create an event around the unveiling, as we have done in the past. Some speakers, a poetry recital, maybe even a bit of music up on that terrace. We will of course need a special person to do the unveiling. Who could that be? All suggestions are welcome! We would naturally be delighted if any of Marc’s family were able to be involved or attend.|I’m very grateful to a local musician called Jack Hardman who approached me a few months ago pointing out that Marc’s connection to the area is still largely unknown. We’ve decided now is the time to really do something. 2021 seems like an appropriate moment, half a century on from those first unforgettable T.Rex Number Ones, not to mention the significant ‘Electric Warrior’ anniversary and the disappearance of those Summerstown prefabs! The old ‘Prince of Wales’ pub is in a prominent place on a roundabout at the junction of the very busy Garratt Lane. A plaque would be seen by so many people, not least all the football fans going to the new stadium. As local residents, it will be a further reason for us to take pride in the area where we live and encourage future generations to have an awareness and appreciation of Marc’s music.|We intend to keep everyone notified about how this idea progresses but I wanted Marc’s fans all over the world to know that there is another special place, here in a little corner of south west London where his legacy lives on. Whether there is a plaque to look at or not, I really hope you will come to visit and perhaps participate in the proposed ‘Teenage Dream Tour’. In one of his best-known songs, Marc asked ‘Whatever Happened to the Teenage Dream?’ Let me tell you everybody, it is here in Summerstown and ‘Blooming Tooting’ and we can’t wait to share it with you. FLOWER TO THE PEOPLE!|Look out for ‘Marc Bolan’s Tooting Teenage Dream’ Summerstown182 Zoom Talk, happening 7pm, Thursday 25 March. Thanks to everyone on local social media sites whose members contributed their recollections; including ‘I Grew Up in Tooting’. ‘Tooting History Group’, ‘Earlsfield in the 70s/80s’. Mark Paytress’ book|‘Twentieth Century Boy – The Marc Bolan Story’|gives great insights into his time in Summerstown. The ‘Palaces For The People’ website has more about prefabs.|We particularly look forward to welcoming members of the Official Marc Bolan Fan Club to|‘|Blooming Tooting|’|!|Share this:|Twitter|Facebook|Like this:|Like|Loading...|Related|Bookmark the|permalink|.|Post navigation|←|Flower to the People|Toots Musical Roots|→|Leave a Reply|Cancel reply|Enter your comment here...|Fill in your details below or click an icon to log in:|Email|(required)|(Address never made public)|Name|(required)|Website|You are commenting using your WordPress.com account.|(|Log Out|/|Change|)|You are commenting using your Facebook account.|(|Log Out|/|Change|)|Cancel|Connecting to %s|Notify me of new comments via email.|Notify me of new posts via email.|Δ|Search|Recent Posts|476 Garratt Lane|Rollissons Tooting Nursery|The Corruganza Boxmakers|Totterdown Fields Forever|The People of Wardley Street|Follow us on Twitter|My Tweets|Archives|May 2023|March 2023|February 2023|April 2022|June 2021|January 2021|September 2020|July 2020|February 2020|December 2019|September 2019|August 2019|June 2019|March 2019|December 2018|July 2018|June 2018|May 2018|April 2018|March 2018|February 2018|January 2018|December 2017|November 2017|October 2017|September 2017|August 2017|July 2017|June 2017|May 2017|April 2017|March 2017|February 2017|January 2017|December 2016|November 2016|October 2016|September 2016|July 2016|June 2016|May 2016|April 2016|March 2016|February 2016|January 2016|December 2015|November 2015|October 2015|September 2015|August 2015|July 2015|June 2015|May 2015|April 2015|March 2015|February 2015|January 2015|December 2014|November 2014|October 2014|September 2014|August 2014|July 2014|June 2014|May 2014|April 2014|March 2014|February 2014|January 2014|December 2013|Categories|Uncategorized|Meta|Register|Log in|Entries feed|Comments feed|WordPress.com|Recent Comments|The Daffodil King of…|on|The Day of The Daffodil|Mr. C. Knight on|The Jewel in the Crown|Joe Caudle on|The Bootmaker’s Boy|Bill Harding|on|Lavender and Gunpowder|Jane on|The Daffodil King|Create a free website at WordPress.com.|Follow|Following|Summerstown182|Join 89 other followers|Sign me up|Already have a WordPress.com account?|Log in now.|Summerstown182|Customize|Follow|Following|Sign up|Log in|Copy shortlink|Report this content|View post in Reader|Manage subscriptions|Collapse this bar|Loading Comments...|Write a Comment...|Email (Required)|Name (Required)|Website|%d|bloggers like this:",
          "|.  By the time Mark arrived they were all still there, and are still here today! Some of the allotments have been converted to sewage treatment works and a strip of car showrooms, warehouses and light industry are dissected by an intimidating procession of electricity pylons. It",
          "|s all a very long way from Carnaby Street and Stoke Newington, but this is where the Feld family; Sid, Phyllis, Harry and Mark came to live in the early sixties.",
          "|Their prefab was on a road running alongside the famous Wimbledon Greyhound Stadium where dog racing and speedway were still attracting huge crowds. The local glamour boys at the time were the speedway stars who rode for the Wimbledon Dons. Its unlikely that the thirteen year old Marc was impressed. Their home might have been brand new, with fitted furniture and TV, but being rehoused on the other side of London away from all his friends would have been a huge shock. There’s a certain vibe around here that I feel must have helped kickstart his teenage dream – driving a van, flipping burgers or going to the dog track was definitely a world he needed to get away from. Having said that, the sport crowds might have meant good opportunities for busking, as was the proximity of a cluster of local pubs; The Prince of Wales, The White Lion, The Corner Pin and The Plough, all literally minutes from his front door. According to Mark Paytress, author of",
          "|after leaving school, the teenage dreamer spent a lot of time kicking-back on his own in that prefab – reading, listening to music and planning his escape route whilst the rest of the family were at work. Sid drove a delivery van for the nearby Airfix factory which made model aeroplane kits. Phyllis gave up her job on a fruit stall at Berwick Street market and now worked for the Post Office Savings Bank at Olympia. Brother Harry, with whom he now shared a bedroom had an office job in Wardour Street.|Over the last seven or eight years I’ve been promoting local history in this area. A great way of doing that is by putting up plaques which are paid for by donations from people who come on my regular guided walks. We called our project ‘Summerstown182’ because the first thing we did was research 182 names on a local First World War memorial. About 25 of them lived in the road into which the Felds moved; indeed many of their relatives were still around. A hugely popular topic on the walks has been Marc’s connection with the area. The prefabs are long gone but I alway liked to stop close to the site of his home to talk about him. The Felds new residence was a highly-desirable Scandinavian-designed ‘Sun Cottage’ prefab. Described in the blurb as|‘20 by 18 feet, containing a lounge, two bedrooms, kitchen, bathroom and all fixtures, fittings and furniture’|. Mark Paytress wrote that it was like|‘a luxury caravan with a pointed roof’|. Wandsworth Council put sixteen of them up on a site opposite the stadium in 1961. From the mid to late sixties Marc pulled away from the area as he got deeper into the music, drawn to the clubs and boutiques in the West End. It was still very much his family home though and ‘Wimbledon 0697’ was the prefab telephone number used by Marc in July 1967 in an advert in Melody Maker to recruit for his new band ‘Tyrannosaurus Rex’. It was also where payment was sent by the BBC the following year after an appearance on John Peel’s ‘Top Gear’ show.|The family connection would however continue for some years. An electoral roll from 1970 shows his parents, Simeon (Sid) and Phyllis still there, at No27 Summerstown, their younger son on the cusp of international fame. They moved a few miles up the road to live on the Ashburton estate in Putney where Sid worked as a caretaker. Marc later bought a property nearby at 142 Upper Richmond Road which was where he and Gloria were driving on the fateful night when he was killed, 16th September 1977.|I’ve met a number of people on my walks who remembered Mark Feld from his early Summerstown days. It was a long time ago, but one person recalled|‘my cousin practising with him at my Auntie’s house on Headworth Street’|. Someone did his Mum’s hair in the salon on Aboyne Road. Others spoke of a very well-dressed young man buying cakes in Carter’s bakery. He had a swagger and was often seen with a guitar slung over his shoulder. People reminisce about his brief time at Hillcroft School (now Ernest Bevin College) on local social media, where he appears to have been one of the first Mods. John Ford, who went on to form The Strawbs and have some big hits himself recalls being in the same leaving year there as Mark in 1963 and hanging out at his home in Summerstown.|Another old friend mentioned him being part of a teen band called ‘The Cabinet’. They practised in the youth club at Tranmere Road School (now Earlsfield Primary). Friday night there was ‘Record Night’ and there were regular Sunday morning sessions outside the prefab jamming old Elvis numbers. They performed at wedding receptions on Henry Prince Estate.|‘We got paid about a fiver and all the beer we could drink’.|Occasionally they went to a jazz club in the Surrey Tavern pub at the top of Burntwood Lane. Mark’s part-time jobs included washing dishes at the well-loved Wimpy burger bar and a brief stint at Edgar’s menswear shop near Tooting Broadway. Mark Paytress recounts a visit to the local labour exchange ended up with Mark filling in a form stating his profession as ‘a poet’. Quite a few people refer to his modelling and the fact he was always very well-turned out.|He had been featured in an article about the emerging Mod scene in ‘Town’ magazine and must have relished the fact that Tooting was full of tailors shops at the time. His friends recall Mark buying a pair of jodphurs from a riding and saddlery shop on Garratt Lane called Rawle & Son. Its very fondly recollected for having a life-size model of a horse in the window. The boots would have helped with the modelling which was his main source of income around the age of 15. Occasional work with some very well known clothing chains included John Temple and even an appearance in a Littlewoods catalogue. He is remembered as being generous with his clothing, often giving any spare gear to his friends.|Another local memory recalls Mark buying a guitar at ‘The Treasure Chest’- an ‘aladdin’s cave’ run by an eccentric Dutch wheeler-dealer known as ‘The Maniac’. Somewhere that might have been passed on the way to school, it set the pulses of local youths racing – as well as musical equipment, selling ‘air-guns, catapults and harpoons’. Its now a grocery store opposite the Tooting Islamic Centre.|He read avidly, Tolkien, Rimbaud, C.S. Lewis and the mystic poetry of Kahlil Gibran. Second hand bookshops were dotted around Tooting Broadway like the one beside the pie and mash shop on Selkirk Road.  When Andy Ellison visited the prefab to have a chat about Marc joining ‘John’s Children’ he recalled him reading a copy of ‘The Tin Drum’ by Gunter Grass. He also served up mushrooms on toast.|I’ve been talking about Marc quite a lot on my walks and would probably have tried organising a plaque for him some years ago were it not for a huge redevelopment in this neighbourhood. The old greyhound stadium site opposite where the Felds lived was demolished a few years ago, the site was flattened and is now being transformed into an enormous housing development cradling a new football stadium which has been up and running since November. It’s a fairytale return to the area for AFC Wimbledon who have been exiled for almost thirty years and though he might not have been much of a sports fan, Marc would surely have appreciated the romance. The pub buildings are all still hanging in there, though in different guises; a tile warehouse, a flooring shop and a supermarket. The Corner Pin is the last great survivor, still doing what it says on the tin and joined by a relatively new kid on the block, a very successful micro-brewery called By the Horns.|There is a photo on the ‘Palaces for the People’ Facebook group which is believed to be the Feld prefab. The location would appear to be about half way down the road called Summerstown and very close to the By the Horns brewery. There’s another very good aerial photo of these dwellings alongside the stadium on the cover of a Wimbledon speedway programme. Apparently the Feld homestead was in the middle of the front row. The Sun Cottages disappeared in the early seventies at about the same time as Marc was storming the pop charts. They’ve been replaced by a string of light industrial units which may not last much longer themselves. Its an odd collection; a carpet shop, a car repair unit and somewhere that makes sash windows, rubbing alongside the hipster brewery. Although all has changed quite drastically, I feel the spirit of Marc hangs over this area, never more vividly than on the night of 16 September 2017, the fortieth anniversary of Marc’s death. I had a word with the DJ who had his decks set up outside The Horns and as the pink sun sank over the old dog track, we raised a glass of Hopadelic to the sound of ‘Solid Gold, Easy Action’. I often think about him when I go past that bakery or the pubs that he busked outside. How much better it would be if there was a plaque with his name on it so that everybody could know about this!|One of those pubs I mentioned, The Prince of Wales is now a Tesco Express. It’s a very old building and will survive the changes all around it. Part of it extends seductively behind the main shopfront, beckoning people towards the stadium and the road called Summerstown where the Felds lived. Its overlooked by a terrace with a rather ornate balustrade, adding a nice touch of theatricals. It seems like a great place for a plaque and that’s where we would like to put it. But we need Tesco to agree so are waiting to hear from them. The above visual was created to show them what we would like to do and the words on it have not yet been finalised.|We would love any fans of Marc to come to Summerstown, to visit the area where he spent his early teenage years. The place where he morphed from Mark Feld to Marc Bolan and set out on his path to stardom. We are now planning a ‘Marc Bolan Teenage Dream’ tour. It will happen in mid-September around the time of Marc’s death when a lot of fans often come to London. We’ll meet at Tooting Broadway tube station and I’ll walk everybody round and introduce the to some key locations. There’s a lot of history here, Marc may not have played at the famous Tooting Granada venue, now a bingo hall, but he was around when The Beatles were there in 1963 and he saw The Rolling Stones there the following year.|At the dawn of the age when people were wearing flowers in their hair, I feel sure that Marc would have appreciated our connection with the daffodil. We’ll walk about a mile or so to Summerstown, passing the site of the old nurseries where Peter Barr ‘The Daffodil King’ cultivated the nation’s favourite flower. We celebrated him with a plaque recently and a campaign called ‘Blooming Tooting’ has encouraged people to plant bulbs. Even if we are still living under restrictions, there will be a self-guided walking tour available to download. That’s what I’ve been doing with all my local history walks, with people using them as their lockdown exercise breaks. You can find all the information here|https://summerstown182.wordpress.com|We may not be able to put up the plaque as planned due to the current pandemic but we would however like to give Marc Bolan fans the opportunity to contribute to making it happen. If lots of people chip in small amounts then we can all say we were part of it. As soon as we know we have permission, we will publicise the fact and set a Crowdfunder up and try to raise the £500 needed. If normal life has returned, we will try to create an event around the unveiling, as we have done in the past. Some speakers, a poetry recital, maybe even a bit of music up on that terrace. We will of course need a special person to do the unveiling. Who could that be? All suggestions are welcome! We would naturally be delighted if any of Marc’s family were able to be involved or attend.|I’m very grateful to a local musician called Jack Hardman who approached me a few months ago pointing out that Marc’s connection to the area is still largely unknown. We’ve decided now is the time to really do something. 2021 seems like an appropriate moment, half a century on from those first unforgettable T.Rex Number Ones, not to mention the significant ‘Electric Warrior’ anniversary and the disappearance of those Summerstown prefabs! The old ‘Prince of Wales’ pub is in a prominent place on a roundabout at the junction of the very busy Garratt Lane. A plaque would be seen by so many people, not least all the football fans going to the new stadium. As local residents, it will be a further reason for us to take pride in the area where we live and encourage future generations to have an awareness and appreciation of Marc’s music.|We intend to keep everyone notified about how this idea progresses but I wanted Marc’s fans all over the world to know that there is another special place, here in a little corner of south west London where his legacy lives on. Whether there is a plaque to look at or not, I really hope you will come to visit and perhaps participate in the proposed ‘Teenage Dream Tour’. In one of his best-known songs, Marc asked ‘Whatever Happened to the Teenage Dream?’ Let me tell you everybody, it is here in Summerstown and ‘Blooming Tooting’ and we can’t wait to share it with you. FLOWER TO THE PEOPLE!|Look out for ‘Marc Bolan’s Tooting Teenage Dream’ Summerstown182 Zoom Talk, happening 7pm, Thursday 25 March. Thanks to everyone on local social media sites whose members contributed their recollections; including ‘I Grew Up in Tooting’. ‘Tooting History Group’, ‘Earlsfield in the 70s/80s’. Mark Paytress’ book|‘Twentieth Century Boy – The Marc Bolan Story’|gives great insights into his time in Summerstown. The ‘Palaces For The People’ website has more about prefabs.|We particularly look forward to welcoming members of the Official Marc Bolan Fan Club to|‘|Blooming Tooting|’|!|Share this:|Twitter|Facebook|Like this:|Like|Loading...|Related|Bookmark the|permalink|.|Post navigation|←|Flower to the People|Toots Musical Roots|→|Leave a Reply|Cancel reply|Enter your comment here...|Fill in your details below or click an icon to log in:|Email|(required)|(Address never made public)|Name|(required)|Website|You are commenting using your WordPress.com account.|(|Log Out|/|Change|)|You are commenting using your Facebook account.|(|Log Out|/|Change|)|Cancel|Connecting to %s|Notify me of new comments via email.|Notify me of new posts via email.|Δ|Search|Recent Posts|476 Garratt Lane|Rollissons Tooting Nursery|The Corruganza Boxmakers|Totterdown Fields Forever|The People of Wardley Street|Follow us on Twitter|My Tweets|Archives|May 2023|March 2023|February 2023|April 2022|June 2021|January 2021|September 2020|July 2020|February 2020|December 2019|September 2019|August 2019|June 2019|March 2019|December 2018|July 2018|June 2018|May 2018|April 2018|March 2018|February 2018|January 2018|December 2017|November 2017|October 2017|September 2017|August 2017|July 2017|June 2017|May 2017|April 2017|March 2017|February 2017|January 2017|December 2016|November 2016|October 2016|September 2016|July 2016|June 2016|May 2016|April 2016|March 2016|February 2016|January 2016|December 2015|November 2015|October 2015|September 2015|August 2015|July 2015|June 2015|May 2015|April 2015|March 2015|February 2015|January 2015|December 2014|November 2014|October 2014|September 2014|August 2014|July 2014|June 2014|May 2014|April 2014|March 2014|February 2014|January 2014|December 2013|Categories|Uncategorized|Meta|Register|Log in|Entries feed|Comments feed|WordPress.com|Recent Comments|The Daffodil King of…|on|The Day of The Daffodil|Mr. C. Knight on|The Jewel in the Crown|Joe Caudle on|The Bootmaker’s Boy|Bill Harding|on|Lavender and Gunpowder|Jane on|The Daffodil King|Create a free website at WordPress.com.|Follow|Following|Summerstown182|Join 89 other followers|Sign me up|Already have a WordPress.com account?|Log in now.|Summerstown182|Customize|Follow|Following|Sign up|Log in|Copy shortlink|Report this content|View post in Reader|Manage subscriptions|Collapse this bar|Loading Comments...|Write a Comment...|Email (Required)|Name (Required)|Website|%d|bloggers like this:",
          "|.  By the time Mark arrived they were all still there, and are still here today! Some of the allotments have been converted to sewage treatment works and a strip of car showrooms, warehouses and light industry are dissected by an intimidating procession of electricity pylons. It",
          "|s all a very long way from Carnaby Street and Stoke Newington, but this is where the Feld family; Sid, Phyllis, Harry and Mark came to live in the early sixties.",
          "|Their prefab was on a road running alongside the famous Wimbledon Greyhound Stadium where dog racing and speedway were still attracting huge crowds. The local glamour boys at the time were the speedway stars who rode for the Wimbledon Dons. Its unlikely that the thirteen year old Marc was impressed. Their home might have been brand new, with fitted furniture and TV, but being rehoused on the other side of London away from all his friends would have been a huge shock. There’s a certain vibe around here that I feel must have helped kickstart his teenage dream – driving a van, flipping burgers or going to the dog track was definitely a world he needed to get away from. Having said that, the sport crowds might have meant good opportunities for busking, as was the proximity of a cluster of local pubs; The Prince of Wales, The White Lion, The Corner Pin and The Plough, all literally minutes from his front door. According to Mark Paytress, author of",
          "|after leaving school, the teenage dreamer spent a lot of time kicking-back on his own in that prefab – reading, listening to music and planning his escape route whilst the rest of the family were at work. Sid drove a delivery van for the nearby Airfix factory which made model aeroplane kits. Phyllis gave up her job on a fruit stall at Berwick Street market and now worked for the Post Office Savings Bank at Olympia. Brother Harry, with whom he now shared a bedroom had an office job in Wardour Street.|Over the last seven or eight years I’ve been promoting local history in this area. A great way of doing that is by putting up plaques which are paid for by donations from people who come on my regular guided walks. We called our project ‘Summerstown182’ because the first thing we did was research 182 names on a local First World War memorial. About 25 of them lived in the road into which the Felds moved; indeed many of their relatives were still around. A hugely popular topic on the walks has been Marc’s connection with the area. The prefabs are long gone but I alway liked to stop close to the site of his home to talk about him. The Felds new residence was a highly-desirable Scandinavian-designed ‘Sun Cottage’ prefab. Described in the blurb as|‘20 by 18 feet, containing a lounge, two bedrooms, kitchen, bathroom and all fixtures, fittings and furniture’|. Mark Paytress wrote that it was like|‘a luxury caravan with a pointed roof’|. Wandsworth Council put sixteen of them up on a site opposite the stadium in 1961. From the mid to late sixties Marc pulled away from the area as he got deeper into the music, drawn to the clubs and boutiques in the West End. It was still very much his family home though and ‘Wimbledon 0697’ was the prefab telephone number used by Marc in July 1967 in an advert in Melody Maker to recruit for his new band ‘Tyrannosaurus Rex’. It was also where payment was sent by the BBC the following year after an appearance on John Peel’s ‘Top Gear’ show.|The family connection would however continue for some years. An electoral roll from 1970 shows his parents, Simeon (Sid) and Phyllis still there, at No27 Summerstown, their younger son on the cusp of international fame. They moved a few miles up the road to live on the Ashburton estate in Putney where Sid worked as a caretaker. Marc later bought a property nearby at 142 Upper Richmond Road which was where he and Gloria were driving on the fateful night when he was killed, 16th September 1977.|I’ve met a number of people on my walks who remembered Mark Feld from his early Summerstown days. It was a long time ago, but one person recalled|‘my cousin practising with him at my Auntie’s house on Headworth Street’|. Someone did his Mum’s hair in the salon on Aboyne Road. Others spoke of a very well-dressed young man buying cakes in Carter’s bakery. He had a swagger and was often seen with a guitar slung over his shoulder. People reminisce about his brief time at Hillcroft School (now Ernest Bevin College) on local social media, where he appears to have been one of the first Mods. John Ford, who went on to form The Strawbs and have some big hits himself recalls being in the same leaving year there as Mark in 1963 and hanging out at his home in Summerstown.|Another old friend mentioned him being part of a teen band called ‘The Cabinet’. They practised in the youth club at Tranmere Road School (now Earlsfield Primary). Friday night there was ‘Record Night’ and there were regular Sunday morning sessions outside the prefab jamming old Elvis numbers. They performed at wedding receptions on Henry Prince Estate.|‘We got paid about a fiver and all the beer we could drink’.|Occasionally they went to a jazz club in the Surrey Tavern pub at the top of Burntwood Lane. Mark’s part-time jobs included washing dishes at the well-loved Wimpy burger bar and a brief stint at Edgar’s menswear shop near Tooting Broadway. Mark Paytress recounts a visit to the local labour exchange ended up with Mark filling in a form stating his profession as ‘a poet’. Quite a few people refer to his modelling and the fact he was always very well-turned out.|He had been featured in an article about the emerging Mod scene in ‘Town’ magazine and must have relished the fact that Tooting was full of tailors shops at the time. His friends recall Mark buying a pair of jodphurs from a riding and saddlery shop on Garratt Lane called Rawle & Son. Its very fondly recollected for having a life-size model of a horse in the window. The boots would have helped with the modelling which was his main source of income around the age of 15. Occasional work with some very well known clothing chains included John Temple and even an appearance in a Littlewoods catalogue. He is remembered as being generous with his clothing, often giving any spare gear to his friends.|Another local memory recalls Mark buying a guitar at ‘The Treasure Chest’- an ‘aladdin’s cave’ run by an eccentric Dutch wheeler-dealer known as ‘The Maniac’. Somewhere that might have been passed on the way to school, it set the pulses of local youths racing – as well as musical equipment, selling ‘air-guns, catapults and harpoons’. Its now a grocery store opposite the Tooting Islamic Centre.|He read avidly, Tolkien, Rimbaud, C.S. Lewis and the mystic poetry of Kahlil Gibran. Second hand bookshops were dotted around Tooting Broadway like the one beside the pie and mash shop on Selkirk Road.  When Andy Ellison visited the prefab to have a chat about Marc joining ‘John’s Children’ he recalled him reading a copy of ‘The Tin Drum’ by Gunter Grass. He also served up mushrooms on toast.|I’ve been talking about Marc quite a lot on my walks and would probably have tried organising a plaque for him some years ago were it not for a huge redevelopment in this neighbourhood. The old greyhound stadium site opposite where the Felds lived was demolished a few years ago, the site was flattened and is now being transformed into an enormous housing development cradling a new football stadium which has been up and running since November. It’s a fairytale return to the area for AFC Wimbledon who have been exiled for almost thirty years and though he might not have been much of a sports fan, Marc would surely have appreciated the romance. The pub buildings are all still hanging in there, though in different guises; a tile warehouse, a flooring shop and a supermarket. The Corner Pin is the last great survivor, still doing what it says on the tin and joined by a relatively new kid on the block, a very successful micro-brewery called By the Horns.|There is a photo on the ‘Palaces for the People’ Facebook group which is believed to be the Feld prefab. The location would appear to be about half way down the road called Summerstown and very close to the By the Horns brewery. There’s another very good aerial photo of these dwellings alongside the stadium on the cover of a Wimbledon speedway programme. Apparently the Feld homestead was in the middle of the front row. The Sun Cottages disappeared in the early seventies at about the same time as Marc was storming the pop charts. They’ve been replaced by a string of light industrial units which may not last much longer themselves. Its an odd collection; a carpet shop, a car repair unit and somewhere that makes sash windows, rubbing alongside the hipster brewery. Although all has changed quite drastically, I feel the spirit of Marc hangs over this area, never more vividly than on the night of 16 September 2017, the fortieth anniversary of Marc’s death. I had a word with the DJ who had his decks set up outside The Horns and as the pink sun sank over the old dog track, we raised a glass of Hopadelic to the sound of ‘Solid Gold, Easy Action’. I often think about him when I go past that bakery or the pubs that he busked outside. How much better it would be if there was a plaque with his name on it so that everybody could know about this!|One of those pubs I mentioned, The Prince of Wales is now a Tesco Express. It’s a very old building and will survive the changes all around it. Part of it extends seductively behind the main shopfront, beckoning people towards the stadium and the road called Summerstown where the Felds lived. Its overlooked by a terrace with a rather ornate balustrade, adding a nice touch of theatricals. It seems like a great place for a plaque and that’s where we would like to put it. But we need Tesco to agree so are waiting to hear from them. The above visual was created to show them what we would like to do and the words on it have not yet been finalised.|We would love any fans of Marc to come to Summerstown, to visit the area where he spent his early teenage years. The place where he morphed from Mark Feld to Marc Bolan and set out on his path to stardom. We are now planning a ‘Marc Bolan Teenage Dream’ tour. It will happen in mid-September around the time of Marc’s death when a lot of fans often come to London. We’ll meet at Tooting Broadway tube station and I’ll walk everybody round and introduce the to some key locations. There’s a lot of history here, Marc may not have played at the famous Tooting Granada venue, now a bingo hall, but he was around when The Beatles were there in 1963 and he saw The Rolling Stones there the following year.|At the dawn of the age when people were wearing flowers in their hair, I feel sure that Marc would have appreciated our connection with the daffodil. We’ll walk about a mile or so to Summerstown, passing the site of the old nurseries where Peter Barr ‘The Daffodil King’ cultivated the nation’s favourite flower. We celebrated him with a plaque recently and a campaign called ‘Blooming Tooting’ has encouraged people to plant bulbs. Even if we are still living under restrictions, there will be a self-guided walking tour available to download. That’s what I’ve been doing with all my local history walks, with people using them as their lockdown exercise breaks. You can find all the information here|https://summerstown182.wordpress.com|We may not be able to put up the plaque as planned due to the current pandemic but we would however like to give Marc Bolan fans the opportunity to contribute to making it happen. If lots of people chip in small amounts then we can all say we were part of it. As soon as we know we have permission, we will publicise the fact and set a Crowdfunder up and try to raise the £500 needed. If normal life has returned, we will try to create an event around the unveiling, as we have done in the past. Some speakers, a poetry recital, maybe even a bit of music up on that terrace. We will of course need a special person to do the unveiling. Who could that be? All suggestions are welcome! We would naturally be delighted if any of Marc’s family were able to be involved or attend.|I’m very grateful to a local musician called Jack Hardman who approached me a few months ago pointing out that Marc’s connection to the area is still largely unknown. We’ve decided now is the time to really do something. 2021 seems like an appropriate moment, half a century on from those first unforgettable T.Rex Number Ones, not to mention the significant ‘Electric Warrior’ anniversary and the disappearance of those Summerstown prefabs! The old ‘Prince of Wales’ pub is in a prominent place on a roundabout at the junction of the very busy Garratt Lane. A plaque would be seen by so many people, not least all the football fans going to the new stadium. As local residents, it will be a further reason for us to take pride in the area where we live and encourage future generations to have an awareness and appreciation of Marc’s music.|We intend to keep everyone notified about how this idea progresses but I wanted Marc’s fans all over the world to know that there is another special place, here in a little corner of south west London where his legacy lives on. Whether there is a plaque to look at or not, I really hope you will come to visit and perhaps participate in the proposed ‘Teenage Dream Tour’. In one of his best-known songs, Marc asked ‘Whatever Happened to the Teenage Dream?’ Let me tell you everybody, it is here in Summerstown and ‘Blooming Tooting’ and we can’t wait to share it with you. FLOWER TO THE PEOPLE!|Look out for ‘Marc Bolan’s Tooting Teenage Dream’ Summerstown182 Zoom Talk, happening 7pm, Thursday 25 March. Thanks to everyone on local social media sites whose members contributed their recollections; including ‘I Grew Up in Tooting’. ‘Tooting History Group’, ‘Earlsfield in the 70s/80s’. Mark Paytress’ book|‘Twentieth Century Boy – The Marc Bolan Story’|gives great insights into his time in Summerstown. The ‘Palaces For The People’ website has more about prefabs.|We particularly look forward to welcoming members of the Official Marc Bolan Fan Club to|‘|Blooming Tooting|’|!|Share this:|Twitter|Facebook|Like this:|Like|Loading...|Related|Bookmark the|permalink|.|Post navigation|←|Flower to the People|Toots Musical Roots|→|Leave a Reply|Cancel reply|Enter your comment here...|Fill in your details below or click an icon to log in:|Email|(required)|(Address never made public)|Name|(required)|Website|You are commenting using your WordPress.com account.|(|Log Out|/|Change|)|You are commenting using your Facebook account.|(|Log Out|/|Change|)|Cancel|Connecting to %s|Notify me of new comments via email.|Notify me of new posts via email.|Δ|Search|Recent Posts|476 Garratt Lane|Rollissons Tooting Nursery|The Corruganza Boxmakers|Totterdown Fields Forever|The People of Wardley Street|Follow us on Twitter|My Tweets|Archives|May 2023|March 2023|February 2023|April 2022|June 2021|January 2021|September 2020|July 2020|February 2020|December 2019|September 2019|August 2019|June 2019|March 2019|December 2018|July 2018|June 2018|May 2018|April 2018|March 2018|February 2018|January 2018|December 2017|November 2017|October 2017|September 2017|August 2017|July 2017|June 2017|May 2017|April 2017|March 2017|February 2017|January 2017|December 2016|November 2016|October 2016|September 2016|July 2016|June 2016|May 2016|April 2016|March 2016|February 2016|January 2016|December 2015|November 2015|October 2015|September 2015|August 2015|July 2015|June 2015|May 2015|April 2015|March 2015|February 2015|January 2015|December 2014|November 2014|October 2014|September 2014|August 2014|July 2014|June 2014|May 2014|April 2014|March 2014|February 2014|January 2014|December 2013|Categories|Uncategorized|Meta|Register|Log in|Entries feed|Comments feed|WordPress.com|Recent Comments|The Daffodil King of…|on|The Day of The Daffodil|Mr. C. Knight on|The Jewel in the Crown|Joe Caudle on|The Bootmaker’s Boy|Bill Harding|on|Lavender and Gunpowder|Jane on|The Daffodil King|Create a free website at WordPress.com.|Follow|Following|Summerstown182|Join 89 other followers|Sign me up|Already have a WordPress.com account?|Log in now.|Summerstown182|Customize|Follow|Following|Sign up|Log in|Copy shortlink|Report this content|View post in Reader|Manage subscriptions|Collapse this bar|Loading Comments...|Write a Comment...|Email (Required)|Name (Required)|Website|%d|bloggers like this:",
          "|.  By the time Mark arrived they were all still there, and are still here today! Some of the allotments have been converted to sewage treatment works and a strip of car showrooms, warehouses and light industry are dissected by an intimidating procession of electricity pylons. It",
          "|s all a very long way from Carnaby Street and Stoke Newington, but this is where the Feld family; Sid, Phyllis, Harry and Mark came to live in the early sixties.",
          "|Their prefab was on a road running alongside the famous Wimbledon Greyhound Stadium where dog racing and speedway were still attracting huge crowds. The local glamour boys at the time were the speedway stars who rode for the Wimbledon Dons. Its unlikely that the thirteen year old Marc was impressed. Their home might have been brand new, with fitted furniture and TV, but being rehoused on the other side of London away from all his friends would have been a huge shock. There’s a certain vibe around here that I feel must have helped kickstart his teenage dream – driving a van, flipping burgers or going to the dog track was definitely a world he needed to get away from. Having said that, the sport crowds might have meant good opportunities for busking, as was the proximity of a cluster of local pubs; The Prince of Wales, The White Lion, The Corner Pin and The Plough, all literally minutes from his front door. According to Mark Paytress, author of",
          "|after leaving school, the teenage dreamer spent a lot of time kicking-back on his own in that prefab – reading, listening to music and planning his escape route whilst the rest of the family were at work. Sid drove a delivery van for the nearby Airfix factory which made model aeroplane kits. Phyllis gave up her job on a fruit stall at Berwick Street market and now worked for the Post Office Savings Bank at Olympia. Brother Harry, with whom he now shared a bedroom had an office job in Wardour Street.|Over the last seven or eight years I’ve been promoting local history in this area. A great way of doing that is by putting up plaques which are paid for by donations from people who come on my regular guided walks. We called our project ‘Summerstown182’ because the first thing we did was research 182 names on a local First World War memorial. About 25 of them lived in the road into which the Felds moved; indeed many of their relatives were still around. A hugely popular topic on the walks has been Marc’s connection with the area. The prefabs are long gone but I alway liked to stop close to the site of his home to talk about him. The Felds new residence was a highly-desirable Scandinavian-designed ‘Sun Cottage’ prefab. Described in the blurb as|‘20 by 18 feet, containing a lounge, two bedrooms, kitchen, bathroom and all fixtures, fittings and furniture’|. Mark Paytress wrote that it was like|‘a luxury caravan with a pointed roof’|. Wandsworth Council put sixteen of them up on a site opposite the stadium in 1961. From the mid to late sixties Marc pulled away from the area as he got deeper into the music, drawn to the clubs and boutiques in the West End. It was still very much his family home though and ‘Wimbledon 0697’ was the prefab telephone number used by Marc in July 1967 in an advert in Melody Maker to recruit for his new band ‘Tyrannosaurus Rex’. It was also where payment was sent by the BBC the following year after an appearance on John Peel’s ‘Top Gear’ show.|The family connection would however continue for some years. An electoral roll from 1970 shows his parents, Simeon (Sid) and Phyllis still there, at No27 Summerstown, their younger son on the cusp of international fame. They moved a few miles up the road to live on the Ashburton estate in Putney where Sid worked as a caretaker. Marc later bought a property nearby at 142 Upper Richmond Road which was where he and Gloria were driving on the fateful night when he was killed, 16th September 1977.|I’ve met a number of people on my walks who remembered Mark Feld from his early Summerstown days. It was a long time ago, but one person recalled|‘my cousin practising with him at my Auntie’s house on Headworth Street’|. Someone did his Mum’s hair in the salon on Aboyne Road. Others spoke of a very well-dressed young man buying cakes in Carter’s bakery. He had a swagger and was often seen with a guitar slung over his shoulder. People reminisce about his brief time at Hillcroft School (now Ernest Bevin College) on local social media, where he appears to have been one of the first Mods. John Ford, who went on to form The Strawbs and have some big hits himself recalls being in the same leaving year there as Mark in 1963 and hanging out at his home in Summerstown.|Another old friend mentioned him being part of a teen band called ‘The Cabinet’. They practised in the youth club at Tranmere Road School (now Earlsfield Primary). Friday night there was ‘Record Night’ and there were regular Sunday morning sessions outside the prefab jamming old Elvis numbers. They performed at wedding receptions on Henry Prince Estate.|‘We got paid about a fiver and all the beer we could drink’.|Occasionally they went to a jazz club in the Surrey Tavern pub at the top of Burntwood Lane. Mark’s part-time jobs included washing dishes at the well-loved Wimpy burger bar and a brief stint at Edgar’s menswear shop near Tooting Broadway. Mark Paytress recounts a visit to the local labour exchange ended up with Mark filling in a form stating his profession as ‘a poet’. Quite a few people refer to his modelling and the fact he was always very well-turned out.|He had been featured in an article about the emerging Mod scene in ‘Town’ magazine and must have relished the fact that Tooting was full of tailors shops at the time. His friends recall Mark buying a pair of jodphurs from a riding and saddlery shop on Garratt Lane called Rawle & Son. Its very fondly recollected for having a life-size model of a horse in the window. The boots would have helped with the modelling which was his main source of income around the age of 15. Occasional work with some very well known clothing chains included John Temple and even an appearance in a Littlewoods catalogue. He is remembered as being generous with his clothing, often giving any spare gear to his friends.|Another local memory recalls Mark buying a guitar at ‘The Treasure Chest’- an ‘aladdin’s cave’ run by an eccentric Dutch wheeler-dealer known as ‘The Maniac’. Somewhere that might have been passed on the way to school, it set the pulses of local youths racing – as well as musical equipment, selling ‘air-guns, catapults and harpoons’. Its now a grocery store opposite the Tooting Islamic Centre.|He read avidly, Tolkien, Rimbaud, C.S. Lewis and the mystic poetry of Kahlil Gibran. Second hand bookshops were dotted around Tooting Broadway like the one beside the pie and mash shop on Selkirk Road.  When Andy Ellison visited the prefab to have a chat about Marc joining ‘John’s Children’ he recalled him reading a copy of ‘The Tin Drum’ by Gunter Grass. He also served up mushrooms on toast.|I’ve been talking about Marc quite a lot on my walks and would probably have tried organising a plaque for him some years ago were it not for a huge redevelopment in this neighbourhood. The old greyhound stadium site opposite where the Felds lived was demolished a few years ago, the site was flattened and is now being transformed into an enormous housing development cradling a new football stadium which has been up and running since November. It’s a fairytale return to the area for AFC Wimbledon who have been exiled for almost thirty years and though he might not have been much of a sports fan, Marc would surely have appreciated the romance. The pub buildings are all still hanging in there, though in different guises; a tile warehouse, a flooring shop and a supermarket. The Corner Pin is the last great survivor, still doing what it says on the tin and joined by a relatively new kid on the block, a very successful micro-brewery called By the Horns.|There is a photo on the ‘Palaces for the People’ Facebook group which is believed to be the Feld prefab. The location would appear to be about half way down the road called Summerstown and very close to the By the Horns brewery. There’s another very good aerial photo of these dwellings alongside the stadium on the cover of a Wimbledon speedway programme. Apparently the Feld homestead was in the middle of the front row. The Sun Cottages disappeared in the early seventies at about the same time as Marc was storming the pop charts. They’ve been replaced by a string of light industrial units which may not last much longer themselves. Its an odd collection; a carpet shop, a car repair unit and somewhere that makes sash windows, rubbing alongside the hipster brewery. Although all has changed quite drastically, I feel the spirit of Marc hangs over this area, never more vividly than on the night of 16 September 2017, the fortieth anniversary of Marc’s death. I had a word with the DJ who had his decks set up outside The Horns and as the pink sun sank over the old dog track, we raised a glass of Hopadelic to the sound of ‘Solid Gold, Easy Action’. I often think about him when I go past that bakery or the pubs that he busked outside. How much better it would be if there was a plaque with his name on it so that everybody could know about this!|One of those pubs I mentioned, The Prince of Wales is now a Tesco Express. It’s a very old building and will survive the changes all around it. Part of it extends seductively behind the main shopfront, beckoning people towards the stadium and the road called Summerstown where the Felds lived. Its overlooked by a terrace with a rather ornate balustrade, adding a nice touch of theatricals. It seems like a great place for a plaque and that’s where we would like to put it. But we need Tesco to agree so are waiting to hear from them. The above visual was created to show them what we would like to do and the words on it have not yet been finalised.|We would love any fans of Marc to come to Summerstown, to visit the area where he spent his early teenage years. The place where he morphed from Mark Feld to Marc Bolan and set out on his path to stardom. We are now planning a ‘Marc Bolan Teenage Dream’ tour. It will happen in mid-September around the time of Marc’s death when a lot of fans often come to London. We’ll meet at Tooting Broadway tube station and I’ll walk everybody round and introduce the to some key locations. There’s a lot of history here, Marc may not have played at the famous Tooting Granada venue, now a bingo hall, but he was around when The Beatles were there in 1963 and he saw The Rolling Stones there the following year.|At the dawn of the age when people were wearing flowers in their hair, I feel sure that Marc would have appreciated our connection with the daffodil. We’ll walk about a mile or so to Summerstown, passing the site of the old nurseries where Peter Barr ‘The Daffodil King’ cultivated the nation’s favourite flower. We celebrated him with a plaque recently and a campaign called ‘Blooming Tooting’ has encouraged people to plant bulbs. Even if we are still living under restrictions, there will be a self-guided walking tour available to download. That’s what I’ve been doing with all my local history walks, with people using them as their lockdown exercise breaks. You can find all the information here|https://summerstown182.wordpress.com|We may not be able to put up the plaque as planned due to the current pandemic but we would however like to give Marc Bolan fans the opportunity to contribute to making it happen. If lots of people chip in small amounts then we can all say we were part of it. As soon as we know we have permission, we will publicise the fact and set a Crowdfunder up and try to raise the £500 needed. If normal life has returned, we will try to create an event around the unveiling, as we have done in the past. Some speakers, a poetry recital, maybe even a bit of music up on that terrace. We will of course need a special person to do the unveiling. Who could that be? All suggestions are welcome! We would naturally be delighted if any of Marc’s family were able to be involved or attend.|I’m very grateful to a local musician called Jack Hardman who approached me a few months ago pointing out that Marc’s connection to the area is still largely unknown. We’ve decided now is the time to really do something. 2021 seems like an appropriate moment, half a century on from those first unforgettable T.Rex Number Ones, not to mention the significant ‘Electric Warrior’ anniversary and the disappearance of those Summerstown prefabs! The old ‘Prince of Wales’ pub is in a prominent place on a roundabout at the junction of the very busy Garratt Lane. A plaque would be seen by so many people, not least all the football fans going to the new stadium. As local residents, it will be a further reason for us to take pride in the area where we live and encourage future generations to have an awareness and appreciation of Marc’s music.|We intend to keep everyone notified about how this idea progresses but I wanted Marc’s fans all over the world to know that there is another special place, here in a little corner of south west London where his legacy lives on. Whether there is a plaque to look at or not, I really hope you will come to visit and perhaps participate in the proposed ‘Teenage Dream Tour’. In one of his best-known songs, Marc asked ‘Whatever Happened to the Teenage Dream?’ Let me tell you everybody, it is here in Summerstown and ‘Blooming Tooting’ and we can’t wait to share it with you. FLOWER TO THE PEOPLE!|Look out for ‘Marc Bolan’s Tooting Teenage Dream’ Summerstown182 Zoom Talk, happening 7pm, Thursday 25 March. Thanks to everyone on local social media sites whose members contributed their recollections; including ‘I Grew Up in Tooting’. ‘Tooting History Group’, ‘Earlsfield in the 70s/80s’. Mark Paytress’ book|‘Twentieth Century Boy – The Marc Bolan Story’|gives great insights into his time in Summerstown. The ‘Palaces For The People’ website has more about prefabs.|We particularly look forward to welcoming members of the Official Marc Bolan Fan Club to|‘|Blooming Tooting|’|!|Share this:|Twitter|Facebook|Like this:|Like|Loading...|Related|Bookmark the|permalink|.|Post navigation|←|Flower to the People|Toots Musical Roots|→|Leave a Reply|Cancel reply|Enter your comment here...|Fill in your details below or click an icon to log in:|Email|(required)|(Address never made public)|Name|(required)|Website|You are commenting using your WordPress.com account.|(|Log Out|/|Change|)|You are commenting using your Facebook account.|(|Log Out|/|Change|)|Cancel|Connecting to %s|Notify me of new comments via email.|Notify me of new posts via email.|Δ|Search|Recent Posts|476 Garratt Lane|Rollissons Tooting Nursery|The Corruganza Boxmakers|Totterdown Fields Forever|The People of Wardley Street|Follow us on Twitter|My Tweets|Archives|May 2023|March 2023|February 2023|April 2022|June 2021|January 2021|September 2020|July 2020|February 2020|December 2019|September 2019|August 2019|June 2019|March 2019|December 2018|July 2018|June 2018|May 2018|April 2018|March 2018|February 2018|January 2018|December 2017|November 2017|October 2017|September 2017|August 2017|July 2017|June 2017|May 2017|April 2017|March 2017|February 2017|January 2017|December 2016|November 2016|October 2016|September 2016|July 2016|June 2016|May 2016|April 2016|March 2016|February 2016|January 2016|December 2015|November 2015|October 2015|September 2015|August 2015|July 2015|June 2015|May 2015|April 2015|March 2015|February 2015|January 2015|December 2014|November 2014|October 2014|September 2014|August 2014|July 2014|June 2014|May 2014|April 2014|March 2014|February 2014|January 2014|December 2013|Categories|Uncategorized|Meta|Register|Log in|Entries feed|Comments feed|WordPress.com|Recent Comments|The Daffodil King of…|on|The Day of The Daffodil|Mr. C. Knight on|The Jewel in the Crown|Joe Caudle on|The Bootmaker’s Boy|Bill Harding|on|Lavender and Gunpowder|Jane on|The Daffodil King|Create a free website at WordPress.com.|Follow|Following|Summerstown182|Join 89 other followers|Sign me up|Already have a WordPress.com account?|Log in now.|Summerstown182|Customize|Follow|Following|Sign up|Log in|Copy shortlink|Report this content|View post in Reader|Manage subscriptions|Collapse this bar|Loading Comments...|Write a Comment...|Email (Required)|Name (Required)|Website|%d|bloggers like this:",
          "Abuse — WordPress.com|WordPress.com|Menu|Features|Themes|Plans|Blog|Support|Sign Up|Log In|Report Content on WordPress.com|We strongly believe in freedom of speech. The WordPress.com community is spread across many cultures, countries, and backgrounds with varying values, and our service is designed to let people publish ideas and opinions without us censoring or endorsing them. But if you find a site on WordPress.com that you feel violates our|User Guidelines|or|Terms of Service|, please let us know.|I would like to report…|“https://summerstown182.wordpress.com/2021/01/18/marc-bolans-teenage-dream/”|Abuse|Abusive content, harassment, and defamation.|Privacy|Concerns about my private information.|Person at Risk|A person at imminent risk of death or severe physical harm.|Regulated Material|The sale of prohibited or highly regulated items. Gambling and explicit material.|Technological Harm|Malware, spyware, adware etc. Phishing. Spam or machine-generated content.|Legal|Copyright and Trademark infringement.|Get Started|Create your own website|Products|WordPress Hosting|Domain Names|Website Builder|Create a Blog|Professional Email|P2: WordPress for Teams|Enterprise Solutions|Website Design Services|Features|Overview|WordPress Themes|WordPress Plugins|Google Apps|Resources|WordPress.com Support|WordPress Forums|WordPress News|Website Building Tips|Business Name Generator|Logo Maker|Popular Topics|Daily Webinars|Learn WordPress|Developer Resources|Company|About|Partners|Press|Terms of Service|Privacy Policy|Do Not Sell or Share My Personal Information|Privacy Notice for California Users|An|Automattic|Creation",
          "|.  By the time Mark arrived they were all still there, and are still here today! Some of the allotments have been converted to sewage treatment works and a strip of car showrooms, warehouses and light industry are dissected by an intimidating procession of electricity pylons. It",
          "|s all a very long way from Carnaby Street and Stoke Newington, but this is where the Feld family; Sid, Phyllis, Harry and Mark came to live in the early sixties.",
          "|Their prefab was on a road running alongside the famous Wimbledon Greyhound Stadium where dog racing and speedway were still attracting huge crowds. The local glamour boys at the time were the speedway stars who rode for the Wimbledon Dons. Its unlikely that the thirteen year old Marc was impressed. Their home might have been brand new, with fitted furniture and TV, but being rehoused on the other side of London away from all his friends would have been a huge shock. There’s a certain vibe around here that I feel must have helped kickstart his teenage dream – driving a van, flipping burgers or going to the dog track was definitely a world he needed to get away from. Having said that, the sport crowds might have meant good opportunities for busking, as was the proximity of a cluster of local pubs; The Prince of Wales, The White Lion, The Corner Pin and The Plough, all literally minutes from his front door. According to Mark Paytress, author of",
          "|after leaving school, the teenage dreamer spent a lot of time kicking-back on his own in that prefab – reading, listening to music and planning his escape route whilst the rest of the family were at work. Sid drove a delivery van for the nearby Airfix factory which made model aeroplane kits. Phyllis gave up her job on a fruit stall at Berwick Street market and now worked for the Post Office Savings Bank at Olympia. Brother Harry, with whom he now shared a bedroom had an office job in Wardour Street.|Over the last seven or eight years I’ve been promoting local history in this area. A great way of doing that is by putting up plaques which are paid for by donations from people who come on my regular guided walks. We called our project ‘Summerstown182’ because the first thing we did was research 182 names on a local First World War memorial. About 25 of them lived in the road into which the Felds moved; indeed many of their relatives were still around. A hugely popular topic on the walks has been Marc’s connection with the area. The prefabs are long gone but I alway liked to stop close to the site of his home to talk about him. The Felds new residence was a highly-desirable Scandinavian-designed ‘Sun Cottage’ prefab. Described in the blurb as|‘20 by 18 feet, containing a lounge, two bedrooms, kitchen, bathroom and all fixtures, fittings and furniture’|. Mark Paytress wrote that it was like|‘a luxury caravan with a pointed roof’|. Wandsworth Council put sixteen of them up on a site opposite the stadium in 1961. From the mid to late sixties Marc pulled away from the area as he got deeper into the music, drawn to the clubs and boutiques in the West End. It was still very much his family home though and ‘Wimbledon 0697’ was the prefab telephone number used by Marc in July 1967 in an advert in Melody Maker to recruit for his new band ‘Tyrannosaurus Rex’. It was also where payment was sent by the BBC the following year after an appearance on John Peel’s ‘Top Gear’ show.|The family connection would however continue for some years. An electoral roll from 1970 shows his parents, Simeon (Sid) and Phyllis still there, at No27 Summerstown, their younger son on the cusp of international fame. They moved a few miles up the road to live on the Ashburton estate in Putney where Sid worked as a caretaker. Marc later bought a property nearby at 142 Upper Richmond Road which was where he and Gloria were driving on the fateful night when he was killed, 16th September 1977.|I’ve met a number of people on my walks who remembered Mark Feld from his early Summerstown days. It was a long time ago, but one person recalled|‘my cousin practising with him at my Auntie’s house on Headworth Street’|. Someone did his Mum’s hair in the salon on Aboyne Road. Others spoke of a very well-dressed young man buying cakes in Carter’s bakery. He had a swagger and was often seen with a guitar slung over his shoulder. People reminisce about his brief time at Hillcroft School (now Ernest Bevin College) on local social media, where he appears to have been one of the first Mods. John Ford, who went on to form The Strawbs and have some big hits himself recalls being in the same leaving year there as Mark in 1963 and hanging out at his home in Summerstown.|Another old friend mentioned him being part of a teen band called ‘The Cabinet’. They practised in the youth club at Tranmere Road School (now Earlsfield Primary). Friday night there was ‘Record Night’ and there were regular Sunday morning sessions outside the prefab jamming old Elvis numbers. They performed at wedding receptions on Henry Prince Estate.|‘We got paid about a fiver and all the beer we could drink’.|Occasionally they went to a jazz club in the Surrey Tavern pub at the top of Burntwood Lane. Mark’s part-time jobs included washing dishes at the well-loved Wimpy burger bar and a brief stint at Edgar’s menswear shop near Tooting Broadway. Mark Paytress recounts a visit to the local labour exchange ended up with Mark filling in a form stating his profession as ‘a poet’. Quite a few people refer to his modelling and the fact he was always very well-turned out.|He had been featured in an article about the emerging Mod scene in ‘Town’ magazine and must have relished the fact that Tooting was full of tailors shops at the time. His friends recall Mark buying a pair of jodphurs from a riding and saddlery shop on Garratt Lane called Rawle & Son. Its very fondly recollected for having a life-size model of a horse in the window. The boots would have helped with the modelling which was his main source of income around the age of 15. Occasional work with some very well known clothing chains included John Temple and even an appearance in a Littlewoods catalogue. He is remembered as being generous with his clothing, often giving any spare gear to his friends.|Another local memory recalls Mark buying a guitar at ‘The Treasure Chest’- an ‘aladdin’s cave’ run by an eccentric Dutch wheeler-dealer known as ‘The Maniac’. Somewhere that might have been passed on the way to school, it set the pulses of local youths racing – as well as musical equipment, selling ‘air-guns, catapults and harpoons’. Its now a grocery store opposite the Tooting Islamic Centre.|He read avidly, Tolkien, Rimbaud, C.S. Lewis and the mystic poetry of Kahlil Gibran. Second hand bookshops were dotted around Tooting Broadway like the one beside the pie and mash shop on Selkirk Road.  When Andy Ellison visited the prefab to have a chat about Marc joining ‘John’s Children’ he recalled him reading a copy of ‘The Tin Drum’ by Gunter Grass. He also served up mushrooms on toast.|I’ve been talking about Marc quite a lot on my walks and would probably have tried organising a plaque for him some years ago were it not for a huge redevelopment in this neighbourhood. The old greyhound stadium site opposite where the Felds lived was demolished a few years ago, the site was flattened and is now being transformed into an enormous housing development cradling a new football stadium which has been up and running since November. It’s a fairytale return to the area for AFC Wimbledon who have been exiled for almost thirty years and though he might not have been much of a sports fan, Marc would surely have appreciated the romance. The pub buildings are all still hanging in there, though in different guises; a tile warehouse, a flooring shop and a supermarket. The Corner Pin is the last great survivor, still doing what it says on the tin and joined by a relatively new kid on the block, a very successful micro-brewery called By the Horns.|There is a photo on the ‘Palaces for the People’ Facebook group which is believed to be the Feld prefab. The location would appear to be about half way down the road called Summerstown and very close to the By the Horns brewery. There’s another very good aerial photo of these dwellings alongside the stadium on the cover of a Wimbledon speedway programme. Apparently the Feld homestead was in the middle of the front row. The Sun Cottages disappeared in the early seventies at about the same time as Marc was storming the pop charts. They’ve been replaced by a string of light industrial units which may not last much longer themselves. Its an odd collection; a carpet shop, a car repair unit and somewhere that makes sash windows, rubbing alongside the hipster brewery. Although all has changed quite drastically, I feel the spirit of Marc hangs over this area, never more vividly than on the night of 16 September 2017, the fortieth anniversary of Marc’s death. I had a word with the DJ who had his decks set up outside The Horns and as the pink sun sank over the old dog track, we raised a glass of Hopadelic to the sound of ‘Solid Gold, Easy Action’. I often think about him when I go past that bakery or the pubs that he busked outside. How much better it would be if there was a plaque with his name on it so that everybody could know about this!|One of those pubs I mentioned, The Prince of Wales is now a Tesco Express. It’s a very old building and will survive the changes all around it. Part of it extends seductively behind the main shopfront, beckoning people towards the stadium and the road called Summerstown where the Felds lived. Its overlooked by a terrace with a rather ornate balustrade, adding a nice touch of theatricals. It seems like a great place for a plaque and that’s where we would like to put it. But we need Tesco to agree so are waiting to hear from them. The above visual was created to show them what we would like to do and the words on it have not yet been finalised.|We would love any fans of Marc to come to Summerstown, to visit the area where he spent his early teenage years. The place where he morphed from Mark Feld to Marc Bolan and set out on his path to stardom. We are now planning a ‘Marc Bolan Teenage Dream’ tour. It will happen in mid-September around the time of Marc’s death when a lot of fans often come to London. We’ll meet at Tooting Broadway tube station and I’ll walk everybody round and introduce the to some key locations. There’s a lot of history here, Marc may not have played at the famous Tooting Granada venue, now a bingo hall, but he was around when The Beatles were there in 1963 and he saw The Rolling Stones there the following year.|At the dawn of the age when people were wearing flowers in their hair, I feel sure that Marc would have appreciated our connection with the daffodil. We’ll walk about a mile or so to Summerstown, passing the site of the old nurseries where Peter Barr ‘The Daffodil King’ cultivated the nation’s favourite flower. We celebrated him with a plaque recently and a campaign called ‘Blooming Tooting’ has encouraged people to plant bulbs. Even if we are still living under restrictions, there will be a self-guided walking tour available to download. That’s what I’ve been doing with all my local history walks, with people using them as their lockdown exercise breaks. You can find all the information here|https://summerstown182.wordpress.com|We may not be able to put up the plaque as planned due to the current pandemic but we would however like to give Marc Bolan fans the opportunity to contribute to making it happen. If lots of people chip in small amounts then we can all say we were part of it. As soon as we know we have permission, we will publicise the fact and set a Crowdfunder up and try to raise the £500 needed. If normal life has returned, we will try to create an event around the unveiling, as we have done in the past. Some speakers, a poetry recital, maybe even a bit of music up on that terrace. We will of course need a special person to do the unveiling. Who could that be? All suggestions are welcome! We would naturally be delighted if any of Marc’s family were able to be involved or attend.|I’m very grateful to a local musician called Jack Hardman who approached me a few months ago pointing out that Marc’s connection to the area is still largely unknown. We’ve decided now is the time to really do something. 2021 seems like an appropriate moment, half a century on from those first unforgettable T.Rex Number Ones, not to mention the significant ‘Electric Warrior’ anniversary and the disappearance of those Summerstown prefabs! The old ‘Prince of Wales’ pub is in a prominent place on a roundabout at the junction of the very busy Garratt Lane. A plaque would be seen by so many people, not least all the football fans going to the new stadium. As local residents, it will be a further reason for us to take pride in the area where we live and encourage future generations to have an awareness and appreciation of Marc’s music.|We intend to keep everyone notified about how this idea progresses but I wanted Marc’s fans all over the world to know that there is another special place, here in a little corner of south west London where his legacy lives on. Whether there is a plaque to look at or not, I really hope you will come to visit and perhaps participate in the proposed ‘Teenage Dream Tour’. In one of his best-known songs, Marc asked ‘Whatever Happened to the Teenage Dream?’ Let me tell you everybody, it is here in Summerstown and ‘Blooming Tooting’ and we can’t wait to share it with you. FLOWER TO THE PEOPLE!|Look out for ‘Marc Bolan’s Tooting Teenage Dream’ Summerstown182 Zoom Talk, happening 7pm, Thursday 25 March. Thanks to everyone on local social media sites whose members contributed their recollections; including ‘I Grew Up in Tooting’. ‘Tooting History Group’, ‘Earlsfield in the 70s/80s’. Mark Paytress’ book|‘Twentieth Century Boy – The Marc Bolan Story’|gives great insights into his time in Summerstown. The ‘Palaces For The People’ website has more about prefabs.|We particularly look forward to welcoming members of the Official Marc Bolan Fan Club to|‘|Blooming Tooting|’|!|Share this:|Twitter|Facebook|Like this:|Like|Loading...|Related|Bookmark the|permalink|.|Post navigation|←|Flower to the People|Toots Musical Roots|→|Leave a Reply|Cancel reply|Enter your comment here...|Fill in your details below or click an icon to log in:|Email|(required)|(Address never made public)|Name|(required)|Website|You are commenting using your WordPress.com account.|(|Log Out|/|Change|)|You are commenting using your Facebook account.|(|Log Out|/|Change|)|Cancel|Connecting to %s|Notify me of new comments via email.|Notify me of new posts via email.|Δ|Search|Recent Posts|476 Garratt Lane|Rollissons Tooting Nursery|The Corruganza Boxmakers|Totterdown Fields Forever|The People of Wardley Street|Follow us on Twitter|My Tweets|Archives|May 2023|March 2023|February 2023|April 2022|June 2021|January 2021|September 2020|July 2020|February 2020|December 2019|September 2019|August 2019|June 2019|March 2019|December 2018|July 2018|June 2018|May 2018|April 2018|March 2018|February 2018|January 2018|December 2017|November 2017|October 2017|September 2017|August 2017|July 2017|June 2017|May 2017|April 2017|March 2017|February 2017|January 2017|December 2016|November 2016|October 2016|September 2016|July 2016|June 2016|May 2016|April 2016|March 2016|February 2016|January 2016|December 2015|November 2015|October 2015|September 2015|August 2015|July 2015|June 2015|May 2015|April 2015|March 2015|February 2015|January 2015|December 2014|November 2014|October 2014|September 2014|August 2014|July 2014|June 2014|May 2014|April 2014|March 2014|February 2014|January 2014|December 2013|Categories|Uncategorized|Meta|Register|Log in|Entries feed|Comments feed|WordPress.com|Recent Comments|The Daffodil King of…|on|The Day of The Daffodil|Mr. C. Knight on|The Jewel in the Crown|Joe Caudle on|The Bootmaker’s Boy|Bill Harding|on|Lavender and Gunpowder|Jane on|The Daffodil King|Create a free website at WordPress.com.|Follow|Following|Summerstown182|Join 89 other followers|Sign me up|Already have a WordPress.com account?|Log in now.|Summerstown182|Customize|Follow|Following|Sign up|Log in|Copy shortlink|Report this content|View post in Reader|Manage subscriptions|Collapse this bar|Loading Comments...|Write a Comment...|Email (Required)|Name (Required)|Website|%d|bloggers like this:"
        ],
        "image_links": [
          "https://summerstown182.files.wordpress.com/2021/01/memories-of-marc.jpg",
          "https://summerstown182.files.wordpress.com/2021/01/memories-of-marc.jpg",
          "https://summerstown182.files.wordpress.com/2021/01/memories-of-marc.jpg",
          "https://summerstown182.files.wordpress.com/2021/01/memories-of-marc.jpg",
          "https://summerstown182.files.wordpress.com/2021/01/memories-of-marc.jpg",
          "https://summerstown182.files.wordpress.com/2021/01/memories-of-marc.jpg",
          "https://summerstown182.files.wordpress.com/2021/01/memories-of-marc.jpg",
          "https://summerstown182.files.wordpress.com/2021/01/memories-of-marc.jpg"
        ]
      }
    }
  }
}