{
  "Marc Bolan": {
    "T Rex": {
      "https://www.bbc.co.uk/music/articles/e059d91d-1141-47e9-8c67-c779db4190b6": {
        "title": "6 things you possibly didn't know about Marc Bolan - BBC",
        "text": "15 Sept 2017 — It was 40 years ago on 16 September that Marc Bolan died in a car crash in southwest London at the appallingly young age of 29.",
        "google search terms": [
          "Stoke Newington",
          "T Rex",
          "Tyrannosaurus Rex",
          "Hackney",
          "Jewish"
        ],
        "image search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld",
          "Rolan",
          "Bolan",
          "Newington",
          "dyslexia",
          "Glam Rock",
          "Jewish",
          "songwriter"
        ],
        "page search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld"
        ],
        "page_text_snippets": [
          "40 years on: 6 things you possibly didn't know about Marc Bolan - BBC Music|Accessibility links|Accessibility Help|BBC iD|Notifications|BBC navigation|Home|Home|News|News|Sport|Weather|Shop|Earth|Travel|Capital|iPlayer|Culture|Autos|Future|TV|Radio|CBBC|CBeebies|Food|iWonder|Bitesize|Travel|Music|Earth|Arts|Make It Digital|Taster|Nature|Local|Tomorrow's World|Menu|Search the BBC|This page has been archived and is no longer updated.|Find out more about page archiving.|40 years on: 6 things you possibly didn't know about Marc Bolan|By Phil Hebblethwaite|Friday 15th September 2017|BBC Four - Marc Bolan: Cosmic Dancer|It was 40 years ago on 16 September that|Marc Bolan|died in a car crash in southwest London at the appallingly young age of 29. To mark the anniversary,|BBC Four|have made a new film,|Marc Bolan: Cosmic Dancer|(broadcast on 15 September), produced and directed by Jeremy Marre, and featuring new interviews with those who knew him best - his partner Gloria Jones, producer Tony Visconti and manager Simon Napier-Bell.|For the uninitiated, it reveals much about one of the UK's finest pop stars, and there's new insight to intrigue even the most hardcore Bolan fans. Here's what we learned...|BBC Four - Marc Bolan: Cosmic Dancer|1. Even as a child he slipped into invented characters|Marc Bolan, born Mark Feld in Hackney, London, always knew he was going to be a pop star, even when he was kid. He was fascinated by early rock'n'roll stars like|Eddie Cochran|,|Little Richard|and|Elvis|and says in the film, \"I always knew I was different - right from the start, right from the moment I was born. When I was younger, I certainly thought I was a kind of superior being.\"|Later, like|Bowie|, he became a master of reinvention - he was first a mod, then a hippyish singer-songwriter, before coming into full bloom as a glittering glam rock superstar. But we find out here that Marc's desire to invent characters for himself started far earlier - when he was a child. His brother, Harry, says: \"If Marc knew he was going to be in trouble - if someone picked on him - he'd take on a character that was stronger than the guy who was having a go at him. The character he would use for this bravado was Mighty Joe Young [from the 1949 fantasy film of the same name]. He dealt with life in his own mind.\"",
          "|Mark met manager Simon Napier-Bell in 1966, and they initially set about making Marc a star by promoting him a singer-songwriter in the mould of"
        ],
        "image_links": [
          "https://sa.bbc.co.uk/bbc/bbc/s?name=music.articles.40_years_on_6_things_you_possibly_didn_t_know_about_marc_bolan.e059d91d_1141_47e9_8c67_c779db4190b6.page&ml_name=webmodule&ml_version=-1&blq_js_enabled=0&blq_s=4d&blq_r=2.7&blq_v=default&blq_e=pal&app_name=music&prod_name=programmes&event_master_brand=bbc_music&page_type=article-mixed&bbc_site=music&article_id=e059d91d-1141-47e9-8c67-c779db4190b6&article_title=40+years+on%3A+6+things+you+possibly+didn%27t+know+about+Marc+Bolan&app_version=3.0.25&pal_route=articles_show&app_type=responsive&language=en-GB&pal_webapp=music_articles",
          "/music/articles/staticarchive/8b22cbb6bdc5fbab2d7d458db882fd7de5b249e6.jpg",
          "/music/articles/staticarchive/8b22cbb6bdc5fbab2d7d458db882fd7de5b249e6.jpg",
          "/music/articles/staticarchive/43a1aa7718971bc1a412c0b1bf3deefbf2d89174.jpg"
        ]
      }
    }
  }
}