{
  "Marc Bolan": {
    "Stoke Newington": {
      "http://knowledgeoflondon.com/marcbolan.html": {
        "title": "Marc Bolan London's First Glam-Rock Star",
        "text": "Marc Bolan was born Mark Feld on 30 September 1947, at 25a Stoke Newington Common, where he lived up until 1962 with his mother, Phyllis, who worked on a Soho ...",
        "google search terms": [
          "Stoke Newington",
          "T Rex",
          "Tyrannosaurus Rex",
          "Hackney",
          "Jewish"
        ],
        "image search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld",
          "Rolan",
          "Bolan",
          "Newington",
          "dyslexia",
          "Glam Rock",
          "Jewish",
          "songwriter"
        ],
        "page search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld"
        ],
        "page_text_snippets": [
          "London Famous | Marc Bolan London's First Glam-Rock Star|MENU|London Famous|Famous Residents #1|Famous Residents #2|London Foreigners|Music Hall Residents|London Homes|Canonbury House|Tin Pan Alley|Marc Bolan|George Orwell|Thomas Crapper|John Claudius Loudon|Charles Dickens in London|J.M.Barrie|Arthur Phillip|Sir Richard Burton|William Morris|Marc Bolan, London's First Glam-Rock Star|25a Stoke Newington Common|Marc Bolan was born Mark Feld on 30 September 1947, at 25a Stoke Newington Common, where he lived up until 1962 with his mother, Phyllis, who worked on a Soho fruit stall, (Marc would sometimes assist) and his father, Simeon, a lorry driver.|While attending Northwold School he played guitar in a group \"Susie and the Hoops\" alongside 12-year old vocalist Helen Shapiro, who found fame before Marc in early 1961 with her first hit \u0093Walking Back to Happiness\u0094. Marc left school as soon as he could in 1962 and about the same time moved from his Stoke Newington Common home. He briefly joined a modelling agency and became a \"John Temple Boy,\" appearing in a clothing catalogue for the menswear store.|His first stage name was Toby Tyler, which he took from a film of the same name, before he settled, sometime later, for Marc Bolan, Bolan coming from the first two and last three letters of his hero Bo(b) (Dy)lan|He is best known as the founder of the British rock band Tyrannosaurus Rex, which was later abbreviated to T. Rex. His music, as well as his highly original sense of style and extraordinary stage presence, helped create the glam rock era which made him one of the most recognizable stars in British rock music.|Marc was to spend his last night in Morton\u0092s bar and restaurant at Berkeley Square, along with his girlfriend Gloria Jones, who drove him home in her Mini 1275GT (registration FOX 661L). Marc never took a driving test or had a licence. He died instantly when Jones lost control of the car and it struck a sycamore tree after failing to negotiate a small humpback bridge near Gipsy Lane on Queens Ride, Barnes, in South West London at 5 a.m. on 16 September 1977."
        ],
        "image_links": [
          "/images/marcbolanhse.jpg",
          "http://knowledgeoflondon.com/cgi-bin/sitestats.gif?p=http%3A%2F%2Fknowledgeoflondon.com%2Fmarcbolan.html;r=-;"
        ]
      }
    }
  }
}