{
  "Marc Bolan": {
    "Stoke Newington": {
      "https://www.marc-bolan.net/biography/biography-1.html": {
        "title": "Marc Bolan - The Early Years",
        "text": "The family lived in flat in a terraced house at 25 Stoke Newington Common, Hackney (see right) and Marc lived there from his birth to the age of fourteen.",
        "google search terms": [
          "Stoke Newington",
          "T Rex",
          "Tyrannosaurus Rex",
          "Hackney",
          "Jewish"
        ],
        "image search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld",
          "Rolan",
          "Bolan",
          "Newington",
          "dyslexia",
          "Glam Rock",
          "Jewish",
          "songwriter"
        ],
        "page search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld"
        ],
        "page_text_snippets": [
          "|Although undertaking PhD research Fee Warner spent most of 1999 (from TAG's formation) designing, making and selling items such as T-Shirts, Bookmarcs and Badges to help pay for the project. She was helped by husband Kevin Warner and by both their children Rohan Marc (then aged eighteen) and Oscar (aged just Nine to Ten years old in 1999). Donations for the project came from many fans abroad.|1999 AUCTION:|In addition to producing items directly for sale some were specifically designed, and produced for an auction. Sadly, this was in the days before eBay had 'caught on' so only those in the room were generally able to bid which resulted in lower than hoped for prices. In September 1999, TAG|TM|held the auction of items including prints produced by TAG and signed by photographer Peter Sanders and artist George Underwood. Many tanx to Jim Ryder for arranging for them to be signed, although disappointingly many sold for around £10.00 each as the UK fans present were hoping for bargains and several people even tried to haggle over the price of set price items such as T-Shirts :-(|KEY AUCTION SALE ITEMS:|Two sets of framed contact prints, negatives and enlargements|were prepared, paid for by Fee Warner and donated to the auction to raise funds. These sold for over £300.00. The negatives were previously unpublished and were sold with copyright, having been gifted to Fee on one of her many visits to Marc Bolan's parents in 1977/78. Marc's mum disliked 'The Tree' wrongly blaming it for his death, however Marc's older brother Harry gave his approval for the project. Family approval was something, which Fee felt, was essential for this work to happen. The donation of these photographs was her way of returning to Marc something given to her by his mother Phyllis. Fee turned down the offer of Marc's clothing suggesting to Phyllis that she saved it for when Rolan was older. In that respect, Marc's mum was far too generous. Some years later one fan and her husband, who were gifted a jacket AND another item of clothing (as they weren't married at the time) refused to allow one of those items to be displayed behind glass and fully insured in a Museum so that all visitors to the museum would have been able to see it.|2000 - TAG LAID THE STEPS:|from the PRS Memorial to the 'Bolan Tree' with a viewing platform around the tree so visitors do not risk injury by standing on the pavement less & narrow road by the tree. TAG has also erected a notice board for messages & crucially|saved the 'Bolan Tree' from felling.|All this was achieved within four months of TAG receiving the Lease, although work to fund raise and deal with the 'red tape' meant that the key members of TAG had been working for TAG for a full year by the time the Tree was successfully saved in April, 2000.|2002 - 25th ANNIVERSARY - BRONZE BUST:|Rolan Bolan|unveiled a|Bronze Bust|of his father at the site to commemorate the|25th anniversary of Bolan's death|. This Bronze was paid for personally by Fee Warner.|2005: FIVE MEMORIAL PLAQUES|TAG once again sold fund raisers to raise the money needed to install plaques for the four members of T-Rex who like Marc, have passed over. They are:|Steve Peregrin Took|;|Steve Currie|;|Mickey Finn|&|Dino Dines|& a Memorial Plaque for|June Bolan|(nee Child) in recognition for her part in Marc's success.|2007 - 30th ANNIVERSARY:|TAG organised a Very Special & indeed Unique Event for its  Members|This was the First Ever|Marc Bolan Celebration|inside the Sacred Stone Circle of|Stonehenge|. This was part of a|Marc's Mystical Roots|trip where  Members retraced the steps of Marc and the late|John Peel|to the top of|Glastonbury Tor|, before dining in a private room at the|George and Pilgrims Inn|(the oldest Inn in the South West of England dating back to the 15th Century) before heading for the Exclusive, Private booking of Stonehenge where  Members were entertained by|Paul (T-Rex) Fenton|and|Rob Benson|of|T-Rex - A Celebration of Marc and Mickey|. A|Druid Ceremony|(|Wear a Tall Hat like the Druids|) was performed by|Stonehenge Arch Druid Rollo Maughfling|and|Hon. Glastonbury Order of Druids Arch Druidess Victoria Marsden|.|2009 - THE LAUNCH OF THE MARC BOLAN ROSE FUND:|The project to have a unique & new variety  of Rose named after Marc was launched by TAG. This is an ongoing project and it is hoped that the balance of the money needed to initiate the growing of the rose will be achieved by the end of 2012. How long it takes before the rose is on sale will depend on how quickly the rose crosses can be done to achieve the most pleasing result.|18th September 2009:|To Celebrate the 10th Anniversary of the formation of TAG as well as the 32nd Anniversary of Marc's Passing|MF's T-Rex|performed as part of a Benefit Celebration in the heart of London, at the 100 Club on Friday 18th September 2009.|2010:|Once again TAG continued to ensure the site was a suitable tribute to Marc Bolan and his band T-Rex with routine maintenance including topping up the bark chippings in the steps, replacing several of the railway sleepers which make up the steps and repainting the steps and notice board, because to main the site as though 'nothing has been done' requires work!|2011 KEEPING THE BOLAN TREE SAFE:|Pollarding the Tree which was undertaken in March, 2011 by Bob Knoakes and his team from|THE ORIGINAL TREE SURGEONS LIMITED|. Visit our Photo Galleries for Full Information with Photos and Videos.|2011 BULB PLANTING:|In late 2011 TAG will be planting a range of bulbs at the site on either side of the steps. Bulbs were planted in 1998 and TAG members Fee and Oscar Warner were two of the key people who undertook that work. However, the ground was not prepared and the bulbs were not planted correctly so that many did not achieve their potential. For this reason, the 2011 bulb planting will be accompanied by the preparation of proper 'bulb beds' because one perennial problem associated with the site is the fast drainage of the site due to the slope of the embankment. Therefore, moisture-retaining additives to the soil will be used to help with this problem.|2012:|We have planted the bulbs|*|and are delighted to say that the Marc Bolan Rose is now a reality for Marc's 35th Anniversary/Marc's 65th Birthday.|2013|The Marc Bolan Rose is now REAL and is on sale - exclusively from TAG for the UK and Europe. In Addition, the shrine featured in the BBC4 Series \"|PAGANS & PILGRIMS: BRITAINS HOLIEST PLACES|\". In addition to featuring in Episode four (of six) Marc's shrine featured in the opening sequence each week throughout the entire six week shedule.|2014|2014 saw the willful and purposeful murder of the Bolan Tree with poison by person(s) unknown.|* Unfortunately, two 'fans' visited the shrine several years later and 'tidied' the area on either side of the steps. They dug out a thick layer of soil, removing the majority of the bulbs TAG|TM|planted in 2012.|The Official Marc Bolan Rose|On a very positive note, the first batch of almost two hundred|Marc Bolan Rose Bushes|were available to fans and they completely Sold Out! These were only available 'bare rooted' which isn't ideal for those without any|green fingers|.|2015 - THE BOLAN TREE|The Key priority during the first part of 2015 was to make the site safe for visitors, passing motorists, cyclists and pedestrians.  The Bolan Tree was felled and a capping barrel was placed over the base of the Bolan Tree. On the 15th May 2015 T.Rex Action Group / TAG and the Logo were registered as Trademarks.|2016 to 2020:|Although the Bolan Tree was felled in 2015 Marc Bolan's Rock Shrine is so much more than the Tree. From the PRS Memorial unveiled in 1997, to the Memory Board and Steps added in 2000, through the Bronze Bust unveiled by Rolan Bolan in 2002 the site is Special and a place of pilgrimage to thousands of people from all over the world all-year-round.|2021:|VALENTINE'S DAY MASSACRE|: Saturday the 13|th|and Sunday 14|th|February 2021 saw the wholescale deversation of this \"|Very Special Corner|\"|*|of Barnes Common Conservation Area by Network Rail contractors. TAG was NOT notified. The local residents were notified that there would be  \"|cutting back overgrown vegetation that is obstructing the highway and felling dead, dying or diseased trees|\". Richmond Council permitted a road closure of Queen's Ride for that weekend for this work. The filming done by TAG shows that there was a clear need to remove the saplings which were growing on the narrow piece of land between the 'Armco crash barrier' and Queen's Ride. There is no dispute that this vegetation did need removing, as did the dead trees, However, no one knew what would be done and because it happened over a weekend it was impossible for anyone to contact Richmond Council's appropriate department to get one of their experts to visit and limit the damage. By the time Richmond Council's offices opened again on Monday 15|th|February 2021 it was too late.|*|Quoted in Richmond Council's own '|Cconservation Area Study|- Barnes Common No. 32 and Mill Hill No. 14|' pdf.|The Valentine's Day Massacre spured TAG on to apply to become a|Community Interest Company|(|CIC|)|On the 21st December 2021 TAG was Officially Granted CIC Status|This wonderfully happened on the|Winter Solstice 2021|. A Good Omen for the start of a New Year which happens after the three days of '|Solstice|' which means '|Sun Stands Still'|On the following day in Pagan Tradition the Sun begins to move again and is therefore 'Re-Born' and the Circle of the Year Begins afresh with the Newborn Sun.|What does becoming a Community Interest Company mean for TAG?|It means that|TAG has the appropriate Not-For-Profit aims to be a CIC|, which is effectively just a small step away from being what larger organisations can become - a fully Registered Charity and indeed you may have already noticed that TAG is listed on eBay as a Charity.  Now that TAG is Officially and Legally registered as a CIC, we can apply for funding from various organisations so that we can make Marc's Shrine a more Fitting Tribute to Marc Bolan and his band T.Rex as TAG 'Rev-Up' forwards Marc's 45th Anniversary on the 16th of September 2022 and his 50th Anniversary in 2027. This will include TAG's  new key projects.|One is to have electricity collected and having a CCTV system installed|which will live-stream Marc's Shrine around the Globe 24 hours a day, seven days a week for all the fans who cannot visit the site or cannot visit as open as they'd like to.|Part two on our agenda|is that because Marc Bolan's Rock Shrine is within the London Borough of Richmond-Upon-Thames'|Barnes Common Conservation Area'|and has been since 2002, when TAG applied for planning permission to install the Bronze Bust unveiled by Rolan Bolan at the shrine, we have a duty of care to manage the site carefully for the benefit of all - Marc Bolan and T.Rex Fans, Local Residents, the wider community of Richmond-Upon Thames, and the Worldwide fans who are now, more than ever discovering Marc Bolan through his band T.Rex's induction into the Rock 'N Roll Hall of Fame in America.|Therefore, TAG will establish and implement an appropriate management system as recommended in the Richmond Council '|biodiversity action plan|'. This project will require a mains water supply to be installed so that when we start our planting programme of appropriate trees and shrubs, they will have a far better chance of thriving, because buying saplings and shrubs or a substantial size are expensive investments. Increasing the biodiversity of the Flora, will create new enriched habitats for Native Fauna species to increase in number, something which is essential as we all see a decline in our Birds, Insects and Small Mammals.|As well as the profits from our fund-raising merchandise, and periodic donations from fans our newly gained 'Community Interest Company' status will mean we can apply for funding from appropriate bodies and organisations including The Arts Council, The Lottery Fund and locally based bodies and organisation.|TAG has some other ideas 'in the pipeline' which we'll let you know about when the time is right.|2022 and Onwards|:  2022 sees TAG|TM|CIC Celebrate our 23rd Anniversary.|On the 16th September 2022 it will be the 45th Anniversary of Marc Bolan's Spirit acending at the site.|TAG|TM|CIC has already raised some money to have a custom-made hand rail manufactured and fitted to one side of the steps to make the site safer for all visitors, especially the 'originals' who are, like Fee around or over 60-years-of-age now! Due to Covid-19 this will be installed in as soon as the local residents have given their approval of the design and goverment regulations allow in 2022.|TAG|TM|CIC will, continue to care for the site now|Officially Recognised|by the|English Tourist Board|as|'Marc Bolan's Rock Shrine'|& now as One of|Britain's Holiest Shrines|to keep it a fitting tribute.  TAG|TM|CIC will also add further Memorial Plaques, though we hope not for a long time!|WEB SITE DESCRIPTION|Regularly updated, massive site|with lots of information on all things Marc Bolan & T.Rex related. Free Illustrated Biography, Chart Positions, In the Free-to-all Marc Bolan and T.Rex Fan Club  Site you'll find articles, interviews, Photos, Pictures & Images in the Gallery Section, song books with lyrics, music & tabs, video/film footage (wmv & Div X mpegs), plus Music & Interview files as mp3's. Marc's Poetry Book \"Warlock of Love\" Transcripts. Scans of Marc Bolan Poetry, Newspaper Articles & News Clippings, Original 1970's Magazine Features & 'Specials' including \"Disco 45 Magazine\", \"Jackie\", \"Mirabelle\", Birth Certificates, Letters & other Documents. In All over 10 Gig of Bolantastic Info!Plus Screensavers & Desktops to download.|This site aims|to cover the whole period of Marc's career, from his earliest musical out-put, and into the fabulous time when Marc really got going when he & Steve Took formed Tyrannosaurus Rex in 1967, until his death on September 16th 1977 aged 29 years & fifty weeks when the Mini 1275 GT driven by his girlfriend Gloria Jones hit a sycamore tree & so many lives were changed by his death. Plus news of what's happening now including details of the first ever T-Rex Convention at the Cavern Club, Liverpool.|TAG|TM|CIC's Site also includes|Reviews & information on new & recent releases including the book 'Beneath the Wizard's Gown' by Tony Stringfellow, 'Inside T-Rex' Double DVD & Book, 'Children of the Revolution' double CD with music choices by Dr. Roberts, the Double DVD release of Marc Bolan & Ringo Starr's film 'Born to Boogie' featuring Catweazel (Cat Weazel), produced by Tony Visconti. Includes info on how to find the Easter Eggs, while the RIP Section includes details on people associated with Marc Bolan including Band Members plus Chelita Secunda (Chelita Salvatori), Photographer Keith Morris, Tony Secunda, Tony Howard, Alphi O'Leary, to name a few.|There is information on the T.Rex Action Group ( TAG|TM|CIC)|including the members, the lease on the site,  TAG|TM|CIC's project to care for the site, save the tree & the Bronze Bust unveiled by Rolan Bolan in 2002. The original wooden sculpture from which the Bronze Bust was cast was created by the talented artist, Jean Robillard of Quebec, Canada. Also now with Information, Photo Galleries & Video of the Memorial Plaques for Steve Took, Steve Currie, June Bolan (June Child), Mickey Finn & Dino Dines installed in 2005. Guests included June's daughter Ilona Porter, Paul Fenton & Mickey Finn's girlfriend Heidi. The Site also includes details & video clip of the Channel Four programme 'Who got Marc Bolan's Millions' & the BBC \"Rock Shrines\" Programme. Marc's Rock Shrine Now Officially Recognised by The English Tourist Board (EnjoyEngland/Discover England) in their Guide \"England Rocks\". Now also featured in the BBC4 Series 'Pagans and Pilgrims : Britain's Holiest Places'.|Finally, there is a ' TAG|TM|CIC Shop on eBay'|where you can buy Marc Bolan & T-Rex Fund Raising Memorobilia. This includes a Guide Book to over 60 places of 'Bolan Interest' in London which is a Must Have. In September each year we list our own T-Rexmas (Christmas) Cards, and our sell-out Calendars are always sought after. We also sell Greetings Cards,  TAG|TM|CIC DVD's and CD's including our Double DVD Covering the Essential Events of Marc's 25th Anniversary including The Bronze Bust Unveiling (of course), The Proud Gallery Exhibition opening 'Party', Mickey Finn's T-Rex play live in front of over 2,000 people at Pennington's Nightclub with very speciual guests Rolan Bolan, Graham Oliver (Saxon) & Judge Trev (Steve Took's Horns). The second DVD contains interviews including ones with the late Mickey Finn (his last video interview) & the late Keith Morris. We also list other things as appropriate.|CLICK HERE TO GO TO TAG'S EBAY SHOP|Key words you'll find|on the site include: - Marc Bolan (real name Mark Feld), (sometimes mis-spelt as Bowland, Boland or Bowlan),  T.Rex, T-Rex, T Rex, Tyrannosaurus Rex, Rolan, (sometimes mispelt Rowland, Roland, or Rowlan), Bolan Tree, Marc's Rock Shrine, Barnes, on the edge of Barnes Common,  (near Putney & Richmond), London where Marc Bolan died in the Mini 1275 GT driven by girlfriend Gloria Jones. The tree is between Queen's Ride & Gipsy Lane, (Gypsy Lane is used in some articles, but this is incorrect), both spellings of Mickey Finn, (Micky Finn), Steve Peregrin Took (the correct spelling as opposed to Steve Peregrine Took),  TAG|TM|CIC, T-Rex Action Group, Illustrated Biography, Members Site, Born to Boogie, desktops, screen savers, marc bolan school of music and film, gloria jones, ... to name but a few. This is our Official Site.|Copyright © 1997 to 2022 T-REX ACTION GROUP|TM|CIC. All Rights Reserved|ALL Photographs of Marc Bolan's Rock Shrine, Gipsy Lane/Queen's Ride, Barnes, London are copyright  TAG|TM|CIC (Kevin and Fee Warner) unless otherwise stated.|For use and/or distribution, please contact  TAG|TM|CIC for written permission.|OTHER IMAGES DISCLAIMER: All photographs of Marc Bolan used on this site remain the property of their respective owners, if applicable. We thank the late and still missed Keith Morris for his permission for the use of of his photographs on our Web Site. All animated images created by Fee Warner. All photos (other than Marc Bolan's Rock Shrine Photos) from outside sources are intended for research &/or personal use only. If you own anything (other than Marc Bolan's Rock Shrine Photos)  that you feel is wrongly used on this site, please e-mail us & we will take it down or credit you.",
          "TAG|No left frame with link buttons?|Click Here to re-enter Site!|Marc's Early Life - A London Boy|Marc was born the second son of Simeon and Phyllis Feld at Hackney General Hospital on September 30th 1947. Their new son was named Mark, after one of Sid's brothers who had died the previous year. The Felds were a working class Jewish family. Simeon, known as Sid, was a van driver and sometime cosmetics salesman; who also ran a stall in Petticoat Lane at weekends, selling jewellery. Phyllis ran a fruit stall in Berwick Street Market, in the Soho district of London where Marc helped out when not at school.|The family lived in flat in a terraced house at 25 Stoke Newington Common, Hackney (see right) and Marc lived there from his birth to the age of fourteen. For many of his fans, particularly younger ones or those not familiar with England, his birth in 1947 meant that he arrived into a London where food rationing was still in place and was still marked by the bomb-damaged houses from World War II. For those not familiar with the 'characteristics of different parts of London (Boroughs), Hackney is in the 'East End' of London an area which has always been considered a somewhat poor part of the city.|25 Stoke Newington Common was split into three flats (apartments). The Felds occupied four rooms on two levels. The kitchen and bathroom were situated at the top of the long flight of stairs, with a back bedroom (Phyllis and Sid's) and a large front living room which looked across the common a few steps higher. The front living room was also Marc and Harry's bedroom boy's bedroom.|In this living room Marc and Harry spent their time listening to Saturday Night Theatre radio show. A few years later Rock'n'Roll records replaced BBC radio. \"Noisy? When you came in that front door and he had that radiogram on, you could hear him down three flights of stars,\"- remembers Mrs. Perrone, the Felds' landlady.|He fell in love with the rock and roll of Gene Vincent and Chuck Berry at an early age.  When Marc was Nine he talked his mother into spending a huge amount of money (as a percentage of their income) on a Suzuki acoustic guitar. This was bought on the newly arrived 'Hire Purchase', where people on lower incomes could pay weekly for expensive items they would not have otherwise been able to afford. Everyone does that now, but in the 1950's it was 'new' and many people were suspicious of it having been brought up not to expect to own something you couldn't pay for in full. He became a Mod and hung out at the Hackney Empire, where the show \" Oh Boy!\" was playing, and the 2i's coffee bar in Soho, and saw British rockers like Cliff Richard (then touted as the UK's answer to Elvis!) and for a long while Marc sounded like Cliff Richard when he performed.",
          "|Even as a teenager, he was already seeking fame and was well known as a sharp dresser. In 1962, fascinated by the newly emerging Mod Movement and the sharp suits Marc was spotted and featured in the men's magazine \"Town\" as a 'face' on London's emerging Mod scene. Ironically the Felds moved before the article was published in September 1962.",
          "|\"Feld is fifteen years old, and still at school. His family has just moved from Stamford Hill to a pre-fab out in Wimbledon. Of this he does not approve. The queues of Teds outside the cinemas in Wimbledon look just like a contest for the worst haircut, he says. At least the boys of Stamford hill dress sharply, and who would want a new, clean house if it is in unsympathetic surroundings? Nonetheless cleanliness is of vital importance to him. Shining with soap and health, he is apparently tireless and often goes for days on end without any sleep; there is never a trace of fatigue or boredom in his face. \"What is the point of all this energy and all the soap and water? Where is the goal towards which he is obviously running as fast as his impeccably shod feet can carry him? It is nowhere. He is running to stay in the same place and he knows by the time he has reached his mid-twenties the exhausting race will be over and he will have lost.\"|Marc registered with a modelling agency and this netted Marc a couple of jobs including the Littlewoods catalogue and one stint of modelling for John Temple. However he was not booked again.|1962 - Leaving Hackney - Summerstown, Wimbledon|In 1962, when he was fourteen the Felds moved from Stoke Newington to one of the new Sun Cottages in Summerstown. This was across London. For his parents it was a dream. A complete, newly built house compared with a flat in an old house. But Marc hated it. He was no longer 'King of Three Streets in Hackney' and he missed the company of his old mates. To compensate for living away from Hackney, Marc spent most of his time in Soho enjoying its flourishing club scene.|He left school early, although by all accounts as he got older his attendance was not good at the best of times. This is scarcely surprising as he was quite clearly dyslexic - a condition not hear of in the 1950's. Despite dyslexia, he soon began writing poetry and he also showed an interest in poetry and romantic literature, his main influences being Dylan Thomas and Rimbaud. His father Sid said: \"We honestly didn't mind him being expelled, he just didn't have any interest in school so we encouraged him to go ahead with his music. Whatever he did that music thing was the end of it.\" Phyllis said, \"We weren't upset when he was expelled because frankly he never went to school very much anyway. And when he did, he went wearing Elvis Presley clothes and winkle-picker shoes which always annoyed them... I've always said that I was in the same position as mothers whose sons go to college.\"|Although after leaving school Marc had countless small jobs such as the bit of modelling he did and working in a Wimpy Bar, the main person who 'kept him going' was his mum Phyllis. Just as she'd bought him his first guitar at the age of nine, she paid the model agency registration fees and he could rely on her to provide him with a roof over his head and food on the table while he pursued his goal of fame. Some might say that Marc; the younger of two brothers was 'spoilt' by his mum. His father Sid said: \"We honestly didn't mind him being expelled, he just didn't have any interest in school so we encouraged him to go ahead with his music. Whatever he did that music thing was the end of it. Marc idolised my Phyllis... and she went out and really worked hard so he could stay at home.\"|In 1963, after seeing 'Summer Holiday' Marc declared to his friend Jeff Dexter  \"I'm gonna be as big as Cliff Richard\". Jeff was horrified as Cliff was 'old school'. Dexter recalled that \"Marc never talked about being a musician. He wanted to be a star. He wanted to be Cliff.\"|1964 - The End of 'The Mod Marc'|In 1964 'Marc the Mod' disappeared, as he discovered Bob Dylan. While Marc and David Bowie were two young hopefuls hanging around the set of 'The Five O'clock Club', Marc met the man who would become his first manager, Allan Warren, the former teenage progeny. In 1964, still aged sixteen, Marc moved in with him. He lived with Alan for six or eight months. Alan recalls \"Marc was \"one of those people that would say, 'I've had enough talking about me. Now what do you think of me?' I'd think God another three hours talking about him\". Warren arranged the first recording session for Marc, however of his rendition of Dylan's 'Blowin' in the Wind' was poor and sounded more like a Cliff Richards copy. Through Warren Marc gained an audition at EMI in February 1965, but to no effect.|Of the much discussed 'bisexual side' to Marc, Warren recalled that at the time, in the 'hipster scene' he and Marc now frequented \"He went to bed with everyone because everyone did in those days \u0085 People were into beauty and Mark was young and very pretty. Many people enjoy taking young men out to dinner; there doesn't have to be anything sexual about it. You didn't need money if you were a pretty boy in the right part of London in the sixties. If you had a modicum of talent, and you were persistent, you could get the break very easily\".|By the Spring of 1965 Marc had, through Warren met Riggs O'Hara, a serious and successful actor. Marc's horizons were expanded as O'Hara introduced him to London's swinging elite, whisking him to first nights and restaurants, in his car complete with on-board record player! Marc moved in with O'Hara and his flatmate James Bolam (of Likely Lads fame).|The Wizard - Riggs O'Hara|Seemingly unconnected with 'Riggs O'Hara' was the story Marc told of having spent time with a wizard who gave him secret knowledge in France. In early accounts, these included sacrificed live cats, eating human flesh, and other wild flights of fancy. He claimed to have been in France for months when the whole trip was actually a weekend. It is widely know that 'The Wizard' was 'Riggs O'Hara' and O'Hara's memories are somewhat tamer. Interestingly, Marc's first single release would be entitled 'The Wizard'. Of course, as O'Hara was older than Marc, he no doubt did learn some 'secret knowledge' during that weekend. As for mystical? It was Marc's first ever trip outside England so on that level it was.|In 1965, O'Hara recalled that Marc \"wasn't doing gigs when I knew him\". As Mark Feld, Marc had toyed with other names including 'Toby Tyler' taken from a Disney character who ran joined a circus and found fame, 'Riggs' (O'Hara's first name) before settling on 'Bolan'. One train of thought is that he took the name 'Bolan using 'Bo' from 'Bob' and 'lan' from Dylan. However James Bolam was convinced that his name was the source of Marc's new surname. He was not amused. However, it may be that he took his name from the French fashion designer of the day Marc Bohan.|After a brief stint back home Marc moved into a flat with Mike Pruskin, who became Marc's publicist. The rent on the flat was paid by an older man, Geoffrey. In October 1965 Pruskin was able to secure an article in the Evening Standard where Marc stated|\"The prospect of being a materialist idol for four years does appeal\".|Marc's hope of being the 'British Bob Dylan' were dashed when Donavan's first single reached the top five, but he was still Dylan influenced in singing style and dress. In August 1965 Marc was offered a one record deal with Decca Records. The single 'The Wizard' was released in November 1965 and despite several TV appearances it bombed. Decca's press release for the Wizard single read:|\"Marc Bolan was born in September 1947. After 15 years had passed he traveled to Paris and met a black magician called The Wizard, He lived for 18 months in The Wizard's chateau with Achimedies, an owl, and the biggest, whitest Siamese cat you ever saw. He then felt the need to spend some time alone so he made his way to woods, near Rome. For two weeks he strove to find himself and then he returned to London where he began to write. His writings mirror his experiences with mentionings of the magician's pact with the great god Pan. In London, walking down Kings Road, Chelsea in the dead of night, he chanced to meet a girl named Lo-og who gave him a magic cat. This cat, named after the girl, is now his constant companion and is a source of inspiration to him. Now The Wizard's tale is set down for all to hear on Marc's first recording for Decca.\"|A second single The Third Degree' in June 1966 suffered a similar fate. Once again Marc moved home and began writing inspired by Tolkien and C.S. Lewis.|Late in 1966 Marc contacted Simon Napier-Bell and minutes later arrived on his doorstep, with his guitar because he didn't have a demo tape, but could perform for him live. Napier Bell, with his delight in pretty young things could not have failed to be impressed by this cheeky seventeen your old street urchin, still sporting the 'East End' accent Marc would so carefully lose within a couple of years. Napier Bell loved being charmed and Marc could be very charming when he needed to be. Napier-Bell became his manager and eventually Napier-Bell used his contacts, as manager of The Yardbirds, to get Marc his third single release: \"Hippy Gumbo\" with Parlophone.|At the time, despite Marc's self confidence, Napier-Bell remembers that \"his guitar playing was appalling \u0085 he was absolutely unaware of his shortcomings\". Marc appeared on|'Ready Steady Go'|but television exposure failed to convert to record sales and \"Hippy Gumbo\" too failed to make an impact. One review read \"a crazy mixture of an incredibly bad Negro blues singer and Larry the Lamb'.|Napier Bell's Book \"You don't have to say you love me\" (see right) has some interesting recollections of his time with Marc.|1967 - A 'stint' with John's Children|In 1967 Napier Bell decided his singing voice was 'un-saleable' as lead vocals. He placed Marc in the tough flower children/Mod band 'John's Children' song writing, guitar and singing backing vocals. That way Napier Bell deduced, the public could get used to Marc's 'Larry the Lamb' vocals in 'snippets'. Napier-Bell admits \"I knew 'John's Children' were about to succeed and I knew I couldn't sell Marc's voice to the public\". Marc was playing a Gibson SG at the time (1967) and, according to Chris Townson of the band, \"His first rehearsal with us was deafening, even by our standards! I think the band got worse when Marc first joined, because all he did was stand there and make this messy blurge. It was so bad, that I used to sneak round before a gig and retune his guitar ... He seemed to think it didn't matter.\" John's Children had some success as a live band but sold few records. Marc was only in the band a few months although he penned several of their popular songs (including the infamous 'banned by the BBC' single Desdemona'). While Marc was in 'John's Children' they played at the|'All-night 14 Hour Technicolor Dream concert'|at Alexandra Palace, alongside 'Pink Floyd', 'The Crazy World of Arthur Brown', 'the Deviants', and 'the Soft Machine'. 'John's Children' initially decided to perform with no clothes on, but changed their mind and tried to make a happening instead. Andy Ellison screamed and threw feathers everywhere, Chris Townson demolished his drum kit, and Marc walked around with guitar on his head, producing endless feedback. Not exactly a musical performance then!|But Marc wanted to be in his own band, not singing backing vocals in someone else's band! 'John's Children' supported 'The Who' and spent time on stage smashing up equipment and whirling metal chains round above their heads causing the audience to back away in terror. In a bid to outdo the headliners, The bill for destroyed equipment came to £25,000, which was a LOT of money in 1967! Lead singer Andy Ellison recalls that for the first few performances Marc was drunk on stage. It seems he'd needed wine to steady his nerves.|Go on to The Tyrannosaurus Rex Years|BACK TO TAG'S MARC BOLAN & T-REX INFORMATION PAGES",
          "|Although undertaking PhD research Fee Warner spent most of 1999 (from TAG's formation) designing, making and selling items such as T-Shirts, Bookmarcs and Badges to help pay for the project. She was helped by husband Kevin Warner and by both their children Rohan Marc (then aged eighteen) and Oscar (aged just Nine to Ten years old in 1999). Donations for the project came from many fans abroad.|1999 AUCTION:|In addition to producing items directly for sale some were specifically designed, and produced for an auction. Sadly, this was in the days before eBay had 'caught on' so only those in the room were generally able to bid which resulted in lower than hoped for prices. In September 1999, TAG|TM|held the auction of items including prints produced by TAG and signed by photographer Peter Sanders and artist George Underwood. Many tanx to Jim Ryder for arranging for them to be signed, although disappointingly many sold for around £10.00 each as the UK fans present were hoping for bargains and several people even tried to haggle over the price of set price items such as T-Shirts :-(|KEY AUCTION SALE ITEMS:|Two sets of framed contact prints, negatives and enlargements|were prepared, paid for by Fee Warner and donated to the auction to raise funds. These sold for over £300.00. The negatives were previously unpublished and were sold with copyright, having been gifted to Fee on one of her many visits to Marc Bolan's parents in 1977/78. Marc's mum disliked 'The Tree' wrongly blaming it for his death, however Marc's older brother Harry gave his approval for the project. Family approval was something, which Fee felt, was essential for this work to happen. The donation of these photographs was her way of returning to Marc something given to her by his mother Phyllis. Fee turned down the offer of Marc's clothing suggesting to Phyllis that she saved it for when Rolan was older. In that respect, Marc's mum was far too generous. Some years later one fan and her husband, who were gifted a jacket AND another item of clothing (as they weren't married at the time) refused to allow one of those items to be displayed behind glass and fully insured in a Museum so that all visitors to the museum would have been able to see it.|2000 - TAG LAID THE STEPS:|from the PRS Memorial to the 'Bolan Tree' with a viewing platform around the tree so visitors do not risk injury by standing on the pavement less & narrow road by the tree. TAG has also erected a notice board for messages & crucially|saved the 'Bolan Tree' from felling.|All this was achieved within four months of TAG receiving the Lease, although work to fund raise and deal with the 'red tape' meant that the key members of TAG had been working for TAG for a full year by the time the Tree was successfully saved in April, 2000.|2002 - 25th ANNIVERSARY - BRONZE BUST:|Rolan Bolan|unveiled a|Bronze Bust|of his father at the site to commemorate the|25th anniversary of Bolan's death|. This Bronze was paid for personally by Fee Warner.|2005: FIVE MEMORIAL PLAQUES|TAG once again sold fund raisers to raise the money needed to install plaques for the four members of T-Rex who like Marc, have passed over. They are:|Steve Peregrin Took|;|Steve Currie|;|Mickey Finn|&|Dino Dines|& a Memorial Plaque for|June Bolan|(nee Child) in recognition for her part in Marc's success.|2007 - 30th ANNIVERSARY:|TAG organised a Very Special & indeed Unique Event for its  Members|This was the First Ever|Marc Bolan Celebration|inside the Sacred Stone Circle of|Stonehenge|. This was part of a|Marc's Mystical Roots|trip where  Members retraced the steps of Marc and the late|John Peel|to the top of|Glastonbury Tor|, before dining in a private room at the|George and Pilgrims Inn|(the oldest Inn in the South West of England dating back to the 15th Century) before heading for the Exclusive, Private booking of Stonehenge where  Members were entertained by|Paul (T-Rex) Fenton|and|Rob Benson|of|T-Rex - A Celebration of Marc and Mickey|. A|Druid Ceremony|(|Wear a Tall Hat like the Druids|) was performed by|Stonehenge Arch Druid Rollo Maughfling|and|Hon. Glastonbury Order of Druids Arch Druidess Victoria Marsden|.|2009 - THE LAUNCH OF THE MARC BOLAN ROSE FUND:|The project to have a unique & new variety  of Rose named after Marc was launched by TAG. This is an ongoing project and it is hoped that the balance of the money needed to initiate the growing of the rose will be achieved by the end of 2012. How long it takes before the rose is on sale will depend on how quickly the rose crosses can be done to achieve the most pleasing result.|18th September 2009:|To Celebrate the 10th Anniversary of the formation of TAG as well as the 32nd Anniversary of Marc's Passing|MF's T-Rex|performed as part of a Benefit Celebration in the heart of London, at the 100 Club on Friday 18th September 2009.|2010:|Once again TAG continued to ensure the site was a suitable tribute to Marc Bolan and his band T-Rex with routine maintenance including topping up the bark chippings in the steps, replacing several of the railway sleepers which make up the steps and repainting the steps and notice board, because to main the site as though 'nothing has been done' requires work!|2011 KEEPING THE BOLAN TREE SAFE:|Pollarding the Tree which was undertaken in March, 2011 by Bob Knoakes and his team from|THE ORIGINAL TREE SURGEONS LIMITED|. Visit our Photo Galleries for Full Information with Photos and Videos.|2011 BULB PLANTING:|In late 2011 TAG will be planting a range of bulbs at the site on either side of the steps. Bulbs were planted in 1998 and TAG members Fee and Oscar Warner were two of the key people who undertook that work. However, the ground was not prepared and the bulbs were not planted correctly so that many did not achieve their potential. For this reason, the 2011 bulb planting will be accompanied by the preparation of proper 'bulb beds' because one perennial problem associated with the site is the fast drainage of the site due to the slope of the embankment. Therefore, moisture-retaining additives to the soil will be used to help with this problem.|2012:|We have planted the bulbs|*|and are delighted to say that the Marc Bolan Rose is now a reality for Marc's 35th Anniversary/Marc's 65th Birthday.|2013|The Marc Bolan Rose is now REAL and is on sale - exclusively from TAG for the UK and Europe. In Addition, the shrine featured in the BBC4 Series \"|PAGANS & PILGRIMS: BRITAINS HOLIEST PLACES|\". In addition to featuring in Episode four (of six) Marc's shrine featured in the opening sequence each week throughout the entire six week shedule.|2014|2014 saw the willful and purposeful murder of the Bolan Tree with poison by person(s) unknown.|* Unfortunately, two 'fans' visited the shrine several years later and 'tidied' the area on either side of the steps. They dug out a thick layer of soil, removing the majority of the bulbs TAG|TM|planted in 2012.|The Official Marc Bolan Rose|On a very positive note, the first batch of almost two hundred|Marc Bolan Rose Bushes|were available to fans and they completely Sold Out! These were only available 'bare rooted' which isn't ideal for those without any|green fingers|.|2015 - THE BOLAN TREE|The Key priority during the first part of 2015 was to make the site safe for visitors, passing motorists, cyclists and pedestrians.  The Bolan Tree was felled and a capping barrel was placed over the base of the Bolan Tree. On the 15th May 2015 T.Rex Action Group / TAG and the Logo were registered as Trademarks.|2016 to 2020:|Although the Bolan Tree was felled in 2015 Marc Bolan's Rock Shrine is so much more than the Tree. From the PRS Memorial unveiled in 1997, to the Memory Board and Steps added in 2000, through the Bronze Bust unveiled by Rolan Bolan in 2002 the site is Special and a place of pilgrimage to thousands of people from all over the world all-year-round.|2021:|VALENTINE'S DAY MASSACRE|: Saturday the 13|th|and Sunday 14|th|February 2021 saw the wholescale deversation of this \"|Very Special Corner|\"|*|of Barnes Common Conservation Area by Network Rail contractors. TAG was NOT notified. The local residents were notified that there would be  \"|cutting back overgrown vegetation that is obstructing the highway and felling dead, dying or diseased trees|\". Richmond Council permitted a road closure of Queen's Ride for that weekend for this work. The filming done by TAG shows that there was a clear need to remove the saplings which were growing on the narrow piece of land between the 'Armco crash barrier' and Queen's Ride. There is no dispute that this vegetation did need removing, as did the dead trees, However, no one knew what would be done and because it happened over a weekend it was impossible for anyone to contact Richmond Council's appropriate department to get one of their experts to visit and limit the damage. By the time Richmond Council's offices opened again on Monday 15|th|February 2021 it was too late.|*|Quoted in Richmond Council's own '|Cconservation Area Study|- Barnes Common No. 32 and Mill Hill No. 14|' pdf.|The Valentine's Day Massacre spured TAG on to apply to become a|Community Interest Company|(|CIC|)|On the 21st December 2021 TAG was Officially Granted CIC Status|This wonderfully happened on the|Winter Solstice 2021|. A Good Omen for the start of a New Year which happens after the three days of '|Solstice|' which means '|Sun Stands Still'|On the following day in Pagan Tradition the Sun begins to move again and is therefore 'Re-Born' and the Circle of the Year Begins afresh with the Newborn Sun.|What does becoming a Community Interest Company mean for TAG?|It means that|TAG has the appropriate Not-For-Profit aims to be a CIC|, which is effectively just a small step away from being what larger organisations can become - a fully Registered Charity and indeed you may have already noticed that TAG is listed on eBay as a Charity.  Now that TAG is Officially and Legally registered as a CIC, we can apply for funding from various organisations so that we can make Marc's Shrine a more Fitting Tribute to Marc Bolan and his band T.Rex as TAG 'Rev-Up' forwards Marc's 45th Anniversary on the 16th of September 2022 and his 50th Anniversary in 2027. This will include TAG's  new key projects.|One is to have electricity collected and having a CCTV system installed|which will live-stream Marc's Shrine around the Globe 24 hours a day, seven days a week for all the fans who cannot visit the site or cannot visit as open as they'd like to.|Part two on our agenda|is that because Marc Bolan's Rock Shrine is within the London Borough of Richmond-Upon-Thames'|Barnes Common Conservation Area'|and has been since 2002, when TAG applied for planning permission to install the Bronze Bust unveiled by Rolan Bolan at the shrine, we have a duty of care to manage the site carefully for the benefit of all - Marc Bolan and T.Rex Fans, Local Residents, the wider community of Richmond-Upon Thames, and the Worldwide fans who are now, more than ever discovering Marc Bolan through his band T.Rex's induction into the Rock 'N Roll Hall of Fame in America.|Therefore, TAG will establish and implement an appropriate management system as recommended in the Richmond Council '|biodiversity action plan|'. This project will require a mains water supply to be installed so that when we start our planting programme of appropriate trees and shrubs, they will have a far better chance of thriving, because buying saplings and shrubs or a substantial size are expensive investments. Increasing the biodiversity of the Flora, will create new enriched habitats for Native Fauna species to increase in number, something which is essential as we all see a decline in our Birds, Insects and Small Mammals.|As well as the profits from our fund-raising merchandise, and periodic donations from fans our newly gained 'Community Interest Company' status will mean we can apply for funding from appropriate bodies and organisations including The Arts Council, The Lottery Fund and locally based bodies and organisation.|TAG has some other ideas 'in the pipeline' which we'll let you know about when the time is right.|2022 and Onwards|:  2022 sees TAG|TM|CIC Celebrate our 23rd Anniversary.|On the 16th September 2022 it will be the 45th Anniversary of Marc Bolan's Spirit acending at the site.|TAG|TM|CIC has already raised some money to have a custom-made hand rail manufactured and fitted to one side of the steps to make the site safer for all visitors, especially the 'originals' who are, like Fee around or over 60-years-of-age now! Due to Covid-19 this will be installed in as soon as the local residents have given their approval of the design and goverment regulations allow in 2022.|TAG|TM|CIC will, continue to care for the site now|Officially Recognised|by the|English Tourist Board|as|'Marc Bolan's Rock Shrine'|& now as One of|Britain's Holiest Shrines|to keep it a fitting tribute.  TAG|TM|CIC will also add further Memorial Plaques, though we hope not for a long time!|WEB SITE DESCRIPTION|Regularly updated, massive site|with lots of information on all things Marc Bolan & T.Rex related. Free Illustrated Biography, Chart Positions, In the Free-to-all Marc Bolan and T.Rex Fan Club  Site you'll find articles, interviews, Photos, Pictures & Images in the Gallery Section, song books with lyrics, music & tabs, video/film footage (wmv & Div X mpegs), plus Music & Interview files as mp3's. Marc's Poetry Book \"Warlock of Love\" Transcripts. Scans of Marc Bolan Poetry, Newspaper Articles & News Clippings, Original 1970's Magazine Features & 'Specials' including \"Disco 45 Magazine\", \"Jackie\", \"Mirabelle\", Birth Certificates, Letters & other Documents. In All over 10 Gig of Bolantastic Info!Plus Screensavers & Desktops to download.|This site aims|to cover the whole period of Marc's career, from his earliest musical out-put, and into the fabulous time when Marc really got going when he & Steve Took formed Tyrannosaurus Rex in 1967, until his death on September 16th 1977 aged 29 years & fifty weeks when the Mini 1275 GT driven by his girlfriend Gloria Jones hit a sycamore tree & so many lives were changed by his death. Plus news of what's happening now including details of the first ever T-Rex Convention at the Cavern Club, Liverpool.|TAG|TM|CIC's Site also includes|Reviews & information on new & recent releases including the book 'Beneath the Wizard's Gown' by Tony Stringfellow, 'Inside T-Rex' Double DVD & Book, 'Children of the Revolution' double CD with music choices by Dr. Roberts, the Double DVD release of Marc Bolan & Ringo Starr's film 'Born to Boogie' featuring Catweazel (Cat Weazel), produced by Tony Visconti. Includes info on how to find the Easter Eggs, while the RIP Section includes details on people associated with Marc Bolan including Band Members plus Chelita Secunda (Chelita Salvatori), Photographer Keith Morris, Tony Secunda, Tony Howard, Alphi O'Leary, to name a few.|There is information on the T.Rex Action Group ( TAG|TM|CIC)|including the members, the lease on the site,  TAG|TM|CIC's project to care for the site, save the tree & the Bronze Bust unveiled by Rolan Bolan in 2002. The original wooden sculpture from which the Bronze Bust was cast was created by the talented artist, Jean Robillard of Quebec, Canada. Also now with Information, Photo Galleries & Video of the Memorial Plaques for Steve Took, Steve Currie, June Bolan (June Child), Mickey Finn & Dino Dines installed in 2005. Guests included June's daughter Ilona Porter, Paul Fenton & Mickey Finn's girlfriend Heidi. The Site also includes details & video clip of the Channel Four programme 'Who got Marc Bolan's Millions' & the BBC \"Rock Shrines\" Programme. Marc's Rock Shrine Now Officially Recognised by The English Tourist Board (EnjoyEngland/Discover England) in their Guide \"England Rocks\". Now also featured in the BBC4 Series 'Pagans and Pilgrims : Britain's Holiest Places'.|Finally, there is a ' TAG|TM|CIC Shop on eBay'|where you can buy Marc Bolan & T-Rex Fund Raising Memorobilia. This includes a Guide Book to over 60 places of 'Bolan Interest' in London which is a Must Have. In September each year we list our own T-Rexmas (Christmas) Cards, and our sell-out Calendars are always sought after. We also sell Greetings Cards,  TAG|TM|CIC DVD's and CD's including our Double DVD Covering the Essential Events of Marc's 25th Anniversary including The Bronze Bust Unveiling (of course), The Proud Gallery Exhibition opening 'Party', Mickey Finn's T-Rex play live in front of over 2,000 people at Pennington's Nightclub with very speciual guests Rolan Bolan, Graham Oliver (Saxon) & Judge Trev (Steve Took's Horns). The second DVD contains interviews including ones with the late Mickey Finn (his last video interview) & the late Keith Morris. We also list other things as appropriate.|CLICK HERE TO GO TO TAG'S EBAY SHOP|Key words you'll find|on the site include: - Marc Bolan (real name Mark Feld), (sometimes mis-spelt as Bowland, Boland or Bowlan),  T.Rex, T-Rex, T Rex, Tyrannosaurus Rex, Rolan, (sometimes mispelt Rowland, Roland, or Rowlan), Bolan Tree, Marc's Rock Shrine, Barnes, on the edge of Barnes Common,  (near Putney & Richmond), London where Marc Bolan died in the Mini 1275 GT driven by girlfriend Gloria Jones. The tree is between Queen's Ride & Gipsy Lane, (Gypsy Lane is used in some articles, but this is incorrect), both spellings of Mickey Finn, (Micky Finn), Steve Peregrin Took (the correct spelling as opposed to Steve Peregrine Took),  TAG|TM|CIC, T-Rex Action Group, Illustrated Biography, Members Site, Born to Boogie, desktops, screen savers, marc bolan school of music and film, gloria jones, ... to name but a few. This is our Official Site.|Copyright © 1997 to 2022 T-REX ACTION GROUP|TM|CIC. All Rights Reserved|ALL Photographs of Marc Bolan's Rock Shrine, Gipsy Lane/Queen's Ride, Barnes, London are copyright  TAG|TM|CIC (Kevin and Fee Warner) unless otherwise stated.|For use and/or distribution, please contact  TAG|TM|CIC for written permission.|OTHER IMAGES DISCLAIMER: All photographs of Marc Bolan used on this site remain the property of their respective owners, if applicable. We thank the late and still missed Keith Morris for his permission for the use of of his photographs on our Web Site. All animated images created by Fee Warner. All photos (other than Marc Bolan's Rock Shrine Photos) from outside sources are intended for research &/or personal use only. If you own anything (other than Marc Bolan's Rock Shrine Photos)  that you feel is wrongly used on this site, please e-mail us & we will take it down or credit you.",
          "TAG|No left frame with link buttons?|Click Here to re-enter Site!|Marc's Early Life - A London Boy|Marc was born the second son of Simeon and Phyllis Feld at Hackney General Hospital on September 30th 1947. Their new son was named Mark, after one of Sid's brothers who had died the previous year. The Felds were a working class Jewish family. Simeon, known as Sid, was a van driver and sometime cosmetics salesman; who also ran a stall in Petticoat Lane at weekends, selling jewellery. Phyllis ran a fruit stall in Berwick Street Market, in the Soho district of London where Marc helped out when not at school.|The family lived in flat in a terraced house at 25 Stoke Newington Common, Hackney (see right) and Marc lived there from his birth to the age of fourteen. For many of his fans, particularly younger ones or those not familiar with England, his birth in 1947 meant that he arrived into a London where food rationing was still in place and was still marked by the bomb-damaged houses from World War II. For those not familiar with the 'characteristics of different parts of London (Boroughs), Hackney is in the 'East End' of London an area which has always been considered a somewhat poor part of the city.|25 Stoke Newington Common was split into three flats (apartments). The Felds occupied four rooms on two levels. The kitchen and bathroom were situated at the top of the long flight of stairs, with a back bedroom (Phyllis and Sid's) and a large front living room which looked across the common a few steps higher. The front living room was also Marc and Harry's bedroom boy's bedroom.|In this living room Marc and Harry spent their time listening to Saturday Night Theatre radio show. A few years later Rock'n'Roll records replaced BBC radio. \"Noisy? When you came in that front door and he had that radiogram on, you could hear him down three flights of stars,\"- remembers Mrs. Perrone, the Felds' landlady.|He fell in love with the rock and roll of Gene Vincent and Chuck Berry at an early age.  When Marc was Nine he talked his mother into spending a huge amount of money (as a percentage of their income) on a Suzuki acoustic guitar. This was bought on the newly arrived 'Hire Purchase', where people on lower incomes could pay weekly for expensive items they would not have otherwise been able to afford. Everyone does that now, but in the 1950's it was 'new' and many people were suspicious of it having been brought up not to expect to own something you couldn't pay for in full. He became a Mod and hung out at the Hackney Empire, where the show \" Oh Boy!\" was playing, and the 2i's coffee bar in Soho, and saw British rockers like Cliff Richard (then touted as the UK's answer to Elvis!) and for a long while Marc sounded like Cliff Richard when he performed.",
          "|Even as a teenager, he was already seeking fame and was well known as a sharp dresser. In 1962, fascinated by the newly emerging Mod Movement and the sharp suits Marc was spotted and featured in the men's magazine \"Town\" as a 'face' on London's emerging Mod scene. Ironically the Felds moved before the article was published in September 1962.",
          "|\"Feld is fifteen years old, and still at school. His family has just moved from Stamford Hill to a pre-fab out in Wimbledon. Of this he does not approve. The queues of Teds outside the cinemas in Wimbledon look just like a contest for the worst haircut, he says. At least the boys of Stamford hill dress sharply, and who would want a new, clean house if it is in unsympathetic surroundings? Nonetheless cleanliness is of vital importance to him. Shining with soap and health, he is apparently tireless and often goes for days on end without any sleep; there is never a trace of fatigue or boredom in his face. \"What is the point of all this energy and all the soap and water? Where is the goal towards which he is obviously running as fast as his impeccably shod feet can carry him? It is nowhere. He is running to stay in the same place and he knows by the time he has reached his mid-twenties the exhausting race will be over and he will have lost.\"|Marc registered with a modelling agency and this netted Marc a couple of jobs including the Littlewoods catalogue and one stint of modelling for John Temple. However he was not booked again.|1962 - Leaving Hackney - Summerstown, Wimbledon|In 1962, when he was fourteen the Felds moved from Stoke Newington to one of the new Sun Cottages in Summerstown. This was across London. For his parents it was a dream. A complete, newly built house compared with a flat in an old house. But Marc hated it. He was no longer 'King of Three Streets in Hackney' and he missed the company of his old mates. To compensate for living away from Hackney, Marc spent most of his time in Soho enjoying its flourishing club scene.|He left school early, although by all accounts as he got older his attendance was not good at the best of times. This is scarcely surprising as he was quite clearly dyslexic - a condition not hear of in the 1950's. Despite dyslexia, he soon began writing poetry and he also showed an interest in poetry and romantic literature, his main influences being Dylan Thomas and Rimbaud. His father Sid said: \"We honestly didn't mind him being expelled, he just didn't have any interest in school so we encouraged him to go ahead with his music. Whatever he did that music thing was the end of it.\" Phyllis said, \"We weren't upset when he was expelled because frankly he never went to school very much anyway. And when he did, he went wearing Elvis Presley clothes and winkle-picker shoes which always annoyed them... I've always said that I was in the same position as mothers whose sons go to college.\"|Although after leaving school Marc had countless small jobs such as the bit of modelling he did and working in a Wimpy Bar, the main person who 'kept him going' was his mum Phyllis. Just as she'd bought him his first guitar at the age of nine, she paid the model agency registration fees and he could rely on her to provide him with a roof over his head and food on the table while he pursued his goal of fame. Some might say that Marc; the younger of two brothers was 'spoilt' by his mum. His father Sid said: \"We honestly didn't mind him being expelled, he just didn't have any interest in school so we encouraged him to go ahead with his music. Whatever he did that music thing was the end of it. Marc idolised my Phyllis... and she went out and really worked hard so he could stay at home.\"|In 1963, after seeing 'Summer Holiday' Marc declared to his friend Jeff Dexter  \"I'm gonna be as big as Cliff Richard\". Jeff was horrified as Cliff was 'old school'. Dexter recalled that \"Marc never talked about being a musician. He wanted to be a star. He wanted to be Cliff.\"|1964 - The End of 'The Mod Marc'|In 1964 'Marc the Mod' disappeared, as he discovered Bob Dylan. While Marc and David Bowie were two young hopefuls hanging around the set of 'The Five O'clock Club', Marc met the man who would become his first manager, Allan Warren, the former teenage progeny. In 1964, still aged sixteen, Marc moved in with him. He lived with Alan for six or eight months. Alan recalls \"Marc was \"one of those people that would say, 'I've had enough talking about me. Now what do you think of me?' I'd think God another three hours talking about him\". Warren arranged the first recording session for Marc, however of his rendition of Dylan's 'Blowin' in the Wind' was poor and sounded more like a Cliff Richards copy. Through Warren Marc gained an audition at EMI in February 1965, but to no effect.|Of the much discussed 'bisexual side' to Marc, Warren recalled that at the time, in the 'hipster scene' he and Marc now frequented \"He went to bed with everyone because everyone did in those days \u0085 People were into beauty and Mark was young and very pretty. Many people enjoy taking young men out to dinner; there doesn't have to be anything sexual about it. You didn't need money if you were a pretty boy in the right part of London in the sixties. If you had a modicum of talent, and you were persistent, you could get the break very easily\".|By the Spring of 1965 Marc had, through Warren met Riggs O'Hara, a serious and successful actor. Marc's horizons were expanded as O'Hara introduced him to London's swinging elite, whisking him to first nights and restaurants, in his car complete with on-board record player! Marc moved in with O'Hara and his flatmate James Bolam (of Likely Lads fame).|The Wizard - Riggs O'Hara|Seemingly unconnected with 'Riggs O'Hara' was the story Marc told of having spent time with a wizard who gave him secret knowledge in France. In early accounts, these included sacrificed live cats, eating human flesh, and other wild flights of fancy. He claimed to have been in France for months when the whole trip was actually a weekend. It is widely know that 'The Wizard' was 'Riggs O'Hara' and O'Hara's memories are somewhat tamer. Interestingly, Marc's first single release would be entitled 'The Wizard'. Of course, as O'Hara was older than Marc, he no doubt did learn some 'secret knowledge' during that weekend. As for mystical? It was Marc's first ever trip outside England so on that level it was.|In 1965, O'Hara recalled that Marc \"wasn't doing gigs when I knew him\". As Mark Feld, Marc had toyed with other names including 'Toby Tyler' taken from a Disney character who ran joined a circus and found fame, 'Riggs' (O'Hara's first name) before settling on 'Bolan'. One train of thought is that he took the name 'Bolan using 'Bo' from 'Bob' and 'lan' from Dylan. However James Bolam was convinced that his name was the source of Marc's new surname. He was not amused. However, it may be that he took his name from the French fashion designer of the day Marc Bohan.|After a brief stint back home Marc moved into a flat with Mike Pruskin, who became Marc's publicist. The rent on the flat was paid by an older man, Geoffrey. In October 1965 Pruskin was able to secure an article in the Evening Standard where Marc stated|\"The prospect of being a materialist idol for four years does appeal\".|Marc's hope of being the 'British Bob Dylan' were dashed when Donavan's first single reached the top five, but he was still Dylan influenced in singing style and dress. In August 1965 Marc was offered a one record deal with Decca Records. The single 'The Wizard' was released in November 1965 and despite several TV appearances it bombed. Decca's press release for the Wizard single read:|\"Marc Bolan was born in September 1947. After 15 years had passed he traveled to Paris and met a black magician called The Wizard, He lived for 18 months in The Wizard's chateau with Achimedies, an owl, and the biggest, whitest Siamese cat you ever saw. He then felt the need to spend some time alone so he made his way to woods, near Rome. For two weeks he strove to find himself and then he returned to London where he began to write. His writings mirror his experiences with mentionings of the magician's pact with the great god Pan. In London, walking down Kings Road, Chelsea in the dead of night, he chanced to meet a girl named Lo-og who gave him a magic cat. This cat, named after the girl, is now his constant companion and is a source of inspiration to him. Now The Wizard's tale is set down for all to hear on Marc's first recording for Decca.\"|A second single The Third Degree' in June 1966 suffered a similar fate. Once again Marc moved home and began writing inspired by Tolkien and C.S. Lewis.|Late in 1966 Marc contacted Simon Napier-Bell and minutes later arrived on his doorstep, with his guitar because he didn't have a demo tape, but could perform for him live. Napier Bell, with his delight in pretty young things could not have failed to be impressed by this cheeky seventeen your old street urchin, still sporting the 'East End' accent Marc would so carefully lose within a couple of years. Napier Bell loved being charmed and Marc could be very charming when he needed to be. Napier-Bell became his manager and eventually Napier-Bell used his contacts, as manager of The Yardbirds, to get Marc his third single release: \"Hippy Gumbo\" with Parlophone.|At the time, despite Marc's self confidence, Napier-Bell remembers that \"his guitar playing was appalling \u0085 he was absolutely unaware of his shortcomings\". Marc appeared on|'Ready Steady Go'|but television exposure failed to convert to record sales and \"Hippy Gumbo\" too failed to make an impact. One review read \"a crazy mixture of an incredibly bad Negro blues singer and Larry the Lamb'.|Napier Bell's Book \"You don't have to say you love me\" (see right) has some interesting recollections of his time with Marc.|1967 - A 'stint' with John's Children|In 1967 Napier Bell decided his singing voice was 'un-saleable' as lead vocals. He placed Marc in the tough flower children/Mod band 'John's Children' song writing, guitar and singing backing vocals. That way Napier Bell deduced, the public could get used to Marc's 'Larry the Lamb' vocals in 'snippets'. Napier-Bell admits \"I knew 'John's Children' were about to succeed and I knew I couldn't sell Marc's voice to the public\". Marc was playing a Gibson SG at the time (1967) and, according to Chris Townson of the band, \"His first rehearsal with us was deafening, even by our standards! I think the band got worse when Marc first joined, because all he did was stand there and make this messy blurge. It was so bad, that I used to sneak round before a gig and retune his guitar ... He seemed to think it didn't matter.\" John's Children had some success as a live band but sold few records. Marc was only in the band a few months although he penned several of their popular songs (including the infamous 'banned by the BBC' single Desdemona'). While Marc was in 'John's Children' they played at the|'All-night 14 Hour Technicolor Dream concert'|at Alexandra Palace, alongside 'Pink Floyd', 'The Crazy World of Arthur Brown', 'the Deviants', and 'the Soft Machine'. 'John's Children' initially decided to perform with no clothes on, but changed their mind and tried to make a happening instead. Andy Ellison screamed and threw feathers everywhere, Chris Townson demolished his drum kit, and Marc walked around with guitar on his head, producing endless feedback. Not exactly a musical performance then!|But Marc wanted to be in his own band, not singing backing vocals in someone else's band! 'John's Children' supported 'The Who' and spent time on stage smashing up equipment and whirling metal chains round above their heads causing the audience to back away in terror. In a bid to outdo the headliners, The bill for destroyed equipment came to £25,000, which was a LOT of money in 1967! Lead singer Andy Ellison recalls that for the first few performances Marc was drunk on stage. It seems he'd needed wine to steady his nerves.|Go on to The Tyrannosaurus Rex Years|BACK TO TAG'S MARC BOLAN & T-REX INFORMATION PAGES"
        ],
        "image_links": [
          "http://www.marc-bolan.net/DONATE.png",
          "bolan-2022-2.jpg",
          "http://www.marc-bolan.net/EBAY-FOR-CHARITY.png",
          "http://www.marc-bolan.net/FACEBOOK-NEW-2.jpg",
          "http://www.marc-bolan.net/FACEBOOK-NEW-4.jpg",
          "http://www.marc-bolan.net/images/BAR-2-HIGH.gif",
          "http://www.marc-bolan.net/images/BAR-2-HIGH.gif",
          "http://www.marc-bolan.net/ots.jpg",
          "http://www.marc-bolan.net/BILLY.jpg",
          "early-marc-1.jpg",
          "http://www.marc-bolan.net/DONATE.png",
          "bolan-2022-2.jpg",
          "http://www.marc-bolan.net/EBAY-FOR-CHARITY.png",
          "http://www.marc-bolan.net/FACEBOOK-NEW-2.jpg",
          "http://www.marc-bolan.net/FACEBOOK-NEW-4.jpg",
          "http://www.marc-bolan.net/images/BAR-2-HIGH.gif",
          "http://www.marc-bolan.net/images/BAR-2-HIGH.gif",
          "http://www.marc-bolan.net/ots.jpg",
          "http://www.marc-bolan.net/BILLY.jpg",
          "early-marc-1.jpg",
          "http://www.marc-bolan.net/DONATE.png",
          "bolan-2022-2.jpg",
          "http://www.marc-bolan.net/EBAY-FOR-CHARITY.png",
          "http://www.marc-bolan.net/FACEBOOK-NEW-2.jpg",
          "http://www.marc-bolan.net/FACEBOOK-NEW-4.jpg",
          "http://www.marc-bolan.net/images/BAR-2-HIGH.gif",
          "http://www.marc-bolan.net/images/BAR-2-HIGH.gif",
          "http://www.marc-bolan.net/ots.jpg",
          "http://www.marc-bolan.net/BILLY.jpg",
          "early-marc-1.jpg",
          "http://www.marc-bolan.net/DONATE.png",
          "bolan-2022-2.jpg",
          "http://www.marc-bolan.net/EBAY-FOR-CHARITY.png",
          "http://www.marc-bolan.net/FACEBOOK-NEW-2.jpg",
          "http://www.marc-bolan.net/FACEBOOK-NEW-4.jpg",
          "http://www.marc-bolan.net/images/BAR-2-HIGH.gif",
          "http://www.marc-bolan.net/images/BAR-2-HIGH.gif",
          "http://www.marc-bolan.net/ots.jpg",
          "http://www.marc-bolan.net/BILLY.jpg",
          "early-marc-1.jpg"
        ]
      }
    }
  }
}