{
  "Marc Bolan": {
    "Stoke Newington": {
      "https://www.hackneycitizen.co.uk/2017/09/15/marc-bolan-hackney-childhood/": {
        "title": "Born to boogie – a look at Marc Bolan's early life in Hackney",
        "text": "15 Sept 2017 — Bolan pioneered glam rock with T-Rex (Formerly Tyrannosaurus Rex) inspiring a ... In 1947, Stoke Newington was only just recovering from the ...",
        "google search terms": [
          "Stoke Newington",
          "T Rex",
          "Tyrannosaurus Rex",
          "Hackney",
          "Jewish"
        ],
        "image search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld",
          "Rolan",
          "Bolan",
          "Newington",
          "dyslexia",
          "Glam Rock",
          "Jewish",
          "songwriter"
        ],
        "page search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld"
        ],
        "page_text_snippets": [
          "Share on WhatsApp|Skip to content|Home|Features|Message privately|Stay connected|Build community|Express yourself|WhatsApp for business|Privacy|Help Center|Blog|For Business|Download|Terms & Privacy Policy|2023 © WhatsApp LLC|Azərbaycan|Afrikaans|Bahasa Indonesia|Melayu|Català|čeština|Dansk|Deutsch|Eesti|English|Español|Français|Gaeilge|Hrvatski|Italiano|Kiswahili|Latviešu|Lietuvių|Magyar|Nederlands|Norsk bokmål|O‘zbek|Filipino|Polski|Português (Brasil)|Português (Portugal)|Română|Shqip|Slovenčina|Slovenščina|Suomi|Svenska|Tiếng Việt|Türkçe|Ελληνικά|български|қазақ тілі|македонски|русский|српски|українська|עברית|العربية|فارسی|اردو|বাংলা|हिन्दी|ગુજરાતી|ಕನ್ನಡ|मराठी|ਪੰਜਾਬੀ|தமிழ்|తెలుగు|മലയാളം|ไทย|简体中文|繁體中文（台灣）|繁體中文（香港）|日本語|한국어|azərbaycan|Afrikaans|Bahasa Indonesia|Melayu|català|čeština|dansk|Deutsch|eesti|English|español|français|Gaeilge|hrvatski|italiano|Kiswahili|latviešu|lietuvių|magyar|Nederlands|norsk bokmål|o‘zbek|Filipino|polski|Português (Brasil)|Português (Portugal)|română|shqip|slovenčina|slovenščina|suomi|svenska|Tiếng Việt|Türkçe|Ελληνικά|български|қазақ тілі|македонски|русский|српски|українська|עברית|العربية|فارسی|اردو|বাংলা|हिन्दी|ગુજરાતી|ಕನ್ನಡ|मराठी|ਪੰਜਾਬੀ|தமிழ்|తెలుగు|മലയാളം|ไทย|简体中文|繁體中文（台灣）|繁體中文（香港）|日本語|한국어|Features|Message privately|End-to-end encryption and privacy controls.|Stay connected|Message and call for free* around the world.|Build community|Group conversations made simple.|Express yourself|Say it with stickers, voice, GIFs and more.|WhatsApp business|Reach your customers from anywhere.|Privacy|Help Center|Blog|For Business|WhatsApp Web|Download|Send the following on WhatsApp|Continue to Chat|Born to boogie - a look at Marc Bolan's early life in Hackney https://www.hackneycitizen.co.uk/2017/09/15/marc-bolan-hackney-childhood/|Don't have WhatsApp yet?|Download|Looks like you don't have WhatsApp installed!|Download|or|use WhatsApp Web|Download|Download|What we do|Features|Blog|Security|For Business|Who we are|About us|Careers|Brand Center|Privacy",
          "Born to boogie – a look at Marc Bolan’s early life in Hackney – Hackney Citizen|Skip to content|Menu|Sign up to our free newsletter|Digital Edition|Where to find the print newspaper|Get in touch|Advertise with us|Jobs|About us|Support us|How to make a complaint|Privacy policy|Born to boogie – a look at Marc Bolan’s early life in Hackney|By|Hackney Citizen|||Friday 15 September 2017 at 08:27|The three ages of Bolan: the T-Rex frontman, pictured in his Hackney youth, adolescence, and his days of megastardom, on stage for ABC’s|In Concert|in 1973|On 16 September, London will celebrate the life and music of one of its most important musical exports, Marc Bolan, on the 40th anniversary of his untimely death.|Bolan pioneered glam rock with T-Rex (Formerly Tyrannosaurus Rex) inspiring a multitude of legendary artists including David Bowie (‘Lady Stardust’ was partly written about Bolan and supposedly had the working title ‘A Song For Marc’), and leaving behind him a trail of cosmic rock, including some of the greatest albums and songs ever created. Pubs and venues across the city are hosting nights in tribute to the electric warrior himself – but it all began right here in Hackney.|Born Mark Feld (it would be 10 years until he changed his name to Marc Bolan) on 30 September 1947 in Hackney General Hospital, Mark spent his childhood living at 25 Stoke Newington Common with his mother Phyllis, dad Simeon and brother Harry. In 1947, Stoke Newington was only just recovering from the effects of WW2 and was hardly the place anyone would expect a man who would come to reinvent the word flamboyant to be brought up.|Mark and his brother attended|Northwold School|, where he was to form his first group, a skiffle band, at the age of nine. Bolan also played guitar in Susie and the Hula Hoops during his time at Northwold, an experience he obviously felt was important to his success, often mentioning it during interviews at the height of his fame.|Northwold Primary School. Photograph: Josh Loeb",
          "|It was in his Stoke Newington abode, where Mark was to be exposed to rock ‘n’ roll for the first time, that he had been initially disappointed when his dad brought home Bill Haley’s ‘Rock Around The Clock’ (instead of the Bill Hayes record he had asked for). As the needle hit the groove, however, almost instantly he was converted, later claiming “just one play of that and I chucked Bill Hayes out of the window”.",
          "|His new found love would bring him to the Hackney Empire, where he would go to watch recordings of the television music programme Oh Boy. It was at the Empire where 13 year old Mark was to meet his hero, Eddie Cochrane, who allowed him to carry his guitar out to the awaiting limousine after the show.",
          "|Once Mark became Marc he wasted no time paying tribute to his hero, having his Les Paul refinished in orange to pay homage to the guitar he carried out of the Empire at the age of 13, and also regularly covering ‘Summertime Blues’.",
          "|Before creating the movement that came to define the early 70s, Mark was busy helping to build the foundations of a much earlier one, the mods. Mark joined a modelling agency, and was shown in a photo shoot for Town magazine as a perfect example of the Mod movement that was sweeping across Stamford Hill and around Britain.",
          "|At the age of 15 Mark left William Wordsworth Secondary School, and Hackney all together, moving to Wimbledon."
        ],
        "image_links": [
          "https://www.hackneycitizen.co.uk/wp-content/uploads/marcbolan-620.jpg",
          "https://www.hackneycitizen.co.uk/wp-content/uploads/marcbolan-620.jpg"
        ]
      }
    }
  }
}