{
  "Marc Bolan": {
    "T Rex": {
      "https://guitarsexchange.com/en/psych-out/870/the-top-10-songs-of-marc-bolan-t-rex/": {
        "title": "(en) The top 10 songs of Marc Bolan & T. Rex",
        "text": "The top 10 songs of Marc Bolan & T. Rex. By Sergio Ariza. There are musicians always in constant evolution; reinventing themselves every few years to avoid ...",
        "google search terms": [
          "Stoke Newington",
          "T Rex",
          "Tyrannosaurus Rex",
          "Hackney",
          "Jewish"
        ],
        "image search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld",
          "Rolan",
          "Bolan",
          "Newington",
          "dyslexia",
          "Glam Rock",
          "Jewish",
          "songwriter"
        ],
        "page search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld"
        ],
        "page_text_snippets": [
          "(it) The top 10 songs of Marc Bolan & T. Rex|Guitars Exchange|Compra e Vendi|Compra|Vendi|Unplugged|Leggende|JukeBox|Interviste|Tutti|Videos|Psych-out|In The Style Of...|Liutai|Live!|Guitar-Bazaar|Tutti|Tweets ’n’ Shout|Account|Login|Registrati!|En|Es|It|Ricerca|Marc Bolan & T. Rex: le 10 migliori canzoni|Di Sergio Ariza|Ci sono musicisti che sono sempre in evoluzione, che si reinventano ogni pochi anni per non rimanere fermi, sono musicisti camaleontici come|Miles Davis|, i|Beatles|o|David Bowie|, ce ne sono altri, invece, che trovano il loro sound e cercano di esservi fedeli il più possibile durante il resto della loro carriera, da questo lato stiamo parlando di persone come|Chuck Berry|, i|Ramones|o gli|AC/DC|.|Marc Bolan|è un caso strano, perché ideologicamente sembra più uno dei primi (parliamo di uno che ha iniziato come Mod, è diventato un cantautore hippie ed è riuscito a diventare Re del Glam), ma in realtà è molto più vicino ai secondi, con due specialità a cui è sempre stato fedele, il suo irresistibile boogie e le sue ballate acustiche. Con quei pochi ingredienti è riuscito a realizzare alcune delle migliori canzoni degli anni '70. Da|Guitars Exchange|vogliamo festeggiare il suo compleanno ricordando le nostre 10 canzoni preferite dalla sua, purtroppo, breve carriera.|Get It On (Bang A Gong)|La semplicità è la chiave per il miglior rock & roll e questa mitica canzone ne è una buona prova. Un giorno Marc Bolan stava scherzando con|Little Queenie|di Chuck Berry quando gli venne in mente uno di quei riff semplici ma efficaci che erano il suo marchio di fabbrica, cominciò a cantare la prima cosa che gli venne in mente, \"|Get It On, Bang A Gong|\", era assurdo ma nella sua voce sexy sembrava indecente, Più che un semplice ritornello, era un totale invito alla sfrenata dissolutezza, i cori degli indispensabili|Flo & Eddie|,|Howard Kaylan|e|Mark Volman|dei|Turtles|, avrebbero fatto il resto, e|Get It On|, in cui suonava ancora la sua Stratocaster bianca (anche se in Top Of The Pops uscì con la sua Flying V), sarebbe diventato lo zenit della carriera dei",
          "(es) Marc Bolan|Guitars Exchange|Compra y Vende|Compra|Vende|Unplugged|Leyendas|JukeBox|Entrevistas|Todos|Videos|Psych-out|Al Estilo De...|Luthieres|Live!|Guitar-Bazaar|Todos|Tweets ’n’ Shout|Mi Cuenta|Login|Regístrate!|En|Es|It|Búsqueda|El rey del Glam|Por Sergio Ariza|El mejor rock and roll siempre se ha\r\nconstruido sobre espectaculares riffs y estribillos adictivos, desde \"|Go, Johnny, Go|\" hasta \"|No Future, no future, no future for you|\"\r\npasando por \"|Talking about My\r\nGeneration|\" o \"|Get It On, Bang\r\nA Gong, Get It On|\".|Marc Bolan|sabía lo suyo sobre eso, puede que su técnica como guitarrista dejara mucho que\r\ndesear pero su Les Paul Custom era puro rock and roll, volviendo a traer\r\nla energía, sencillez y diversión pura de los pioneros de los 50 al rock de\r\ncomienzos de los 70, esta vez con un poco de maquillaje, haciendo que a los\r\nadolescentes les volviera a afectar “|la\r\nneumonía del rock y la gripe del boogie woogie|”.|Mark\r\nFeld|, que así se llamaba, siempre supo que sería una\r\nestrella, como escribiría más adelante en|Cosmic\r\nDancer|: \"|Salí bailando fuera del\r\nútero ¿Es extraño bailar tan pronto?\".|Nació en Londres un 30 de\r\nseptiembre de 1947, ya de niño su familia le tenía como alguien muy especial,\r\npor lo que no es de extrañar que cuando vio|The\r\nGirl Can´t Help It|y descubrió a|Little\r\nRichard|y|Eddie Cochran|su madre\r\nno dudara en comprarle una guitarra. Con 12 años ya tenía su propia banda, un\r\naño después vestía con trajes hechos a medida e iba por su cuenta a ver a sus\r\nartistas favoritos. El que más ilusión le hizo fue el propio Cochran, al que\r\nesperó a la salida, llevando su mítica Gretsch 6120 naranja hasta el coche.|Pero la carrera de Feld no había hecho sino\r\nempezar. Fue dando bandazos hasta encontrar su sitio. En agosto de 1965\r\nconsiguió su primer contrato discográfico y adoptó el nombre por el que sería\r\nrecordado, Marc Bolan. Sacó un par de singles sin mucho éxito y al año\r\nsiguiente se plantó con su guitarra en casa de|Simon Napier-Bell",
          "|Poco después se compró una Les Paul de finales\r\nde los 50 y en verano grabó lo que iba a ser su siguiente disco, en cuya\r\nportada aparecería. En esas sesiones grabó|Ride\r\nA White Swan|, con su Stratocaster grabada con un fuerte eco, recordando a\r\nlos primeros discos de|Elvis|en Sun\r\nRecords. Visconti añadió una pequeña sección de cuerda y le prestó su bajo\r\nFender Precission. Aparecería publicada bajo el nombre acortado de la banda,|T. Rex|.|En enero de 1971, tres meses después de ser\r\npublicada,|Ride A White Swan|subió\r\nhasta el número 2 de las listas. Bolan había actuado con rapidez y para ese\r\nmomento ya había fichado a|Steve Currie|al bajo. Ese mismo mes Bolan y Visconti volvieron al estudio para grabar su\r\ncontinuación, esta vez Visconti trajo un batería,|Bill Legend|, y a los ex|Turtles|,|Howard Kaylan|y|Mark Volman|para hacer los coros. Bolan llevaba la canción\r\nadecuada,|Hot Love|, y el sonido T.\r\nRex estaba a punto de quedar inmortalizado. Suntuosas cuerdas, la voz más sexy\r\nde todos los tiempos, guiños al rock & roll de los 50 y unos estribillos\r\nque se pegaban como chicle. En marzo subió hasta el número uno de las listas y\r\nMarc Bolan apareció en el|Top Of The Pops|con su Les Paul, unas gotas de brillo en sus mejillas y una camisa de satén\r\nverde. Había nacido el Glam Rock.|Ese mismo mes la banda se marchó a EEUU para\r\nuna gira. En unas jornadas mágicas graban|Jeepster,\r\nMonolith|y Bolan les enseña|Get It On|,\r\ncuando vuelven a Inglaterra, con el material suficiente para el esperado nuevo\r\ndisco,|Hot Love|sigue en lo más alto\r\nde la lista de singles, seis semanas después. Ha comenzado la|T. Rextasy|, la fiebre que contagiaría al\r\nReino Unido durante los dos siguientes años, haciendo de T. Rex lo más parecido\r\na los Beatles desde los lejanos días de la|Beatlemanía|.|Si el rock and roll había perdido la\r\nefervescencia de sus inicios y las ganas de divertirse, Bolan y sus T. Rex la\r\niban a traer de vuelta. Su siguiente single,|Get It On|, se convertirá en el himno oficial del movimiento y en su\r\nsegundo número uno consecutivo. Para que queden claros sus referentes, Bolan\r\nadmitirá que le salió mientras tocaba el|Little\r\nQueenie|de|Chuck Berry|. La canción se\r\nincluiría en|Electric Warrior|, su\r\nprimera obra maestra, y el disco más vendido del año en Reino Unido. El\r\nGuerrero Eléctrico había llegado a la cima y Marc Bolan ya era lo que siempre\r\nhabía sabido, una estrella. Exultante comienza a utilizar altos sombreros de\r\ncopa, bufandas de boas de plumas... Su música combina un ritmo básico, que\r\nalgunos comenzarán a llamar|'Bolan´s\r\nBoogie'|, con maravillas acústicas, potenciadas por las cuerdas de Visconti.\r\nPara redondear el año en EEUU|Get It On|alcanza el top ten de las listas y T. Rex se convertirá en referencia de la\r\nescena Glam americana, como los|New York\r\nDolls|.|Llegamos a 1972, el año en el que el Glam\r\ndomina el Reino Unido y T. Rex reina en el movimiento.|Ringo Starr|, fan confeso de Bolan, le pide permiso para grabar los\r\ndos conciertos del grupo en el Wembley Empire Pool para marzo (unos conciertos\r\nque terminaban con una versión de su adorado Cochran, claro que a la persona a\r\nla que seguía adorando por encima de todas era a sí mismo, no en vano salió al\r\nescenario con una camiseta con su propio rostro). En esa época las ventas de\r\ndiscos de T. Rex en el Reino Unido suponían el 6% del total de la industria. ¡6\r\nde cada 100 discos que se vendían eran de Bolan! Aprovecha para marcharse a EMI\r\ny crear su propia compañía de discos. A lo largo del año,|Telegram Sam|y|Metal Guru|,\r\ndos increíbles himnos, serán números 1 en la listas de singles y|Children Of The Revolution|y|Solid Gold Easy Action|se quedan a las\r\npuertas de serlo. Además se publica su segunda obra maestra consecutiva,|The Slider|, se hace una reedición de sus\r\ndos primeros discos que se cuela en el número uno, donde le sucedería|Bolan Boogie|, un recopilatorio de su\r\nantigua compañía.|Por si fuera poco el 14 de diciembre se\r\nestrena la película de Ringo,|Born to\r\nBoogie|(donde aparece tocando una Gibson Hummingbird en la casa de|Lennon|) y|David Bowie|escribe el himno\r\ndefinitivo del Glam con|All The Young\r\nDudes|. Su letra no podía dejar más claro el signo de los tiempos: \"|El hombre de la televisión está como loco\r\ndiciendo que somos desechos y delincuentes juveniles, pero ¿para qué quiero\r\ntelevisión cuando tengo a T. Rex?\".|Pero sería precisamente su amigo Bowie quien\r\nacabaría destronándole y poniendo fin al movimiento. 1973 confirmaría esto, ese\r\naño seis discos de Bowie aparecieron en las listas y fue el artista más vendido\r\ndel año. A pesar de este ‘sorpasso’, Bolan seguía en forma como prueban dos de\r\nsus mejores canciones|20th Century Boy|,\r\ncon uno de los mejores riffs de la historia, y|The Groover|, número 3 y 4, y|Tanx|un disco en el que Bolan mantenía el nivel de|Electric Warrior|y|The Slider|,\r\ncompletando su trilogía más representativa. No estaba nada mal, pero para\r\nalguien con el ego de Bolan, su autoestima se veía afectada. Para colmo el 3 de\r\njulio del 73 Bowie mató a|Ziggy Stardust|,\r\nsu alter ego glam y muchos lo vieron como punto final. No ayudó que el\r\nsiguiente disco de Bolan,|Zinc Alloy and\r\nthe Hidden Riders of Tomorrow|, fuera visto como una copia del|The Rise and Fall of Ziggy Stardust and the\r\nSpiders from Mars|. Su narcisista personalidad sufrió un severo golpe y lo\r\npagó bebiendo, comiendo y tomando drogas en exceso. En poco tiempo el\r\nresplandeciente rey del glam se había convertido en una caricatura de sí mismo,\r\nengordando y siendo casi olvidado. Bolan había vivido una especie de versión\r\nreducida de la carrera de Elvis Presley, con una decadencia artística, física y\r\nde repercusión similar.|Pero tras el nacimiento de su hijo, comenzó a\r\nponerse en forma otra vez, perdiendo peso y dejando drogas y comida basura. Musicalmente\r\nvio en el surgimiento del punk una reivindicación a su obra. Mientras el resto\r\nde estrellas de rock huían de la nueva generación, Bolan decidió llevarse de\r\ngira a|The Damned|. Verse a sí mismo\r\ncomo el 'Padrino del punk' volvió a hacer maravillas por su autoestima y|Dandy In The Underworld|fue el mejor\r\ndisco que sacaba desde|Tanx|. Además\r\nla cadena de televisión Granada le ofreció un programa de televisión, a la hora\r\nde|Barrio Sésamo|, simplemente\r\ntitulado|Marc|. Fue allí donde el Glam\r\nvivió su epílogo. El 7 de septiembre de 1977 hizo su aparición en el show su\r\namigo Bowie. Convertido en una estrella internacional interpretó una de sus\r\nmejores canciones|Heroes|, luego Marc\r\nsubió al escenario para interpretar juntos \"|una nueva canción|\". Las dos más grandes estrellas del glam\r\ncomenzaron a tocar el riff de|Roadrunner|y de repente fue como si estuviésemos otra vez en 1972. Pero a la historia le\r\ngusta jugar con la ironía y cuando Bolan se acercó al micro para cantar se\r\ntropezó y desapareció del plano. Bowie se quedó solo en la cima. El programa\r\ntenía tan poco presupuesto que no se hizo otra toma y se quedó con esta. Bolan\r\nnunca la llegaría a ver emitida.|El 16 de septiembre de 1977, un mes después\r\ndel rey del rock, moría en un accidente de tráfico el verdadero rey del Glam,\r\nen cuatro años había pasado de ser los nuevos Beatles a presentar un programa\r\ninfantil de televisión. Pero por lo menos vio como la llama que había prendido\r\nen el rock, de vuelta a la sencillez y a la diversión de los primeros tiempos, enganchaba\r\na una nueva generación y estilo, el punk. Eso sí, no llegó a ver como cada\r\nbanda de rock posterior, de|U2|a|Oasis|, pasando por|R.E.M.,|Nirvana|o|Guns N’ Roses|, no se ha podido resistir\r\na su Boogie.|Galería de foto|©CordonPress|Selección de Videos|TYRANNOSAURUS REX      \" Debora \"|T - Rex    - Summertime Blues|T. Rex - Telegram Sam|T Rex - Ride A White Swan - Paris 1971|Marc Bolan T Rex Born to Boogie Ringo Starr Documentary ORIGINAL AND UNCUT (Part 5)|T.Rex \" Buick Mackane \" Live Studio 1973 Germany|T.Rex  \" Cadillac \"|Marc Bolan and David Bowie Marc Show 1977|T. Rex - Bang A Gong (get It On) Top of the pops 1971 (Video)|Marc Bolan & T. Rex - Children Of The Revolution (1972)|T.Rex 20th Century Boy|Guitars Exchange te recomienda|David Bowie - The rise and fall of Ziggy Stardust and the spiders from mars (1972)|Un mundo sin Gibson no es un mundo mejor|Las 10 mejores canciones de Marc Bolan y T. Rex|Guitars Exchange|Quiénes somos|Nuestra misión|Condiciones de uso|Política de Privacidad|Contacto|Nuestros últimos tuits:|Encuéntranos también en:|Facebook|Instagram|Spotify|Pinterest|Google Plus|YouTube",
          "(es) The top 10 songs of Marc Bolan & T. Rex|Guitars Exchange|Compra y Vende|Compra|Vende|Unplugged|Leyendas|JukeBox|Entrevistas|Todos|Videos|Psych-out|Al Estilo De...|Luthieres|Live!|Guitar-Bazaar|Todos|Tweets ’n’ Shout|Mi Cuenta|Login|Regístrate!|En|Es|It|Búsqueda|Las 10 mejores canciones de Marc Bolan y T. Rex|Por Sergio Ariza|Hay músicos siempre en constante evolución, reinventándose cada pocos años para evitar quedar estancados, son músicos camaleónicos como|Miles Davis|, los|Beatles|o|David Bowie|, hay otros, en cambio, que encuentran su sonido y tratan de ser lo más fiel a él durante el resto de su carrera, en este bando hablamos de gente como|Chuck Berry|, los|Ramones|o|AC/DC|.|Marc Bolan|es un extraño caso, ya que ideológicamente parece más un caso de los primeros (estamos hablando de alguien que empezó siendo Mod, pasó a ser cantautor hippie y triunfó como Rey del Glam), pero que en la realidad está mucho más cerca de estos últimos, con dos especialidades a las que siempre fue fiel, su irresistible boogie y sus baladas acústicas. Con esos pocos mimbres fue capaz de sacar petróleo con algunas de las mejores canciones de la década de los 70. Desde|Guitars Exchange|queremos recordar la fecha de su cumpleaños rescatando nuestras 10 canciones favoritas de su, tristemente, corta carrera.|Get It On (Bang A Gong)|La simplicidad es la clave del mejor rock & roll y esta mítica canción es una buena prueba de ello. Un día Marc Bolan estaba tonteando con el|Little Queenie|de Chuck Berry cuando le salió uno de esos riff tan simples pero tan efectivos que eran su marca, comenzó a cantar lo primero que se le pasó por la cabeza, \"|Get It On, Bang A Gong|\", era absurdo pero en su voz sexy sonaba indecente, más que un estribillo era una invitación total al desenfreno, los coros de los imprescindibles|Flo & Eddie|,|Howard Kaylan|y|Mark Volman|de los|Turtles|, pondrían el resto, y|Get It On|, en la que todavía tocaba su Stratocaster blanca (aunque en el Top Of The Pops salió con su Flying V), se convertiría en el cénit de la carrera de",
          "(it) Marc Bolan|Guitars Exchange|Compra e Vendi|Compra|Vendi|Unplugged|Leggende|JukeBox|Interviste|Tutti|Videos|Psych-out|In The Style Of...|Liutai|Live!|Guitar-Bazaar|Tutti|Tweets ’n’ Shout|Account|Login|Registrati!|En|Es|It|Ricerca|Il re del Glam|Di Sergio Ariza|Il miglior rock and roll si è sempre costruito su\r\nspettacolari riff e ritornelli che creavano dipendenza, da \"|Go, Johnny, Go|\" a \"|No Future, no future, no future for you|\"\r\npassando per \"|Talking About My\r\nGeneration|\" o \"|Get It On|,|Bang A Gong, Get It On|\".|Marc Bolan|ne sapeva qualcosa a\r\nriguardo, forse la sua tecnica come chitarrista lasciava molto a desiderare ma\r\nla sua Les Paul Custom era puro rock and roll, capace di riportare l'energia,\r\nla semplicità e il puro divertimento dei pionieri degli anni '50 al rock\r\ndell'inizio del gli anni '70, questa volta con qualche trucco, facendo sì che i\r\nragazzi fossero colpiti di nuovo dalla \"|polmonite del rock e l'influenza del boogie woogie|\".|Mark Feld|, questo\r\nil suo vero nome, ha sempre saputo che sarebbe stato una star, come scrisse più\r\ntardi in|Cosmic Dancer|: \"|Uscii ballando dall’utero, è strano ballare\r\nda così presto?|\". Nato a Londra il 30 settembre 1947, fin da bambino\r\nla sua famiglia lo considerò un tipo molto speciale, quindi non c'è da\r\nmeravigliarsi se quando vide|The Girl\r\nCan’t Help It|e scoprì|Little\r\nRichard|e|Eddie Cochran|sua\r\nmadre no esitò a comprargli una chitarra. All'età di 12 anni aveva già una sua\r\nband, un anno dopo indossava abiti su misura e andava da solo a vedere i suoi\r\nartisti preferiti. Cochran, che aspettò all’uscita di un locale, lo rese felice\r\nquando gli fece portare la sua mitica Gretsch 6120 arancione fino alla\r\nmacchina.|Ma la carriera di Feld era appena iniziata con alti e bassi\r\nfinché trovò un posto tutto suo. Nell'agosto del 1965 ottenne il suo primo\r\ncontratto discografico e adottò il nome con cui sarebbe stato ricordato, Marc\r\nBolan. Pubblicò un paio di singoli senza molto successo e l'anno successivo si\r\npiantò con la sua chitarra a casa di",
          "|può essere considerato\r\nil punto di svolta della sua carriera, con|Elemental\r\nChild|e i suoi richiami a|Hendrix|.|Poco dopo comprò una Les Paul della fine degli anni '50 che\r\nsarebbe apparsa sulla copertina dell’album che incise quell’estate.|Ride A White Swan|fu frutto di quelle\r\nsessioni, con la sua Stratocaster registrata con una forte eco, ricordando i\r\nprimi album di|Elvis|per la Sun\r\nRecords. Visconti aggiunse una piccola sezione di archi e gli prestò il suo\r\nbasso Fender Precision. Il pezzo uscì sotto il nome abbreviato della band,|T. Rex|.|Nel gennaio del 1971, tre mesi dopo la sua pubblicazione,|Ride A White Swan|raggiunse il secondo\r\nposto delle classifiche. Bolan fu rapido e per quel momento aveva già contrattato|Steve Currie|al basso. Nello stesso\r\nmese Bolan e Visconti tornarono in studio per registrare la continuazione,\r\nquesta volta Visconti portò un batterista,|Bill\r\nLegend|, e agli ex|Turtles|,|Howard Kaylan|e|Mark Volman|per i cori. Bolan aveva la canzone giusta,|Hot Love|, e il suono di T. Rex stava per\r\nessere immortalato. Chitarre sontuose, la voce più sexy di tutti i tempi, una strizzatina\r\nd'occhio al rock and roll degli anni '50 e alcuni ritornelli che stavano in\r\nbocca come un chewing gum. A marzo arrivò al primo posto nelle classifiche e\r\nMarc Bolan apparse in|Top Of The Pops|con la sua Les Paul, un po’ di trucco sulle sue guance e una camicia di raso\r\nverde. Era nato il Glam Rock.|Quello stesso mese la band partì per un tour negli Stati\r\nUniti. In alcune giornate gloriose incisero|Jeepster|,|Monolith|e Bolan tirò fuori|Get It On|, quando tornarono in\r\nInghilterra, con materiale sufficiente per il nuovo e atteso album mentre|Hot Love|rimase in cima alle classifiche\r\ndei singoli sei settimane dopo. Iniziò la|T.\r\nRextasy|, la febbre che avrebbe infettato il Regno Unito nei due anni\r\nsuccessivi, rendendo i T. Rex la cosa più vicina ai Beatles dai tempi lontani\r\ndella Beatlemania.|Se il rock and roll aveva perso l'effervescenza dei suoi\r\ninizi e la voglia di divertirsi, Bolan e i suoi T. Rex l'avrebbero riportata\r\nindietro. Il singolo che uscì,|Get It On|,\r\ndivenne l'inno ufficiale del movimento e il suo secondo numero uno consecutivo.\r\nPer avere chiari i suoi punti di riferimento, Bolan ammise che la canzone gli\r\nvenne fuori mentre suonava|Little Queenie|di|Chuck Berry|. La canzone la incluse\r\nin|Electric Warrior|, il suo primo\r\ncapolavoro, e l'album più venduto dell'anno nel Regno Unito.|Electric Warrior|raggiunse la vetta e\r\nMarc Bolan era già ciò che aveva sempre desiderato essere, una stella. Esultante,\r\niniziò a utilizzare cappelli a cilindro e boa di piume... La sua musica combinava\r\nun ritmo di base, che alcuni cominciarono a chiamare '|Bolan’s Boogie|', con meraviglie acustiche, alimentate dagli archi di\r\nVisconti. Per chiudere bene l’anno,|Get\r\nIt On|entrò nella top ten degli Stati Uniti e T. Rex diventerà un\r\nriferimento per la scena Glam americana, come lo furono i|New York Dolls|.|Siamo al 1972, l'anno in cui il Glam impazza nel Regno Unito\r\ne i T. Rex regnano nel movimento.|Ringo\r\nStarr|, fan confesso di Bolan, chiese il permesso di registrare i due\r\nconcerti del gruppo al Wembley Empire Pool a marzo (concerti che si concludevano\r\ncon una versione del suo amato Cochran, anche se la persona che adorava più di\r\ntutti era se stesso, non invano uscì sul palco con una maglietta con la propria\r\nfaccia). A quel tempo, le vendite dei dischi di T. Rex nel Regno Unito\r\nrappresentavano il 6% del totale dell'industria. 6 su 100 dischi venduti erano\r\ndi Bolan! Sfruttò l'opportunità per firmare con EMI e creare la sua compagnia\r\ndiscografica. Per tutto l'anno,|Telegram\r\nSam|e|Metal Guru|, due inni\r\nincredibili, saranno i numeri 1 delle classifiche dei singoli mentre|Children Of The Revolution|e|Solid Gold Easy Action|erano sul punto\r\ndi esserlo. Pubblicò|The Slider|, la\r\nsua seconda opera maestra consecutiva, fece una riedizione dei suoi primi due\r\nalbum che arrivò al numero uno, e|Bolan\r\nBoogie|, una raccolta della sua anteriore compagnia.|Come se non bastasse, il 14 dicembre uscì il film di Ringo,|Born to Boogie|(in cui appare suonando\r\nuna Gibson Hummingbird nella casa di Lennon) mentre|David Bowie|scrisse l'inno\r\ndefinitivo del Glam,|All The Young Dudes|.\r\nI suoi testi non potevano rendere più chiaro il segno dei tempi: \"|L'uomo in televisione è pazzo dicendo che\r\nsiamo detriti e giovani criminali, ma perché ho bisogno della televisione\r\nquando ho i T. Rex?|\"|Sarà proprio il suo amico Bowie a spodestarlo e porre fine\r\nal movimento. Il 1973 ne sarebbe stato la conferma: quell'anno entrarono in\r\nclassifica sei album di Bowie e fu l'artista più venduto dell'anno. Nonostante\r\nquesto 'sorpasso,' Bolan era in forma, come evidenziano due delle sue migliori\r\ncanzoni,|20th Century Boy|, con uno\r\ndei migliori riff della storia, e|The\r\nGroover|, che arrivarono al 3º e 4º posto in classifica, e|Tanx|un disco in cui Bolan mantenne il\r\nlivello di|Electric Warrior|e|The Slider|, completando la sua trilogia\r\npiù rappresentativa. Niente male, ma non per uno come Bolan, con quell’ego: la\r\nsua autostima ne risentì. Come colpo di grazia, il 3 luglio Bowie ‘uccise’|Ziggy Stardust|, il suo alter ego glam e\r\nmolti lo videro come il punto finale. Non fu di aiuto il fatto che il\r\nsuccessivo album di Bolan,|Zinc Alloy and\r\nthe Hidden Riders of Tomorrow|, fu visto come una copia di|The Rise and Fall of Ziggy Stardust and the\r\nSpiders from Mars|. La sua personalità narcisistica subì un duro colpo e lo\r\npagò bevendo, mangiando e assumendo droghe in eccesso. In breve tempo lo\r\nsplendido re del glam era diventato una caricatura di se stesso, ingrassato e\r\nquasi dimenticato. Bolan aveva vissuto una sorta di versione ridotta della carriera\r\ndi Elvis Presley, con un declino artistico, fisico e ripercussioni simili.|Dopo la nascita di suo figlio, cominciò a rimettersi in\r\nforma, perdendo peso e lasciando perdere droghe e cibo spazzatura. Musicalmente\r\nvedeva nell'emergere del punk una rivendicazione del suo lavoro. Mentre il\r\nresto delle rockstar fuggirono lontano dalla nuova generazione, Bolan decise di\r\nintraprendere un tour con|The Damned|.\r\nVedendosi come il \"Padrino del punk\", ancora una volta fece\r\nmeraviglie per la sua autostima e|Dandy In\r\nThe Underworld|fu il suo miglior disco dai tempi di|Tanx|. Inoltre, la rete televisiva di Granada gli offrì un programma\r\ntelevisivo, coincidendo con|Barrio Sésamo|,\r\nintitolato semplicemente|Marc|. Fu lì\r\nche il Glam visse il suo epilogo. Il 7 settembre 1977, il suo amico Bowie\r\napparve nello show. Diventato ormai una star internazionale, suonò una delle\r\nsue migliori canzoni,|Heroes|, poi\r\nMarc salì sul palco per suonare insieme \"una nuova canzone\". Le due\r\npiù grandi stelle del glam iniziarono a suonare il riff di|Roadrunner|e improvvisamente era come tornare di nuovo al 1972. Ma alla\r\nstoria piace giocare con ironia e quando Bolan si avvicinò al microfono per\r\ncantare inciampò e scomparve dall’inquadratura. Bowie restò solo sulla cima. Il\r\nprogramma aveva un budget così esiguo che non poterono ripetere la scena. Bolan\r\nnon l'avrebbe mai vista.|Il 16 settembre 1977, un mese dopo il re del rock, morì in\r\nun incidente stradale il vero re del glam. In quattro anni era passato\r\ndall'essere il nuovo Beatle a presentare un programma televisivo per bambini.\r\nMa almeno vide come la fiamma che aveva riacceso nel rock, tornando alla\r\nsemplicità e al divertimento dei primi tempi, conquistò una nuova generazione e\r\nuno nuovo stile, il punk. Non fece in tempo a vedere però come ogni successivo\r\ngruppo rock, dagli|U2|agli|Oasis|, passando per i|R.E.M.|, i|Nirvana|o i|Guns N’ Roses|,\r\nnon hanno potuto resistere al suo Boogie.|Photogallery|©CordonPress|Selezione di Video|TYRANNOSAURUS REX      \" Debora \"|T - Rex    - Summertime Blues|T. Rex - Telegram Sam|T Rex - Ride A White Swan - Paris 1971|Marc Bolan T Rex Born to Boogie Ringo Starr Documentary ORIGINAL AND UNCUT (Part 5)|T.Rex \" Buick Mackane \" Live Studio 1973 Germany|T.Rex  \" Cadillac \"|Marc Bolan and David Bowie Marc Show 1977|T. Rex - Bang A Gong (get It On) Top of the pops 1971 (Video)|Marc Bolan & T. Rex - Children Of The Revolution (1972)|T.Rex 20th Century Boy|Ti potrebbe interessare|David Bowie - The rise and fall of Ziggy Stardust and the spiders from mars (1972)|Un mondo senza Gibson non è un mondo migliore|Marc Bolan & T. Rex: le 10 migliori canzoni|Guitars Exchange|Chi siamo|La nostra missione|Condizioni d'utilizzo|Privacy policy|Contatto|I nostri ultimi tweets:|Seguici anche su:|Facebook|Instagram|Spotify|Pinterest|Google Plus|YouTube",
          "(en) Marc Bolan|Guitars Exchange|Buy ‘n’ Sell|Buy|Sell|Unplugged|Legends|JukeBox|Interviews|All|Videos|Psych-out|In The Style Of...|GuitarMakers|Live!|Guitar-Bazaar|All|Tweets ’n’ Shout|Account|Login|Register|En|Es|It|Search|The king of Glam|By Sergio Ariza|The best rock and roll has always been built\r\non spectacular riffs and addictive hooks, from \"|Go, Johnny, Go|\" to \"|No\r\nFuture, no future, no future for you|\" through to \"|Talking about My Generation\"|or\r\n\"|Get It On, Bang A Gong, Get It On|.\r\n\"|Marc Bolan|knew all about it;\r\nmaybe his technique as a guitarist left a lot to be desired but his Les\r\nPaul C|ustom|was pure rock and roll, bringing the energy, simplicity and pure fun of\r\nthe pioneers of the 50s to rock at the beginning of the 70s, this time with a\r\nlittle glitter, and causing teenagers to be affected again by \"|the rocking pneumonia and the boogie woogie\r\nflu\".|Mark\r\nFeld|was his birth name, and always knew that he would\r\nbe a star, as he would write later in|Cosmic\r\nDancer|: \"|I danced myself right\r\nout the womb, Is it strange to dance so soon?”|He was born in London on\r\nSeptember 30, 1947, and even as a child his family had him down as someone very\r\nspecial, so it's no wonder that when he saw|The\r\nGirl Can’t Help It|and discovered|Little\r\nRichard|and|Eddie Cochran|his mother\r\ndid not hesitate to buy him a guitar. At the age of 12 he already had his own\r\nband, and a year later he wore tailor-made suits and went on his own to see his\r\nfavorite artists. The one that he felt most excited about was Cochran, to whom he\r\nwaited at the exit of the show, taking his mythical Gretsch 6120 orange up to\r\nthe car.|But Feld's career had only just begun. He\r\nlurched a bit until he found his place. In August 1965 he got his first record\r\ncontract and adopted the name by which he would be remembered, Marc Bolan. He\r\nreleased a couple of singles without much success and the following year he turned\r\nup with his guitar at the home of|Simon\r\nNapier-Bell,|one of the most famous managers in the United Kingdom, and\r\ntold him he was going to be a star. Napier-Bell saw potential in him, with his\r\nbeauty, his careful mod image and his songs, and decided to put him in one of\r\nthe bands he managed, like the",
          "|Shortly after he bought a late 50s Les Paul\r\nand in the summer he recorded what was to be his next album, on whose cover the\r\nguitar would appear. In those sessions he recorded|Ride A White Swan|, with his Stratocaster recorded with a strong\r\necho, reminding some of the first|Elvis|albums\r\non Sun Records. Visconti added a small string section and lent him his Fender Precision\r\nbass. The album was then released under the shortened name of the band, T. Rex.|In January 1971, three months after it was\r\nreleased,|Ride A White Swan|climbed\r\nto number 2 in the charts. Bolan had moved quickly and by that time had signed\r\nup|Steve Currie|on bass. That same\r\nmonth Bolan and Visconti returned to the studio to record their follow up, and this\r\ntime Visconti brought a drummer,|Bill\r\nLegend,|and the former|Turtles,\r\nHoward Kaylan|and|Mark Volman|to\r\ndo the backing vocals. Bolan had the right song,|Hot Love,|and the T. Rex sound was about to be immortalized.\r\nSumptuous strings, the sexiest voice of all time, winks at the rock and roll of\r\nthe 50s and some hooks that stuck like chewing gum. In March the song climbed\r\nto number one in the charts and Marc Bolan appeared on the|Top Of The Pops|with his Les Paul, a few drops of glitter on his\r\ncheeks and a green satin shirt. Glam Rock was born.|That same month the band left for the USA for\r\na tour. In a few magical days they recorded|Jeepster,\r\nMonolith|and Bolan taught them|Get It\r\nOn;|when they returned to England, with enough material for the expected\r\nnew album,|Hot Love|remained at the top\r\nof the singles list; six weeks on!|T.\r\nRextasy|has begun, the fever that would infect the United Kingdom during\r\nthe next two years, making T. Rex the closest thing to the|Beatles|since the distant days of|Beatlemania.|If rock and roll had lost the effervescence of\r\nits beginnings and the desire to have fun, Bolan and his T. Rex were going to\r\nbring it back. His next single,|Get It On|,\r\nwould become the official anthem of the movement and their second consecutive\r\nnumber one. So that its referents are clear, Bolan admitted that it came out\r\nwhile he played|Chuck Berry|'s|Little Queenie|. The\r\nsong would be included on|Electric\r\nWarrior|, his first masterpiece, and the best-selling album of the year in\r\nthe United Kingdom. The|Electric Warrior|had\r\nreached the top and Marc Bolan was already what he had always known, a star.\r\nExultant, he began to wear high top hats, feather boas, scarves ... His music\r\ncombines a basic rhythm, which some will begin to call|'Bolan's Boogie'|, with acoustic wonders, enhanced by the Visconti\r\nstrings. To round the year off, in the US|Get\r\nIt On|reaches the top ten in the charts and T. Rex becomes a reference for\r\nthe American Glam scene, like the|New\r\nYork Dolls.|We arrive in 1972, the year in which the Glam\r\ndominates the United Kingdom and T. Rex reigns in the movement.|Ringo Starr|, a self-confessed fan of\r\nBolan, asks permission to record two concerts of the group in the Wembley\r\nEmpire Pool for March (some concerts ended with a cover of his beloved Cochran,\r\nbut of course, the person he still adored most of all was himself; it was not for\r\nnothing that he went on stage with a shirt bearing his own face). At that time,\r\nsales of T. Rex records in the United Kingdom accounted for 6% of the total\r\nindustry. 6 of every 100 records that were sold were from Bolan! He took the\r\nopportunity to leave EMI and creates his own record company. During the year,|Telegram Sam|and|Metal Guru,|two incredible songs, would get to number 1 in the\r\nsingles charts and|Children Of The\r\nRevolution|and|Solid Gold Easy Action|were on the verge of being there too. He also released his second\r\nconsecutive masterpiece,|The Slider|, and\r\na reissue of his first two albums are made that sneak into the number one spot,\r\nwhere it would be succeeded by|Bolan\r\nBoogie|, a compilation by his former company.|As if that were not enough, on December 14,\r\nRingo's film|Born to Boogie|(where he\r\nplays a Gibson Hummingbird at Lennon's house) opens and|David Bowie|writes the definitive\r\nGlam anthem with|All The Young Dudes|.\r\nHis lyrics could not make the sign of the times clearer: \"|The television man is crazy saying we're\r\njuvenile delinquent wrecks, Man I need a TV when I've got T. Rex?\"|But it would be precisely his friend Bowie who\r\nwould end up dethroning him and ending the movement. 1973 would confirm this,\r\nas that year six albums by Bowie appeared in the charts and he was the best-selling\r\nartist of the year. Despite this 'sorpasso', Bolan was still in form as two of\r\nhis best songs prove:|20th Century Boy|,\r\nwith one of the best riffs in history, and|The\r\nGroover|, reaching at numbers 3 and 4, as well as|Tanx,|an album on which Bolan maintained the level of|Electric Warrior|and|The Slider|, and completed his most\r\nrepresentative trilogy. It was not bad, but for someone with Bolan's ego, his\r\nself-esteem was affected. To top it off on July 3, 73 Bowie killed Ziggy\r\nStardust, his glam alter ego and many saw it as the end point of the movemente.\r\nIt did not help that Bolan's next album,|Zinc\r\nAlloy and the Hidden Riders of Tomorrow|, was seen as a copy of|The Rise and Fall of Ziggy Stardust and the\r\nSpiders from Mars.|His narcissistic personality suffered a severe blow and he\r\npaid for it by drinking, eating and taking drugs in excess. In a short time the\r\nresplendent king of glam had become a caricature of himself, getting fat and\r\nbeing almost forgotten. Bolan had lived a kind of reduced version of Elvis\r\nPresley's career, with an artistic, physical and success decline.|But after the birth of his son, he began to\r\nget fit again, losing weight and leaving drugs and junk food behind. Musically\r\nhe saw in the emergence of punk a vindication of his work. While other rock\r\nstars fled from the new generation, Bolan decided to take|the Damned|on tour. Seeing himself as the 'Godfather of punk' once\r\nagain did wonders for his self-esteem, and|Dandy\r\nIn The Underworld|became the best record he released since|Tanx.|In addition, the Granada\r\ntelevision network offered him a television program, at the time of|Sesame Street|, simply titled|Marc|. It was there that Glam lived its\r\nepilogue. On September 7, 1977, his friend Bowie appeared on the show. He had become\r\nan international star and he played one of his best songs|Heroes,|then Marc took the stage to play together \"|a new song.\"|The two biggest glam\r\nstars started playing the|Roadrunner|riff and suddenly it was as if we were back in 1972. But history likes to play\r\nwith irony and when Bolan approached the microphone to sing he stumbled and\r\ndisappeared from the stage. Bowie was left alone at the top. The program had so\r\nlittle budget that no other take was done and it was left with this one. But Bolan\r\nwould never see it broadcast.|On September 16, 1977, a month after the king\r\nof rock, the real king of Glam died in a traffic accident; in four years he had\r\ngone from being ‘the new Beatles’ to presenting a children's television\r\nprogram. But at least he saw how the flame that he had ignited again in rock, returning\r\nto the simplicity and fun of the early days, has hooked with a new generation\r\nand created a new style, punk. However of course, he never lived to see how\r\nevery subsequent rock band, from|U2|to|Oasis,|going through|R.E.M., Nirvana|and|Guns N 'Roses,|has not been able to\r\nresist his Boogie.|Photogallery|©CordonPress|Video Selections|TYRANNOSAURUS REX      \" Debora \"|T - Rex    - Summertime Blues|T. Rex - Telegram Sam|T Rex - Ride A White Swan - Paris 1971|Marc Bolan T Rex Born to Boogie Ringo Starr Documentary ORIGINAL AND UNCUT (Part 5)|T.Rex \" Buick Mackane \" Live Studio 1973 Germany|T.Rex  \" Cadillac \"|Marc Bolan and David Bowie Marc Show 1977|T. Rex - Bang A Gong (get It On) Top of the pops 1971 (Video)|Marc Bolan & T. Rex - Children Of The Revolution (1972)|T.Rex 20th Century Boy|Recommended for you|David Bowie - The rise and fall of Ziggy Stardust and the spiders from mars (1972)|A world without Gibson is not a better world|The top 10 songs of Marc Bolan & T. Rex|Guitars Exchange|About us|Our Mission|Terms of use|Privacy policy|Contact Us|Our latest tweet:|Find us also on:|Facebook|Instagram|Spotify|Pinterest|Google Plus|YouTube",
          "(en) The top 10 songs of Marc Bolan & T. Rex|Guitars Exchange|Buy ‘n’ Sell|Buy|Sell|Unplugged|Legends|JukeBox|Interviews|All|Videos|Psych-out|In The Style Of...|GuitarMakers|Live!|Guitar-Bazaar|All|Tweets ’n’ Shout|Account|Login|Register|En|Es|It|Search|The top 10 songs of Marc Bolan & T. Rex|By Sergio Ariza|There are musicians always in constant evolution; reinventing themselves every few years to avoid getting stuck. These include chameleon musicians like|Miles Davis,|the|Beatles|and|David Bowie|; but there are others, instead, who find their sound and try to be as faithful to it as they can for the rest of their career. On this side of the quation are people like|Chuck Berry|, the Ramones|and|AC/DC|.|Marc Bolan|is a strange case, since ideologically he seems more like one of the former (we are talking about someone who started as Mod, became a hippie singer-songwriter and succeeded as King of Glam), but in reality he is much closer to the latter, with two specialties to which he was always faithful: his irresistible boogie and his acoustic ballads. With those few ‘strands of wicker’ he was able to produce some of the best songs of the 70's. From|Guitars Exchange|we want to remember the date of his birthday by recalling our 10 favorite songs from his, sadly, short career.|Get It On (Bang A Gong)|Simplicity is the key to the best rock & roll, and this mythical song is good proof of it. One day Marc Bolan was fooling around with Chuck Berry's|Little Queenie|when he came up with one of those simple but effective riffs that were his trademark. Bolan started singing the first thing that came to his mind, \"|Get It On, Bang A Gong\";|it was absurd but with his sexy voice it sounded indecent. More than a chorus, it was a total invitation to unbridled debauchery, and the voices of the indispensable|Flo & Eddie, Howard Kaylan|and|Mark Volman|of the|Turtles|, would do the rest.|Get It On|, on which he played his white Stratocaster (although he came out on Top Of The Pops with his Flying V), would become the zenith of T Rex’s career, becoming the band’s second number one in the UK and, incredibly, the only Top Ten of his career in the US."
        ],
        "image_links": []
      }
    }
  }
}