{
  "Marc Bolan": {
    "T Rex": {
      "https://rateyourmusic.com/list/lefthandluke/marc_bolan_and_t_rex__the_albums_you_should___shouldnt_have___f1/": {
        "title": "Marc Bolan & T.Rex: The albums you should / shouldn't ...",
        "text": "Rex\" band is formed for the album, featuring Marc Bolan on Vocals / Guitar, Mickey Finn on percussion, Bill Legend on Drums and Steve Currie on bass. From the ...",
        "google search terms": [
          "Stoke Newington",
          "T Rex",
          "Tyrannosaurus Rex",
          "Hackney",
          "Jewish"
        ],
        "image search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld",
          "Rolan",
          "Bolan",
          "Newington",
          "dyslexia",
          "Glam Rock",
          "Jewish",
          "songwriter"
        ],
        "page search terms": [
          "marc",
          "bolan",
          "t rex",
          "Mark",
          "Feld"
        ],
        "page_text_snippets": [
          "|Vinyl LP|T. Rex|/ 3C 064-95 172|Zinc Alloy and the Hidden Riders of Tomorrow or A Creamed Cage in August|33 rpm, Gatefold, Limited Edition|1974|Vinyl LP|EMI|/ BLNA 7751 DELUXE|Zinc Alloy and the Hidden Riders of Tomorrow|33 rpm, Gatefold|1974|Vinyl LP|Jugoton|/ LSEMI - 73003|Zinc Alloy and the Hidden Riders of Tomorrow|33 rpm, Gatefold|1983|Vinyl LP|MARCL 505|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus Tracks|1985|CD|Marc on Wax|/ MARC D 505|Zinc Alloy and the Hidden Riders of Tomorrow|1987|CD|Teldec|/ 8.26713 243 909-2|Zinc Alloy and the Hidden Riders of Tomorrow|33 rpm|1988|Vinyl LP|PDI|/ E-30.1556|Zinc Alloy and the Hidden Riders of Tomorrow|1989|CD|MARCD 505|Change (The Alternate Zinc Alloy)|Archival|1994|CD|Edsel|/ EDCD 440|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus Tracks, Remastered|1994|CD|Edsel|/ EDCD392|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus Tracks, Digipak, Remastered|2000|CD|Repertoire|/ REP 4905|Zinc Alloy and the Hidden Riders of Tomorrow|CD Sized Album Replica, Limited Edition|2001|CD|TECI-24057|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus CD, Bonus Tracks, Deluxe Edition, Digipak|2002|CD|Edsel|/ MEDCD 717|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus CD, Deluxe Edition, Remastered|2005|CD|Rhino|/ R2 73219|Zinc Alloy and the Hidden Riders of Tomorrow|SHM|2009|CD|TECI-26566|Zinc Alloy & The Hidden Riders of Tomorrow|2011|CD|Fat Possum|/ FP1242|Expand all 20 issues|Compact issues|Expand all 20 issues|Credits|Credits|Tony Visconti|producer|,|string arrangements|Marc Bolan|producer|,|performer|,|writer|,|composer|Mickey Finn|performer|Steve Currie|performer|Bill Legend|performer|Jack Green|performer|Lonnie Jordan|performer|Danny Thompson|performer|B. J. Cole|performer|Sister Pat Hall|backing vocals|The Gloria Jones|backing vocals|Big Richard|backing vocals|Maestro David Katz|strings|The Pop Arts Orchestra|strings|38 Reviews|Page|1|2|3|4|5|>>|Jewlia|Sep 04 2006|I love T.REX, but I can admit when Marc Bolan sucks.  I like this album because I'm a rabid fan, but I know it's pretty terrible...|OH MARC WHY DID YOU GET FAT AND LET COCAINE MAKE YOU SUCK!   I STILL LOVE YOU ANYWAY MY PORKY PIXIE!|Published|ADVERTISEMENT|Walter12|Feb 25 2022|▼|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|Marc Bolan's career is one of the saddest stories in 70's rock music.  Even before his untimely death in 1977, the reputation of his work with T. Rex was in precipitous decline.  It's no small tragedy to transform from being a true trendsetter into a frustrating mediocrity, and that's precisely what Bolan accomplished in a few short years after inventing the entire genre of glam rock.  1974's|Zinc Alloy|is typically cited as the point where Bolan completely lost his way.  Critically panned at the time of its release, and including unwanted forays into funk and soul, it's a record that succeeded in confusing all but the biggest of T. Rex fanboys.  Fortunately, the album has aged better than many may have excepted.  It's still a big step down from Bolan's last three LPs, but it features enough engaging tunes to placate listeners who aren't wedded to the \"pure\" glam rock sound of|Electric Warrior|and|The Slider|.  Underwhelming but listenable enough to warrant 3.0 stars.|By the release of|Tanx|, the formula that Bolan had been using since|Electric Warrior|was obviously running out of steam.  Yet instead of drifting toward art rock, as was the case with many of his glam rock competitors, Bolan decided to add a more diverse slate of pop influences atop familiarly-structured tunes.  Foremost among the stylistic additions to|Zinc Alloy|are piles of Motown-influenced vocals, courtesy of Bolan's real-life partner Gloria Jones.  There's also a funkier vibe to many of the grooves, as well as full-blown orchestra behind most of the guitar lines.  All of these ingredients are brought together via an overblown, Phil Spector-inspired production (produced by Bolan himself).  The only things that haven't significantly changed are the lead vocals and the self-consciously \"trashy\" guitar lines, even if those elements are given far less space to breath than on previous T. Rex releases.  Every track here is immediately identifiable as a T. Rex tune, but those dense backing arrangements also immediately every tune as a part of|Zinc Alloy|.|Zinc Alloy|is an unusual album for me to honestly assess.  I understand the hate that it received back in the day, and I'm forced to admit that most of the stylistic innovations don't really work, but there's a certain charm that brings me back to the record more often that my rating might suggest.  In particular, for an artist who spent most of the 70's repeating himself, it's great to see Bolan attempt something slightly different.  The only truly unforgivable sin of|Zinc Alloy|is its cluttered, wall-of-sound production.  Bolan clearly wasn't ready to self-produce: if Tony Visconti had been involved, I have little doubt that most of arrangements would've been thinned out.  Gloria Jones' backing vocals are also way too high in the mix.  She's a decent singer, and I'm not completely averse to the funk/soul overtones that distinguish mid-70's T. Rex, but on this record her contributions repeatedly overwhelm Bolan's (always endearing) vocal melodies.  Everything on|Zinc Alloy|is simply way too \"huge\" for its own good.|When considered on a track-by-track basis,|Zinc Alloy|is also a mixed bag.  With both|The Slider|and|Tanx|, Bolan made the annoying decision to leave much of his best material off the studio LPs (in favor of releasing non-album singles); on|Zinc Alloy|, he veers wildly in the opposite direction, packing in every half-worthy idea from the past six months.  A 46-minute runtime doesn't usually result in a record that overstays in its welcome, but it's definitely too long for a T. Rex album.  The end result is a release with as many highs as|Tanx|or|Dandy in the Underworld|(both 3.5 stars), but with considerably more filler than any Bolan release since|T. Rex|.  Luckily,|Zinc Alloy|is still easy to listen through in its entirety, mostly because its individual track lengths hover around the three-minute mark, but that isn't enough to overcome to presence of obvious filler.|All of this makes|Zinc Alloy|most appealing as a repository of individually-entertaining tracks.  Foremost among these highlights is \"Teenage Dream\"- a soaring ballad that is arguably the strongest T. Rex single to be released after 1973.  \"Venus Loon\" and \"Explosive Mouth\" should also please the vast majority of casual listeners, assuming they can stomach the overwrought production.  Beyond those three tracks, I have a personal fascination with the|Slider|-esque \"The Avengers (Superbad)\" and the closing \"The Leopards…\", although many hardcore fans may disagree with my enthusiasm here.  The remainder of|Zinc Alloy|is mostly just unexciting, devoid of memorable melodies yet also lacking a clear clunker (although \"Nameless Wildness\" does test my patience with those shrill backing vocals…).  It's just enough to squeak by with a middling, 3.0-star rating, but not enough to warrant an honest recommendation for the album as a whole.|5.8/10|Published|ADVERTISEMENT|yugiaru|Dec 17 2021|▼|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|People back then were really deaf most of the time jesus. You'd think this would be a complete departure from the glam rock style that T. Rex was known for but it's not even that big of a significant change in their sound. There are soul elements in certain songs here and there, but overall, this is 100% pure exaggerated and over the top glam rock as you'd expect from Marc Bolan and his band. Some of the most bizarre songs he ever wrote and made with the band are all on Zinc Alloy, it's such a grandiose album in every sense. Not their best, but I'd count it as part of a great run of albums that began with Electric Warrior.|Published|TheVinylGuy|Sep 02 2021|an elegy to the heroin fuelled hedonism that ran rampant throughout the glam rock era of the early 70s. a ghostly, ghastly, gross experience; a truly cursed album and a terribly bad vibe overall. i love it.|Published|Castrovalva|Jan 24 2021|On this album, T.Rex faceplants into a mess of drugs, alcohol, self-doubt, ego, narcissism, and failed ambition. By 1974, glam rock was treading water, the rise of upstarts like KISS had started to take over, and Bolan completely lost direction with this strange experiment in 'interstellar soul'. Along with Bowie, this one attempts to fuse the British glam stomp with American soul music - only, while 'Young Americans' was a brilliant and inventive pastiche that knew when to stop, this one is a strangely ineffective, rambling mess that never quite decides what it wants to be. The title SOUNDS like it should be some kind of concept album, right? Is Zinc Alloy a person? A place? Who are the hidden riders? None of these questions are answered at any point in the album's tidal wave of verbiage. The first half is a set of more classic T.Rex-sounding songs, culminating in the self-mythologizing of 'Teenage Dream', but the second album descends into rambling, aimless madness. Song titles like 'Painless Persuasion V. The Meathawk Immaculate' and 'The Leopards Featuring Gardenia & The Mighty Slug', which fumble towards profundity, but are little more than Bolan's drunken, drug addled ramblings. He was a few years late for this kind of pseudo-conceptual nonsense in '74. Bolan's ego is so far out of control at this point that the band is now billed as 'Marc Bolan & T.Rex', and the cover art is a weirdly unflattering close up of his pouting face.|And, the production is awful. The playing is fine, but Marc's new girlfriend Gloria Jones is mixed so high that she overpowers every track that she's on. The album is just so overcooked and dense with aimless noodling, misplaced gospel vocals, and Bolan's increasingly incoherent fever dream ramblings that it drags to a completely unsatisfying close. There's a version of it that Edsel put out in the 90's called 'Changes' that strips all of the original production out of it and it is a MUCH better album in pretty much every way.|That said, I love Marc Bolan, so I love this stupid, awful album. It reminds me a lot of 'Be Here Now' by Oasis - it is a product of a band that is now so bloated, drug fucked, drunk, and arrogant, that when it is let loose in the studio with nobody who can say no anymore, the result is stupid, pointless excess in every direction. This is perfect fodder for an episode of 'Trainrecords' or something.|Published|Balance005|Jan 07 2019|Bolan : 9/12|There was a need for change at that point. Even if this cheezy overloaded thing only partially succeeds, it has groove and some kind of dramatic beauty. I had a really hard time getting into it so i can't blame people judging it baldy, especially after just a few listens. I'd admit that the whole thing is dense, long (and it seems longer than it is) and overproduced but there's some magic into it i'd say. While Zinc Alloy may not be one of the strongest T. Rex albums, i'm still deeply attached to it because it's such a unique album withs several great songs which are still quite overlooked in the T. Rex catalogue : Venus Loon, Change, Teenage Dream,  Interstellar Soul...|The 2014 Tony Visconti remaster is the one to get, it sounds terrific (the previous CD releases didn't help restoring the album's reputation).|Published|GARFIELDACRES|Mar 23 2017|Beginning of the end for bolan really,there are some good songs (mostly on side1) and he quite successfully adds a bit of funk to his sound in places. But a lot of the material is definitely patchy and his girlfriend gloria jones vocals don't always work with the songs and she is all over everything.|'teenage dream' is the best thing here by a mile,a reminder of how great bolan's songs and tony visconti's production could be together. Drugs were becoming more of an issue at this point though and their relationship was sorely tested on this album.|Published|MrBlues|Dec 12 2014|This is a disappointing album compared to the earlier glory of Bolan and co. There are a few really good songs, but the rest is just mediocre, non-memorable material. The unique T. Rex sound is here though, it's like a futuristic glam-rock gospel.|The best tracks are \"Venus Loon\", \"Explosive Mouth\", \"Change\" and \"Teenage Dream\". If they dropped off the filler and released just the better songs, it would have made a wonderful EP.|EDIT|: Listening to this again after a few years I find it more pleasing. The last two tracks are pretty good and the band is more funky than ever. I'm also getting more into the backing vocals. Bumped it up from 3 to 3.5 stars.|Published|Page|1|2|3|4|5|>>|Votes are used to help determine the most interesting content on RYM.|Vote up content that is on-topic, within the rules/guidelines, and will likely stay relevant long-term.|Vote down content which breaks the rules.|Catalog|Ratings:|678|Cataloged:|456|Track rating sets:|Track ratings:|55|Rating distribution|Rating trend|Page|1|2|..|4|..|9|..|13|..|18|..|23|..|27|..|32|..|36|..|41|..|46|>>|6 Jul 2023|BlackstarDyl|Try Again, Pal|6 Jul 2023|pass_it_around|28 Jun 2023|juantovar|Vinyl|26 Jun 2023|Redknot52|2 Jun 2023|hwaapczepap|Vinyl|31 May 2023|rupert_X|A shade below Wilco|30 May 2023|nouay|29 May 2023|BreakOut|Great|29 May 2023|IdkSomethingformymami|24 May 2023|slievemore|5 - neutral|23 May 2023|salone|A Certain Fondness|16 May 2023|Pokermask|15 May 2023|MianSwagger|▼|eat a fries|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|14 May 2023|Pulch|Great, solid; definitely listen to it|11 May 2023|themoviejudge|.|.|.|.|.|.|Previous|Next|Tanx|Light of Love|ADVERTISEMENT|Track listing|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|Credits|Tony Visconti|producer|,|string arrangements|Marc Bolan|producer|,|performer|,|writer|,|composer|Mickey Finn|performer|Steve Currie|performer|Bill Legend|performer|Jack Green|performer|Lonnie Jordan|performer|Danny Thompson|performer|B. J. Cole|performer|Sister Pat Hall|backing vocals|The Gloria Jones|backing vocals|Big Richard|backing vocals|Maestro David Katz|strings|The Pop Arts Orchestra|strings|72 Lists|Albums from England - T|Zaragon|1974 Albums Ranked|mgars4|Favorite T. Rex Albums|stanley_the_bugman|Cover Art by Kosh|misterteeth|Tonight’s The Night|BlackstarDyl|Kids... Against the 70s!|massimo73|Series 29 - Generations|minnesotamurray|Albums from 1974 (in no particular order)|ThePunkPanther5|I got 'em on vinyl|DohertyClash|Best Of Crossroads - 1973-1975 - 105 Albums Essentiels|ben007|Love your tan! Albums of 1974 ranked.|Herbie|Lately|Thatstheirbestalbum|BEST 1974'S ALBUM|tblackie|Virtual Crate-Digging: Every Album in My Library|DonRaoul|The Best of T. Rex!|Malchemist|THE BEST OF T.REX|mehhem|See all 72 lists|Comments|Rules for comments|Be respectful!  All the community rules apply here.|Keep your comments focused on the release.  Don't post randomness/off-topic comments.   Jokes are fine, but don't post tactless/inappropriate ones.|Don't get in arguments with people here, or start long discussions.  Use the boards for extended discussion.|Don't use this space to complain about the average rating, chart position, genre voting,  others' reviews or ratings, or errors on the page.|Don't comment just to troll/provoke.  Likewise, don't respond to trollish comments; just report them and ignore them.|Any spoilers should be placed in spoiler tags as such:|[spoiler]|(spoiler goes here)|[/spoiler]|Note|: Unlike reviews, comments are considered temporary and may be deleted/purged without notice.|jjmia|23 Jan 2020 02:45 GMT|Not bad but probably my least favourite from them. It’s too long as well|report|reported|strangefires|12 May 2021 05:55 GMT|I'll have some of what Marc was smoking when he made this|report|reported|abyss_lord|29 Sep 2021 17:52 GMT|Why do I kinda like this lol|Sounds like unintentional zolo|report|reported|ClimateOfHunter|22 Jan 2022 00:38 GMT|It’s wild how much better Teenage Dream is than every other song here. It’s like he used up all his good ideas on that song alone and then went “shit, I still have to write the rest of the album”|report|reported|rogueofmv|28 Jan 01:08 GMT|cedric bixler-zavala|report|reported|mc1382|09 May 09:27 GMT|This is like if one of the members of Dr. Frank-N-Furter's castle made an album|report|reported|krautrockism|20 May 03:30 GMT|mfs with blue eyes|report|reported|Log in to add a comment|Discussion|RYM Artists/Bands Top 20 Thread #132: T. Rex (incl. Tyrannosaurus Rex)|Music Polls/Games|Experimental Left Turns Post-Magnum Opus|Music|What is your favorite underrated album?|Music|comment on the last five rated albums by the user above you|Music Polls/Games|Each artist's best song from each of their albums|Music Polls/Games|Baker's Dozen-Albums|Music Polls/Games|Your favorite artists most underrated albums|Music|Type in random album codes to see what comes up|Music Polls/Games|Unpopular musical opinions.|Music|¿Que estas escuchando ahora mismo?|RYM en español|One Artist Releases with Various Artists on it|Rate Your Music|The RYM Artists Top 10|Music Polls/Games|Subscribe to see similar release suggestions|ADVERTISEMENT|Contributions|Contributors to this release:|hotlove|,|Communique|,|germannnn|,|jkra3168|,|yolz|,|ipoduser|,|unj|,|hugdeserver|,|Drifterdk|,|Lovinda|,|[deleted]|,|alcamus|,|Kronz|Log in|to submit a correction or upload art for this release|.|.|.|.|.|.|ADVERTISEMENT|Close|Close|Rate Your Music|© 2000-2023 Sonemic, Inc.|Site links|RYM Network|RYM|music|Sonemic|new music site (beta)|Cinemos|film (beta)|Glitchwave|video games (beta)|Info|FAQ|Development status|RYMzilla|Submissions|Policy|Database standards|Privacy|Consent|Terms of service|Contact us|Support / Feedback",
          "Marc Bolan Albums: songs, discography, biography, and listening guide - Rate Your Music|sign in|RYM|new music|genres|charts|lists|community|Close|Search:|Music|Film|Games|for:|New Music|Genres|Charts|Lists|Community|Marc Bolan|The Beginning of Doves|Born|30 September 1947,|Hackney, Greater London, United Kingdom|Died|16 September 1977,|Barnes, Greater London, United Kingdom|Member of|Big Carrot|,|Dib Cochran and the Earwigs|,|John's Children|,|T. Rex|Notes|Father of|Rolan Bolan|; founder of|T. Rex|Also Known As|Mark Feld, Toby Tyler|Genres|Glam Rock|,|Contemporary Folk|,|Singer-Songwriter|,|Folk Rock|,|Acoustic Rock|,|Television Music|Share|Follow|651 followers|ADVERTISEMENT|Discography|143|Credits|188|Filmography|5|Album|Showing all (17)|Issues|Average|Avg.|Ratings|Reviews|Ratings/Rev.|Title|/|Release Date|+8|3.23|123|3|123|3|The Beginning of Doves|1974|+10|3.11|60|6|60|6|You Scare Me to Death|1981|+3|3.06|48|3|48|3|Billy Super Duper|1982|•|Marc Bolan & T. Rex|T. Rex|Marc Bolan|3.09|17|1|17|1|Dance in the Midnight|1983|+2|3.08|18|1|18|1|Love and Death|1986|+1|3.22|39|3|39|3|Acoustic Warrior|[archival]|1996|+3|3.50|31|4|31|4|Marc: Songs From the Granada TV Series|[tv soundtrack]|1998|•|Marc Bolan and T. Rex|Marc Bolan|T. Rex|3.84|3|3|-|Twopenny Prince|[archival]|2010|3.98|7|7|-|Beyond the Risin' Sun|2010|2.77|2|2|-|Baby Strange: A Rarities Collection|[archival]|2017|3.50|1|1|-|Misfortune Gatehouse|[archival]|2018|4.00|1|1|-|Tramp King of the City|[archival]|2018|4.00|1|1|-|There Was a Time|[archival]|2018|4.00|1|1|-|Slight Thigh Be-Bop|[archival]|2018|4.53|2|2|-|Home Demos|[archival]|2019|+1|4.02|4|4|-|Pictures of Purple People|[archival]|2019|4.17|3|3|-|Electronic Musik|[archival]|2019|ADVERTISEMENT|Live Album|Showing all (3)|Issues|Average|Avg.|Ratings|Reviews|Ratings/Rev.|Title|/|Release Date|+3|3.54|42|5|42|5|Live 1977|1997|•|Marc Bolan & T. Rex|Marc Bolan|T. Rex|4.00|1|1|-|Marc Bolan & T. Rex (The Acoustic and Live Collection)|[archival]|2009|5.00|1|1|-|Electric Seven 2 at the BBC",
          "|Mark Feld",
          "|I'm well aware that at the time Marc was beginning to incorporate soul (and funk) into his sound (with the aid of his partner Gloria Jones and co.)yet this version of soul tends to sound at times more like a overblown caricature of the sound he was making with Mark Volman and Howard Kaylan. Unfortunately here there was no room for the complementary vocals Mark and Howard excelled at -  more a grossly excessive 'noise' which seemed to all intent and purposes to drown out much of Marc's singing. Beneath all flamboyance and overproduction there are, however, some rather inspired moments. Marc is experimenting  on a number of these tracks rather effectively and some of his guitar work (in particular on 'Carsmile Smith') sounds genuinely soulful.|Zinc Alloy|does have much more to offer than the more simplistic and less consistent|Tanx|certainly, and it's also probably true to say it's Marc's first significant change of direction since|Electric Warrior|.In addition it contains one of Marc's very best singles - the autobiographical 'Teenage Dream'.|It's flawed for sure but Marc's not playing so safe here as on his previous couple of albums and it makes this album perhaps a little more revealing as a result.|Published|ADVERTISEMENT|jbjamieblack|Mar 16 2006|'Zinc Alloy and the Hidden Riders of Tomorrow'|was released in 1974 (which may I say is a splendid title.) As an album people have said that it was a comercial failure. Marc was trying to get rid of the glam rock sound and adding soul and making the T.Rex sound heavier. Adding more strength in backing vocals, heavy guitars, a louder more hard hitting sound.|In my opinion I think this album is under-rated. It deserves more recognition that what It's earned I think. Also the album was a real grower on me. The more I listened to it the more I liked it.|The album starts off with the song 'Venus loon'. 'Venus loon' is a very cathchy song. Same with 'Sound Pit', 'Explosive Mouth', and 'Galaxy'. Also when I listen to all these songs there is something quite magical about it that I just can't put my finger on. 'Change' is a down tempo song which is has a nice sadness about it. Nameless Wildness is a fun song. 'Teenage Dream' the only single from the album. 'Teenage Dream' is a masterpiece! The song is soposed to be about Marc's star on a wane. 'Liquid Gang' another catchy fun song. 'Carsmile Smith and the Old One' is another sad song. Then a beautiful medley arrives - 'You've got to jive to stay alive / Spanish Midnight'. 'Interstellar Soul' - Another fun song. 'Painless Persuasion v. The Meathawauk Immaculate' is another great song. And the last 2 songs are 'The Avengers (Superbad') which is a fun song and 'The Leopards Featuring Gardenia And The Mighty Slug' which is quite weird, Marc does a song where he talks through it which is quite cool.|And the bonus tracks they have added to this collection makes it even more spectacular!|My favourite song on this album is Teenage Dream.|Overall I think this album is an underated classic. I think it should be judged after a few listens. It's not my fave T.Rex album but|I Love It!|Published|slider72|Apr 17 2005|Zinc Alloy, Marc tried to do the name change thing with this one and the record company insisted on Marc Bolan and T.Rex appearing on the sleeve. It was panned when released but through the age of time, songs like \"Change\" Carsmile Smith, The Avengers (Superbad Tiger), Venus Loon, Explosive Mouth, and Teenage Dream, all have improved when listening again and again and again, must be the red wine.|I think the Alternative Issue has more to offer that the Vinyl.|Buy it, play it, put it away, and then in 5 years time you will realise it was a classic T.Rex album or in my case 30+ years|Published|weejum|Apr 16 2005|This is probably Bolan's most bizarre album but I don't think I can rate it as high as his other albums.|Published|<<|Page|1|2|3|4|5|6|>>|Votes are used to help determine the most interesting content on RYM.|Vote up content that is on-topic, within the rules/guidelines, and will likely stay relevant long-term.|Vote down content which breaks the rules.|.|.|.|.|.|.|Track listing|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|Credits|Tony Visconti|producer|,|string arrangements|Marc Bolan|producer|,|performer|,|writer|,|composer|Mickey Finn|performer|Steve Currie|performer|Bill Legend|performer|Jack Green|performer|Lonnie Jordan|performer|Danny Thompson|performer|B. J. Cole|performer|Sister Pat Hall|backing vocals|The Gloria Jones|backing vocals|Big Richard|backing vocals|Maestro David Katz|strings|The Pop Arts Orchestra|strings|.|.|.|.|.|.|ADVERTISEMENT|Close|Close|Rate Your Music|© 2000-2023 Sonemic, Inc.|Site links|RYM Network|RYM|music|Sonemic|new music site (beta)|Cinemos|film (beta)|Glitchwave|video games (beta)|Info|FAQ|Development status|RYMzilla|Submissions|Policy|Database standards|Privacy|Consent|Terms of service|Contact us|Support / Feedback",
          "|a lot of people don't like this lp very much but i think it is one of t rex's best and most interesting offerings.",
          "Review for Zinc Alloy and the Hidden Riders of Tomorrow - Marc Bolan & T. Rex by GARFIELDACRES - Rate Your Music|sign in|RYM|new music|genres|charts|lists|community|Close|Search:|Music|Film|Games|for:|New Music|Genres|Charts|Lists|Community|Welcome to|Rate Your Music|RYM is one of the largest music databases and communities online, which you can use in endless ways to discover new music.|Learn about some of the ways you can use RYM for music discovery.|Zinc Alloy and the Hidden Riders of Tomorrow|(1974)|Marc Bolan & T. Rex|3.19|from 757 ratings|Genres|Glam Rock|Blue-Eyed Soul|Descriptors|melodic, quirky, rhythmic, female vocals, surreal, anxious, uplifting, playful, bittersweet, passionate, lush, male vocals, sensual, energetic|Zinc Alloy and the Hidden Riders of Tomorrow|(1974)|Marc Bolan & T. Rex|Review by|GARFIELDACRES|Beginning of the end for bolan really,there are some good songs (mostly on side1) and he quite successfully adds a bit of funk to his sound in places. But a lot of the material is definitely patchy and his girlfriend gloria jones vocals don't always work with the songs and she is all over everything.|'teenage dream' is the best thing here by a mile,a reminder of how great bolan's songs and tony visconti's production could be together. Drugs were becoming more of an issue at this point though and their relationship was sorely tested on this album.|Expand review|Hide|Close|Close|Rate Your Music|© 2000-2023 Sonemic, Inc.|Site links|RYM Network|RYM|music|Sonemic|new music site (beta)|Cinemos|film (beta)|Glitchwave|video games (beta)|Info|FAQ|Development status|RYMzilla|Submissions|Policy|Database standards|Privacy|Consent|Terms of service|Contact us|Support / Feedback",
          "|Zinc Alloy and the Hidden Riders of Tomorrow or A Creamed Cage in August|33 rpm, Gatefold, Limited Edition|1974|Vinyl LP|EMI|/ BLNA 7751 DELUXE|Zinc Alloy and the Hidden Riders of Tomorrow|33 rpm, Gatefold|1974|Vinyl LP|Jugoton|/ LSEMI - 73003|Zinc Alloy and the Hidden Riders of Tomorrow|33 rpm, Gatefold|1983|Vinyl LP|MARCL 505|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus Tracks|1985|CD|Marc on Wax|/ MARC D 505|Zinc Alloy and the Hidden Riders of Tomorrow|1987|CD|Teldec|/ 8.26713 243 909-2|Zinc Alloy and the Hidden Riders of Tomorrow|33 rpm|1988|Vinyl LP|PDI|/ E-30.1556|Zinc Alloy and the Hidden Riders of Tomorrow|1989|CD|MARCD 505|Change (The Alternate Zinc Alloy)|Archival|1994|CD|Edsel|/ EDCD 440|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus Tracks, Remastered|1994|CD|Edsel|/ EDCD392|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus Tracks, Digipak, Remastered|2000|CD|Repertoire|/ REP 4905|Zinc Alloy and the Hidden Riders of Tomorrow|CD Sized Album Replica, Limited Edition|2001|CD|TECI-24057|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus CD, Bonus Tracks, Deluxe Edition, Digipak|2002|CD|Edsel|/ MEDCD 717|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus CD, Deluxe Edition, Remastered|2005|CD|Rhino|/ R2 73219|Zinc Alloy and the Hidden Riders of Tomorrow|SHM|2009|CD|TECI-26566|Zinc Alloy & The Hidden Riders of Tomorrow|2011|CD|Fat Possum|/ FP1242|Expand all 20 issues|Compact issues|Expand all 20 issues|Credits|Credits|Tony Visconti|producer|,|string arrangements|Marc Bolan|producer|,|performer|,|writer|,|composer|Mickey Finn|performer|Steve Currie|performer|Bill Legend|performer|Jack Green|performer|Lonnie Jordan|performer|Danny Thompson|performer|B. J. Cole|performer|Sister Pat Hall|backing vocals|The Gloria Jones|backing vocals|Big Richard|backing vocals|Maestro David Katz|strings|The Pop Arts Orchestra|strings|45 Reviews|Page|1|2|3|4|5|6|>>|Jewlia|Sep 04 2006|I love T.REX, but I can admit when Marc Bolan sucks.  I like this album because I'm a rabid fan, but I know it's pretty terrible...|OH MARC WHY DID YOU GET FAT AND LET COCAINE MAKE YOU SUCK!   I STILL LOVE YOU ANYWAY MY PORKY PIXIE!|Published|ADVERTISEMENT|Walter12|Feb 25 2022|▼|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|Marc Bolan's career is one of the saddest stories in 70's rock music.  Even before his untimely death in 1977, the reputation of his work with T. Rex was in precipitous decline.  It's no small tragedy to transform from being a true trendsetter into a frustrating mediocrity, and that's precisely what Bolan accomplished in a few short years after inventing the entire genre of glam rock.  1974's|Zinc Alloy|is typically cited as the point where Bolan completely lost his way.  Critically panned at the time of its release, and including unwanted forays into funk and soul, it's a record that succeeded in confusing all but the biggest of T. Rex fanboys.  Fortunately, the album has aged better than many may have excepted.  It's still a big step down from Bolan's last three LPs, but it features enough engaging tunes to placate listeners who aren't wedded to the \"pure\" glam rock sound of|Electric Warrior|and|The Slider|.  Underwhelming but listenable enough to warrant 3.0 stars.|By the release of|Tanx|, the formula that Bolan had been using since|Electric Warrior|was obviously running out of steam.  Yet instead of drifting toward art rock, as was the case with many of his glam rock competitors, Bolan decided to add a more diverse slate of pop influences atop familiarly-structured tunes.  Foremost among the stylistic additions to|Zinc Alloy|are piles of Motown-influenced vocals, courtesy of Bolan's real-life partner Gloria Jones.  There's also a funkier vibe to many of the grooves, as well as full-blown orchestra behind most of the guitar lines.  All of these ingredients are brought together via an overblown, Phil Spector-inspired production (produced by Bolan himself).  The only things that haven't significantly changed are the lead vocals and the self-consciously \"trashy\" guitar lines, even if those elements are given far less space to breath than on previous T. Rex releases.  Every track here is immediately identifiable as a T. Rex tune, but those dense backing arrangements also immediately every tune as a part of|Zinc Alloy|.|Zinc Alloy|is an unusual album for me to honestly assess.  I understand the hate that it received back in the day, and I'm forced to admit that most of the stylistic innovations don't really work, but there's a certain charm that brings me back to the record more often that my rating might suggest.  In particular, for an artist who spent most of the 70's repeating himself, it's great to see Bolan attempt something slightly different.  The only truly unforgivable sin of|Zinc Alloy|is its cluttered, wall-of-sound production.  Bolan clearly wasn't ready to self-produce: if Tony Visconti had been involved, I have little doubt that most of arrangements would've been thinned out.  Gloria Jones' backing vocals are also way too high in the mix.  She's a decent singer, and I'm not completely averse to the funk/soul overtones that distinguish mid-70's T. Rex, but on this record her contributions repeatedly overwhelm Bolan's (always endearing) vocal melodies.  Everything on|Zinc Alloy|is simply way too \"huge\" for its own good.|When considered on a track-by-track basis,|Zinc Alloy|is also a mixed bag.  With both|The Slider|and|Tanx|, Bolan made the annoying decision to leave much of his best material off the studio LPs (in favor of releasing non-album singles); on|Zinc Alloy|, he veers wildly in the opposite direction, packing in every half-worthy idea from the past six months.  A 46-minute runtime doesn't usually result in a record that overstays in its welcome, but it's definitely too long for a T. Rex album.  The end result is a release with as many highs as|Tanx|or|Dandy in the Underworld|(both 3.5 stars), but with considerably more filler than any Bolan release since|T. Rex|.  Luckily,|Zinc Alloy|is still easy to listen through in its entirety, mostly because its individual track lengths hover around the three-minute mark, but that isn't enough to overcome to presence of obvious filler.|All of this makes|Zinc Alloy|most appealing as a repository of individually-entertaining tracks.  Foremost among these highlights is \"Teenage Dream\"- a soaring ballad that is arguably the strongest T. Rex single to be released after 1973.  \"Venus Loon\" and \"Explosive Mouth\" should also please the vast majority of casual listeners, assuming they can stomach the overwrought production.  Beyond those three tracks, I have a personal fascination with the|Slider|-esque \"The Avengers (Superbad)\" and the closing \"The Leopards…\", although many hardcore fans may disagree with my enthusiasm here.  The remainder of|Zinc Alloy|is mostly just unexciting, devoid of memorable melodies yet also lacking a clear clunker (although \"Nameless Wildness\" does test my patience with those shrill backing vocals…).  It's just enough to squeak by with a middling, 3.0-star rating, but not enough to warrant an honest recommendation for the album as a whole.|5.8/10|Published|ADVERTISEMENT|yugiaru|Dec 17 2021|▼|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|People back then were really deaf most of the time jesus. You'd think this would be a complete departure from the glam rock style that T. Rex was known for but it's not even that big of a significant change in their sound. There are soul elements in certain songs here and there, but overall, this is 100% pure exaggerated and over the top glam rock as you'd expect from Marc Bolan and his band. Some of the most bizarre songs he ever wrote and made with the band are all on Zinc Alloy, it's such a grandiose album in every sense. Not their best, but I'd count it as part of a great run of albums that began with Electric Warrior.|Published|TheVinylGuy|Sep 02 2021|an elegy to the heroin fuelled hedonism that ran rampant throughout the glam rock era of the early 70s. a ghostly, ghastly, gross experience; a truly cursed album and a terribly bad vibe overall. i love it.|Published|Castrovalva|Jan 24 2021|On this album, T.Rex faceplants into a mess of drugs, alcohol, self-doubt, ego, narcissism, and failed ambition. By 1974, glam rock was treading water, the rise of upstarts like KISS had started to take over, and Bolan completely lost direction with this strange experiment in 'interstellar soul'. Along with Bowie, this one attempts to fuse the British glam stomp with American soul music - only, while 'Young Americans' was a brilliant and inventive pastiche that knew when to stop, this one is a strangely ineffective, rambling mess that never quite decides what it wants to be. The title SOUNDS like it should be some kind of concept album, right? Is Zinc Alloy a person? A place? Who are the hidden riders? None of these questions are answered at any point in the album's tidal wave of verbiage. The first half is a set of more classic T.Rex-sounding songs, culminating in the self-mythologizing of 'Teenage Dream', but the second album descends into rambling, aimless madness. Song titles like 'Painless Persuasion V. The Meathawk Immaculate' and 'The Leopards Featuring Gardenia & The Mighty Slug', which fumble towards profundity, but are little more than Bolan's drunken, drug addled ramblings. He was a few years late for this kind of pseudo-conceptual nonsense in '74. Bolan's ego is so far out of control at this point that the band is now billed as 'Marc Bolan & T.Rex', and the cover art is a weirdly unflattering close up of his pouting face.|And, the production is awful. The playing is fine, but Marc's new girlfriend Gloria Jones is mixed so high that she overpowers every track that she's on. The album is just so overcooked and dense with aimless noodling, misplaced gospel vocals, and Bolan's increasingly incoherent fever dream ramblings that it drags to a completely unsatisfying close. There's a version of it that Edsel put out in the 90's called 'Changes' that strips all of the original production out of it and it is a MUCH better album in pretty much every way.|That said, I love Marc Bolan, so I love this stupid, awful album. It reminds me a lot of 'Be Here Now' by Oasis - it is a product of a band that is now so bloated, drug fucked, drunk, and arrogant, that when it is let loose in the studio with nobody who can say no anymore, the result is stupid, pointless excess in every direction. This is perfect fodder for an episode of 'Trainrecords' or something.|Published|Balance005|Jan 07 2019|Bolan : 9/12|There was a need for change at that point. Even if this cheezy overloaded thing only partially succeeds, it has groove and some kind of dramatic beauty. I had a really hard time getting into it so i can't blame people judging it baldy, especially after just a few listens. I'd admit that the whole thing is dense, long (and it seems longer than it is) and overproduced but there's some magic into it i'd say. While Zinc Alloy may not be one of the strongest T. Rex albums, i'm still deeply attached to it because it's such a unique album withs several great songs which are still quite overlooked in the T. Rex catalogue : Venus Loon, Change, Teenage Dream,  Interstellar Soul...|The 2014 Tony Visconti remaster is the one to get, it sounds terrific (the previous CD releases didn't help restoring the album's reputation).|Published|GARFIELDACRES|Mar 23 2017|Beginning of the end for bolan really,there are some good songs (mostly on side1) and he quite successfully adds a bit of funk to his sound in places. But a lot of the material is definitely patchy and his girlfriend gloria jones vocals don't always work with the songs and she is all over everything.|'teenage dream' is the best thing here by a mile,a reminder of how great bolan's songs and tony visconti's production could be together. Drugs were becoming more of an issue at this point though and their relationship was sorely tested on this album.|Published|MrBlues|Dec 12 2014|This is a disappointing album compared to the earlier glory of Bolan and co. There are a few really good songs, but the rest is just mediocre, non-memorable material. The unique T. Rex sound is here though, it's like a futuristic glam-rock gospel.|The best tracks are \"Venus Loon\", \"Explosive Mouth\", \"Change\" and \"Teenage Dream\". If they dropped off the filler and released just the better songs, it would have made a wonderful EP.|EDIT|: Listening to this again after a few years I find it more pleasing. The last two tracks are pretty good and the band is more funky than ever. I'm also getting more into the backing vocals. Bumped it up from 3 to 3.5 stars.|Published|Page|1|2|3|4|5|6|>>|Votes are used to help determine the most interesting content on RYM.|Vote up content that is on-topic, within the rules/guidelines, and will likely stay relevant long-term.|Vote down content which breaks the rules.|Catalog|Ratings:|757|Cataloged:|569|Track rating sets:|Track ratings:|57|Rating distribution|Rating trend|Page|1|2|..|5|..|10|..|15|..|20|..|25|..|30|..|35|..|40|..|45|..|51|>>|6 Jul 2023|BlackstarDyl|Try Again, Pal|6 Jul 2023|pass_it_around|28 Jun 2023|juantovar|Vinyl|26 Jun 2023|Redknot52|2 Jun 2023|hwaapczepap|Vinyl|31 May 2023|rupert_X|A shade below Wilco|30 May 2023|nouay|29 May 2023|BreakOut|Great|29 May 2023|IdkSomethingformymami|24 May 2023|slievemore|5 - neutral|23 May 2023|salone|A Certain Fondness|16 May 2023|Pokermask|15 May 2023|MianSwagger|▼|eat a fries|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|14 May 2023|Pulch|Great, solid; definitely listen to it|11 May 2023|themoviejudge|.|.|.|.|.|.|Previous|Next|Tanx|Light of Love|ADVERTISEMENT|Track listing|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|Credits|Tony Visconti|producer|,|string arrangements|Marc Bolan|producer|,|performer|,|writer|,|composer|Mickey Finn|performer|Steve Currie|performer|Bill Legend|performer|Jack Green|performer|Lonnie Jordan|performer|Danny Thompson|performer|B. J. Cole|performer|Sister Pat Hall|backing vocals|The Gloria Jones|backing vocals|Big Richard|backing vocals|Maestro David Katz|strings|The Pop Arts Orchestra|strings|84 Lists|Ranking Music 1974|dementri06|1974:Top 70 Rock Album|vanKuver|My Miniature LPs..|muzex|Series 29 - Generations|minnesotamurray|Worst album names|mibesu|Alphabetic albums, 20 per letter?|ronb626|1974|juicefacekilla|MY OWN VINYL COLLECTION (MY T. REX, MARC BOLAN´S ALBUMS)|mikelarambur|Wam Bam Thank You Glam !|popandcircumstance|Best Of Crossroads - 1973-1975 - 105 Albums Essentiels|ben007|My Top 100 Albums of All Time|List3n|My 1974 Albums, Muhammad Ali vs George Foreman|theflynet|My Album Collection [LP]|DaOneAndOnly1234|I got 'em on vinyl|DohertyClash|Purchases 2009|DrCrower|2018 - 580 Albums I listened to|djiaind|See all 84 lists|Comments|Rules for comments|Be respectful!  All the community rules apply here.|Keep your comments focused on the release.  Don't post randomness/off-topic comments.   Jokes are fine, but don't post tactless/inappropriate ones.|Don't get in arguments with people here, or start long discussions.  Use the boards for extended discussion.|Don't use this space to complain about the average rating, chart position, genre voting,  others' reviews or ratings, or errors on the page.|Don't comment just to troll/provoke.  Likewise, don't respond to trollish comments; just report them and ignore them.|Any spoilers should be placed in spoiler tags as such:|[spoiler]|(spoiler goes here)|[/spoiler]|Note|: Unlike reviews, comments are considered temporary and may be deleted/purged without notice.|jjmia|23 Jan 2020 02:45 GMT|Not bad but probably my least favourite from them. It’s too long as well|report|reported|strangefires|12 May 2021 05:55 GMT|I'll have some of what Marc was smoking when he made this|report|reported|abyss_lord|29 Sep 2021 17:52 GMT|Why do I kinda like this lol|Sounds like unintentional zolo|report|reported|ClimateOfHunter|22 Jan 2022 00:38 GMT|It’s wild how much better Teenage Dream is than every other song here. It’s like he used up all his good ideas on that song alone and then went “shit, I still have to write the rest of the album”|report|reported|rogueofmv|28 Jan 01:08 GMT|cedric bixler-zavala|report|reported|mc1382|09 May 09:27 GMT|This is like if one of the members of Dr. Frank-N-Furter's castle made an album|report|reported|krautrockism|20 May 03:30 GMT|mfs with blue eyes|report|reported|Log in to add a comment|Discussion|RYM Artists/Bands Top 20 Thread #132: T. Rex (incl. Tyrannosaurus Rex)|Music Polls/Games|Experimental Left Turns Post-Magnum Opus|Music|What is your favorite underrated album?|Music|comment on the last five rated albums by the user above you|Music Polls/Games|Each artist's best song from each of their albums|Music Polls/Games|Baker's Dozen-Albums|Music Polls/Games|Your favorite artists most underrated albums|Music|Type in random album codes to see what comes up|Music Polls/Games|Unpopular musical opinions.|Music|¿Que estas escuchando ahora mismo?|RYM en español|One Artist Releases with Various Artists on it|Rate Your Music|The RYM Artists Top 10|Music Polls/Games|Subscribe to see similar release suggestions|ADVERTISEMENT|Contributions|Contributors to this release:|hotlove|,|Communique|,|germannnn|,|jkra3168|,|yolz|,|ipoduser|,|unj|,|hugdeserver|,|Drifterdk|,|Lovinda|,|[deleted]|,|alcamus|,|Kronz|Log in|to submit a correction or upload art for this release|.|.|.|.|.|.|ADVERTISEMENT|Close|Close|Rate Your Music|© 2000-2023 Sonemic, Inc.|Site links|RYM Network|RYM|music|Sonemic|new music site (beta)|Cinemos|film (beta)|Glitchwave|video games (beta)|Info|FAQ|Development status|RYMzilla|Submissions|Policy|Database standards|Privacy|Consent|Terms of service|Contact us|Support / Feedback",
          "|Vinyl LP|T. Rex|/ 3C 064-95 172|Zinc Alloy and the Hidden Riders of Tomorrow or A Creamed Cage in August|33 rpm, Gatefold, Limited Edition|1974|Vinyl LP|EMI|/ BLNA 7751 DELUXE|Zinc Alloy and the Hidden Riders of Tomorrow|33 rpm, Gatefold|1974|Vinyl LP|Jugoton|/ LSEMI - 73003|Zinc Alloy and the Hidden Riders of Tomorrow|33 rpm, Gatefold|1983|Vinyl LP|MARCL 505|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus Tracks|1985|CD|Marc on Wax|/ MARC D 505|Zinc Alloy and the Hidden Riders of Tomorrow|1987|CD|Teldec|/ 8.26713 243 909-2|Zinc Alloy and the Hidden Riders of Tomorrow|33 rpm|1988|Vinyl LP|PDI|/ E-30.1556|Zinc Alloy and the Hidden Riders of Tomorrow|1989|CD|MARCD 505|Change (The Alternate Zinc Alloy)|Archival|1994|CD|Edsel|/ EDCD 440|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus Tracks, Remastered|1994|CD|Edsel|/ EDCD392|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus Tracks, Digipak, Remastered|2000|CD|Repertoire|/ REP 4905|Zinc Alloy and the Hidden Riders of Tomorrow|CD Sized Album Replica, Limited Edition|2001|CD|TECI-24057|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus CD, Bonus Tracks, Deluxe Edition, Digipak|2002|CD|Edsel|/ MEDCD 717|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus CD, Deluxe Edition, Remastered|2005|CD|Rhino|/ R2 73219|Zinc Alloy and the Hidden Riders of Tomorrow|SHM|2009|CD|TECI-26566|Zinc Alloy & The Hidden Riders of Tomorrow|2011|CD|Fat Possum|/ FP1242|Expand all 20 issues|Compact issues|Expand all 20 issues|Credits|Credits|Tony Visconti|producer|,|string arrangements|Marc Bolan|producer|,|performer|,|writer|,|composer|Mickey Finn|performer|Steve Currie|performer|Bill Legend|performer|Jack Green|performer|Lonnie Jordan|performer|Danny Thompson|performer|B. J. Cole|performer|Sister Pat Hall|backing vocals|The Gloria Jones|backing vocals|Big Richard|backing vocals|Maestro David Katz|strings|The Pop Arts Orchestra|strings|38 Reviews|Page|1|2|3|4|5|>>|Jewlia|Sep 04 2006|I love T.REX, but I can admit when Marc Bolan sucks.  I like this album because I'm a rabid fan, but I know it's pretty terrible...|OH MARC WHY DID YOU GET FAT AND LET COCAINE MAKE YOU SUCK!   I STILL LOVE YOU ANYWAY MY PORKY PIXIE!|Published|ADVERTISEMENT|Walter12|Feb 25 2022|▼|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|Marc Bolan's career is one of the saddest stories in 70's rock music.  Even before his untimely death in 1977, the reputation of his work with T. Rex was in precipitous decline.  It's no small tragedy to transform from being a true trendsetter into a frustrating mediocrity, and that's precisely what Bolan accomplished in a few short years after inventing the entire genre of glam rock.  1974's|Zinc Alloy|is typically cited as the point where Bolan completely lost his way.  Critically panned at the time of its release, and including unwanted forays into funk and soul, it's a record that succeeded in confusing all but the biggest of T. Rex fanboys.  Fortunately, the album has aged better than many may have excepted.  It's still a big step down from Bolan's last three LPs, but it features enough engaging tunes to placate listeners who aren't wedded to the \"pure\" glam rock sound of|Electric Warrior|and|The Slider|.  Underwhelming but listenable enough to warrant 3.0 stars.|By the release of|Tanx|, the formula that Bolan had been using since|Electric Warrior|was obviously running out of steam.  Yet instead of drifting toward art rock, as was the case with many of his glam rock competitors, Bolan decided to add a more diverse slate of pop influences atop familiarly-structured tunes.  Foremost among the stylistic additions to|Zinc Alloy|are piles of Motown-influenced vocals, courtesy of Bolan's real-life partner Gloria Jones.  There's also a funkier vibe to many of the grooves, as well as full-blown orchestra behind most of the guitar lines.  All of these ingredients are brought together via an overblown, Phil Spector-inspired production (produced by Bolan himself).  The only things that haven't significantly changed are the lead vocals and the self-consciously \"trashy\" guitar lines, even if those elements are given far less space to breath than on previous T. Rex releases.  Every track here is immediately identifiable as a T. Rex tune, but those dense backing arrangements also immediately every tune as a part of|Zinc Alloy|.|Zinc Alloy|is an unusual album for me to honestly assess.  I understand the hate that it received back in the day, and I'm forced to admit that most of the stylistic innovations don't really work, but there's a certain charm that brings me back to the record more often that my rating might suggest.  In particular, for an artist who spent most of the 70's repeating himself, it's great to see Bolan attempt something slightly different.  The only truly unforgivable sin of|Zinc Alloy|is its cluttered, wall-of-sound production.  Bolan clearly wasn't ready to self-produce: if Tony Visconti had been involved, I have little doubt that most of arrangements would've been thinned out.  Gloria Jones' backing vocals are also way too high in the mix.  She's a decent singer, and I'm not completely averse to the funk/soul overtones that distinguish mid-70's T. Rex, but on this record her contributions repeatedly overwhelm Bolan's (always endearing) vocal melodies.  Everything on|Zinc Alloy|is simply way too \"huge\" for its own good.|When considered on a track-by-track basis,|Zinc Alloy|is also a mixed bag.  With both|The Slider|and|Tanx|, Bolan made the annoying decision to leave much of his best material off the studio LPs (in favor of releasing non-album singles); on|Zinc Alloy|, he veers wildly in the opposite direction, packing in every half-worthy idea from the past six months.  A 46-minute runtime doesn't usually result in a record that overstays in its welcome, but it's definitely too long for a T. Rex album.  The end result is a release with as many highs as|Tanx|or|Dandy in the Underworld|(both 3.5 stars), but with considerably more filler than any Bolan release since|T. Rex|.  Luckily,|Zinc Alloy|is still easy to listen through in its entirety, mostly because its individual track lengths hover around the three-minute mark, but that isn't enough to overcome to presence of obvious filler.|All of this makes|Zinc Alloy|most appealing as a repository of individually-entertaining tracks.  Foremost among these highlights is \"Teenage Dream\"- a soaring ballad that is arguably the strongest T. Rex single to be released after 1973.  \"Venus Loon\" and \"Explosive Mouth\" should also please the vast majority of casual listeners, assuming they can stomach the overwrought production.  Beyond those three tracks, I have a personal fascination with the|Slider|-esque \"The Avengers (Superbad)\" and the closing \"The Leopards…\", although many hardcore fans may disagree with my enthusiasm here.  The remainder of|Zinc Alloy|is mostly just unexciting, devoid of memorable melodies yet also lacking a clear clunker (although \"Nameless Wildness\" does test my patience with those shrill backing vocals…).  It's just enough to squeak by with a middling, 3.0-star rating, but not enough to warrant an honest recommendation for the album as a whole.|5.8/10|Published|ADVERTISEMENT|yugiaru|Dec 17 2021|▼|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|People back then were really deaf most of the time jesus. You'd think this would be a complete departure from the glam rock style that T. Rex was known for but it's not even that big of a significant change in their sound. There are soul elements in certain songs here and there, but overall, this is 100% pure exaggerated and over the top glam rock as you'd expect from Marc Bolan and his band. Some of the most bizarre songs he ever wrote and made with the band are all on Zinc Alloy, it's such a grandiose album in every sense. Not their best, but I'd count it as part of a great run of albums that began with Electric Warrior.|Published|TheVinylGuy|Sep 02 2021|an elegy to the heroin fuelled hedonism that ran rampant throughout the glam rock era of the early 70s. a ghostly, ghastly, gross experience; a truly cursed album and a terribly bad vibe overall. i love it.|Published|Castrovalva|Jan 24 2021|On this album, T.Rex faceplants into a mess of drugs, alcohol, self-doubt, ego, narcissism, and failed ambition. By 1974, glam rock was treading water, the rise of upstarts like KISS had started to take over, and Bolan completely lost direction with this strange experiment in 'interstellar soul'. Along with Bowie, this one attempts to fuse the British glam stomp with American soul music - only, while 'Young Americans' was a brilliant and inventive pastiche that knew when to stop, this one is a strangely ineffective, rambling mess that never quite decides what it wants to be. The title SOUNDS like it should be some kind of concept album, right? Is Zinc Alloy a person? A place? Who are the hidden riders? None of these questions are answered at any point in the album's tidal wave of verbiage. The first half is a set of more classic T.Rex-sounding songs, culminating in the self-mythologizing of 'Teenage Dream', but the second album descends into rambling, aimless madness. Song titles like 'Painless Persuasion V. The Meathawk Immaculate' and 'The Leopards Featuring Gardenia & The Mighty Slug', which fumble towards profundity, but are little more than Bolan's drunken, drug addled ramblings. He was a few years late for this kind of pseudo-conceptual nonsense in '74. Bolan's ego is so far out of control at this point that the band is now billed as 'Marc Bolan & T.Rex', and the cover art is a weirdly unflattering close up of his pouting face.|And, the production is awful. The playing is fine, but Marc's new girlfriend Gloria Jones is mixed so high that she overpowers every track that she's on. The album is just so overcooked and dense with aimless noodling, misplaced gospel vocals, and Bolan's increasingly incoherent fever dream ramblings that it drags to a completely unsatisfying close. There's a version of it that Edsel put out in the 90's called 'Changes' that strips all of the original production out of it and it is a MUCH better album in pretty much every way.|That said, I love Marc Bolan, so I love this stupid, awful album. It reminds me a lot of 'Be Here Now' by Oasis - it is a product of a band that is now so bloated, drug fucked, drunk, and arrogant, that when it is let loose in the studio with nobody who can say no anymore, the result is stupid, pointless excess in every direction. This is perfect fodder for an episode of 'Trainrecords' or something.|Published|Balance005|Jan 07 2019|Bolan : 9/12|There was a need for change at that point. Even if this cheezy overloaded thing only partially succeeds, it has groove and some kind of dramatic beauty. I had a really hard time getting into it so i can't blame people judging it baldy, especially after just a few listens. I'd admit that the whole thing is dense, long (and it seems longer than it is) and overproduced but there's some magic into it i'd say. While Zinc Alloy may not be one of the strongest T. Rex albums, i'm still deeply attached to it because it's such a unique album withs several great songs which are still quite overlooked in the T. Rex catalogue : Venus Loon, Change, Teenage Dream,  Interstellar Soul...|The 2014 Tony Visconti remaster is the one to get, it sounds terrific (the previous CD releases didn't help restoring the album's reputation).|Published|GARFIELDACRES|Mar 23 2017|Beginning of the end for bolan really,there are some good songs (mostly on side1) and he quite successfully adds a bit of funk to his sound in places. But a lot of the material is definitely patchy and his girlfriend gloria jones vocals don't always work with the songs and she is all over everything.|'teenage dream' is the best thing here by a mile,a reminder of how great bolan's songs and tony visconti's production could be together. Drugs were becoming more of an issue at this point though and their relationship was sorely tested on this album.|Published|MrBlues|Dec 12 2014|This is a disappointing album compared to the earlier glory of Bolan and co. There are a few really good songs, but the rest is just mediocre, non-memorable material. The unique T. Rex sound is here though, it's like a futuristic glam-rock gospel.|The best tracks are \"Venus Loon\", \"Explosive Mouth\", \"Change\" and \"Teenage Dream\". If they dropped off the filler and released just the better songs, it would have made a wonderful EP.|EDIT|: Listening to this again after a few years I find it more pleasing. The last two tracks are pretty good and the band is more funky than ever. I'm also getting more into the backing vocals. Bumped it up from 3 to 3.5 stars.|Published|Page|1|2|3|4|5|>>|Votes are used to help determine the most interesting content on RYM.|Vote up content that is on-topic, within the rules/guidelines, and will likely stay relevant long-term.|Vote down content which breaks the rules.|Catalog|Ratings:|678|Cataloged:|456|Track rating sets:|Track ratings:|55|Rating distribution|Rating trend|Page|1|2|..|4|..|9|..|13|..|18|..|23|..|27|..|32|..|36|..|41|..|46|>>|6 Jul 2023|BlackstarDyl|Try Again, Pal|6 Jul 2023|pass_it_around|28 Jun 2023|juantovar|Vinyl|26 Jun 2023|Redknot52|2 Jun 2023|hwaapczepap|Vinyl|31 May 2023|rupert_X|A shade below Wilco|30 May 2023|nouay|29 May 2023|BreakOut|Great|29 May 2023|IdkSomethingformymami|24 May 2023|slievemore|5 - neutral|23 May 2023|salone|A Certain Fondness|16 May 2023|Pokermask|15 May 2023|MianSwagger|▼|eat a fries|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|14 May 2023|Pulch|Great, solid; definitely listen to it|11 May 2023|themoviejudge|.|.|.|.|.|.|Previous|Next|Tanx|Light of Love|ADVERTISEMENT|Track listing|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|Credits|Tony Visconti|producer|,|string arrangements|Marc Bolan|producer|,|performer|,|writer|,|composer|Mickey Finn|performer|Steve Currie|performer|Bill Legend|performer|Jack Green|performer|Lonnie Jordan|performer|Danny Thompson|performer|B. J. Cole|performer|Sister Pat Hall|backing vocals|The Gloria Jones|backing vocals|Big Richard|backing vocals|Maestro David Katz|strings|The Pop Arts Orchestra|strings|72 Lists|Albums from England - T|Zaragon|1974 Albums Ranked|mgars4|Favorite T. Rex Albums|stanley_the_bugman|Cover Art by Kosh|misterteeth|Tonight’s The Night|BlackstarDyl|Kids... Against the 70s!|massimo73|Series 29 - Generations|minnesotamurray|Albums from 1974 (in no particular order)|ThePunkPanther5|I got 'em on vinyl|DohertyClash|Best Of Crossroads - 1973-1975 - 105 Albums Essentiels|ben007|Love your tan! Albums of 1974 ranked.|Herbie|Lately|Thatstheirbestalbum|BEST 1974'S ALBUM|tblackie|Virtual Crate-Digging: Every Album in My Library|DonRaoul|The Best of T. Rex!|Malchemist|THE BEST OF T.REX|mehhem|See all 72 lists|Comments|Rules for comments|Be respectful!  All the community rules apply here.|Keep your comments focused on the release.  Don't post randomness/off-topic comments.   Jokes are fine, but don't post tactless/inappropriate ones.|Don't get in arguments with people here, or start long discussions.  Use the boards for extended discussion.|Don't use this space to complain about the average rating, chart position, genre voting,  others' reviews or ratings, or errors on the page.|Don't comment just to troll/provoke.  Likewise, don't respond to trollish comments; just report them and ignore them.|Any spoilers should be placed in spoiler tags as such:|[spoiler]|(spoiler goes here)|[/spoiler]|Note|: Unlike reviews, comments are considered temporary and may be deleted/purged without notice.|jjmia|23 Jan 2020 02:45 GMT|Not bad but probably my least favourite from them. It’s too long as well|report|reported|strangefires|12 May 2021 05:55 GMT|I'll have some of what Marc was smoking when he made this|report|reported|abyss_lord|29 Sep 2021 17:52 GMT|Why do I kinda like this lol|Sounds like unintentional zolo|report|reported|ClimateOfHunter|22 Jan 2022 00:38 GMT|It’s wild how much better Teenage Dream is than every other song here. It’s like he used up all his good ideas on that song alone and then went “shit, I still have to write the rest of the album”|report|reported|rogueofmv|28 Jan 01:08 GMT|cedric bixler-zavala|report|reported|mc1382|09 May 09:27 GMT|This is like if one of the members of Dr. Frank-N-Furter's castle made an album|report|reported|krautrockism|20 May 03:30 GMT|mfs with blue eyes|report|reported|Log in to add a comment|Discussion|RYM Artists/Bands Top 20 Thread #132: T. Rex (incl. Tyrannosaurus Rex)|Music Polls/Games|Experimental Left Turns Post-Magnum Opus|Music|What is your favorite underrated album?|Music|comment on the last five rated albums by the user above you|Music Polls/Games|Each artist's best song from each of their albums|Music Polls/Games|Baker's Dozen-Albums|Music Polls/Games|Your favorite artists most underrated albums|Music|Type in random album codes to see what comes up|Music Polls/Games|Unpopular musical opinions.|Music|¿Que estas escuchando ahora mismo?|RYM en español|One Artist Releases with Various Artists on it|Rate Your Music|The RYM Artists Top 10|Music Polls/Games|Subscribe to see similar release suggestions|ADVERTISEMENT|Contributions|Contributors to this release:|hotlove|,|Communique|,|germannnn|,|jkra3168|,|yolz|,|ipoduser|,|unj|,|hugdeserver|,|Drifterdk|,|Lovinda|,|[deleted]|,|alcamus|,|Kronz|Log in|to submit a correction or upload art for this release|.|.|.|.|.|.|ADVERTISEMENT|Close|Close|Rate Your Music|© 2000-2023 Sonemic, Inc.|Site links|RYM Network|RYM|music|Sonemic|new music site (beta)|Cinemos|film (beta)|Glitchwave|video games (beta)|Info|FAQ|Development status|RYMzilla|Submissions|Policy|Database standards|Privacy|Consent|Terms of service|Contact us|Support / Feedback",
          "Marc Bolan Albums: songs, discography, biography, and listening guide - Rate Your Music|sign in|RYM|new music|genres|charts|lists|community|Close|Search:|Music|Film|Games|for:|New Music|Genres|Charts|Lists|Community|Marc Bolan|The Beginning of Doves|Born|30 September 1947,|Hackney, Greater London, United Kingdom|Died|16 September 1977,|Barnes, Greater London, United Kingdom|Member of|Big Carrot|,|Dib Cochran and the Earwigs|,|John's Children|,|T. Rex|Notes|Father of|Rolan Bolan|; founder of|T. Rex|Also Known As|Mark Feld, Toby Tyler|Genres|Glam Rock|,|Contemporary Folk|,|Singer-Songwriter|,|Folk Rock|,|Acoustic Rock|,|Television Music|Share|Follow|651 followers|ADVERTISEMENT|Discography|143|Credits|188|Filmography|5|Album|Showing all (17)|Issues|Average|Avg.|Ratings|Reviews|Ratings/Rev.|Title|/|Release Date|+8|3.23|123|3|123|3|The Beginning of Doves|1974|+10|3.11|60|6|60|6|You Scare Me to Death|1981|+3|3.06|48|3|48|3|Billy Super Duper|1982|•|Marc Bolan & T. Rex|T. Rex|Marc Bolan|3.09|17|1|17|1|Dance in the Midnight|1983|+2|3.08|18|1|18|1|Love and Death|1986|+1|3.22|39|3|39|3|Acoustic Warrior|[archival]|1996|+3|3.50|31|4|31|4|Marc: Songs From the Granada TV Series|[tv soundtrack]|1998|•|Marc Bolan and T. Rex|Marc Bolan|T. Rex|3.84|3|3|-|Twopenny Prince|[archival]|2010|3.98|7|7|-|Beyond the Risin' Sun|2010|2.77|2|2|-|Baby Strange: A Rarities Collection|[archival]|2017|3.50|1|1|-|Misfortune Gatehouse|[archival]|2018|4.00|1|1|-|Tramp King of the City|[archival]|2018|4.00|1|1|-|There Was a Time|[archival]|2018|4.00|1|1|-|Slight Thigh Be-Bop|[archival]|2018|4.53|2|2|-|Home Demos|[archival]|2019|+1|4.02|4|4|-|Pictures of Purple People|[archival]|2019|4.17|3|3|-|Electronic Musik|[archival]|2019|ADVERTISEMENT|Live Album|Showing all (3)|Issues|Average|Avg.|Ratings|Reviews|Ratings/Rev.|Title|/|Release Date|+3|3.54|42|5|42|5|Live 1977|1997|•|Marc Bolan & T. Rex|Marc Bolan|T. Rex|4.00|1|1|-|Marc Bolan & T. Rex (The Acoustic and Live Collection)|[archival]|2009|5.00|1|1|-|Electric Seven 2 at the BBC",
          "|Mark Feld",
          "|I'm well aware that at the time Marc was beginning to incorporate soul (and funk) into his sound (with the aid of his partner Gloria Jones and co.)yet this version of soul tends to sound at times more like a overblown caricature of the sound he was making with Mark Volman and Howard Kaylan. Unfortunately here there was no room for the complementary vocals Mark and Howard excelled at -  more a grossly excessive 'noise' which seemed to all intent and purposes to drown out much of Marc's singing. Beneath all flamboyance and overproduction there are, however, some rather inspired moments. Marc is experimenting  on a number of these tracks rather effectively and some of his guitar work (in particular on 'Carsmile Smith') sounds genuinely soulful.|Zinc Alloy|does have much more to offer than the more simplistic and less consistent|Tanx|certainly, and it's also probably true to say it's Marc's first significant change of direction since|Electric Warrior|.In addition it contains one of Marc's very best singles - the autobiographical 'Teenage Dream'.|It's flawed for sure but Marc's not playing so safe here as on his previous couple of albums and it makes this album perhaps a little more revealing as a result.|Published|ADVERTISEMENT|jbjamieblack|Mar 16 2006|'Zinc Alloy and the Hidden Riders of Tomorrow'|was released in 1974 (which may I say is a splendid title.) As an album people have said that it was a comercial failure. Marc was trying to get rid of the glam rock sound and adding soul and making the T.Rex sound heavier. Adding more strength in backing vocals, heavy guitars, a louder more hard hitting sound.|In my opinion I think this album is under-rated. It deserves more recognition that what It's earned I think. Also the album was a real grower on me. The more I listened to it the more I liked it.|The album starts off with the song 'Venus loon'. 'Venus loon' is a very cathchy song. Same with 'Sound Pit', 'Explosive Mouth', and 'Galaxy'. Also when I listen to all these songs there is something quite magical about it that I just can't put my finger on. 'Change' is a down tempo song which is has a nice sadness about it. Nameless Wildness is a fun song. 'Teenage Dream' the only single from the album. 'Teenage Dream' is a masterpiece! The song is soposed to be about Marc's star on a wane. 'Liquid Gang' another catchy fun song. 'Carsmile Smith and the Old One' is another sad song. Then a beautiful medley arrives - 'You've got to jive to stay alive / Spanish Midnight'. 'Interstellar Soul' - Another fun song. 'Painless Persuasion v. The Meathawauk Immaculate' is another great song. And the last 2 songs are 'The Avengers (Superbad') which is a fun song and 'The Leopards Featuring Gardenia And The Mighty Slug' which is quite weird, Marc does a song where he talks through it which is quite cool.|And the bonus tracks they have added to this collection makes it even more spectacular!|My favourite song on this album is Teenage Dream.|Overall I think this album is an underated classic. I think it should be judged after a few listens. It's not my fave T.Rex album but|I Love It!|Published|slider72|Apr 17 2005|Zinc Alloy, Marc tried to do the name change thing with this one and the record company insisted on Marc Bolan and T.Rex appearing on the sleeve. It was panned when released but through the age of time, songs like \"Change\" Carsmile Smith, The Avengers (Superbad Tiger), Venus Loon, Explosive Mouth, and Teenage Dream, all have improved when listening again and again and again, must be the red wine.|I think the Alternative Issue has more to offer that the Vinyl.|Buy it, play it, put it away, and then in 5 years time you will realise it was a classic T.Rex album or in my case 30+ years|Published|weejum|Apr 16 2005|This is probably Bolan's most bizarre album but I don't think I can rate it as high as his other albums.|Published|<<|Page|1|2|3|4|5|6|>>|Votes are used to help determine the most interesting content on RYM.|Vote up content that is on-topic, within the rules/guidelines, and will likely stay relevant long-term.|Vote down content which breaks the rules.|.|.|.|.|.|.|Track listing|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|Credits|Tony Visconti|producer|,|string arrangements|Marc Bolan|producer|,|performer|,|writer|,|composer|Mickey Finn|performer|Steve Currie|performer|Bill Legend|performer|Jack Green|performer|Lonnie Jordan|performer|Danny Thompson|performer|B. J. Cole|performer|Sister Pat Hall|backing vocals|The Gloria Jones|backing vocals|Big Richard|backing vocals|Maestro David Katz|strings|The Pop Arts Orchestra|strings|.|.|.|.|.|.|ADVERTISEMENT|Close|Close|Rate Your Music|© 2000-2023 Sonemic, Inc.|Site links|RYM Network|RYM|music|Sonemic|new music site (beta)|Cinemos|film (beta)|Glitchwave|video games (beta)|Info|FAQ|Development status|RYMzilla|Submissions|Policy|Database standards|Privacy|Consent|Terms of service|Contact us|Support / Feedback",
          "|a lot of people don't like this lp very much but i think it is one of t rex's best and most interesting offerings.",
          "Review for Zinc Alloy and the Hidden Riders of Tomorrow - Marc Bolan & T. Rex by GARFIELDACRES - Rate Your Music|sign in|RYM|new music|genres|charts|lists|community|Close|Search:|Music|Film|Games|for:|New Music|Genres|Charts|Lists|Community|Welcome to|Rate Your Music|RYM is one of the largest music databases and communities online, which you can use in endless ways to discover new music.|Learn about some of the ways you can use RYM for music discovery.|Zinc Alloy and the Hidden Riders of Tomorrow|(1974)|Marc Bolan & T. Rex|3.19|from 757 ratings|Genres|Glam Rock|Blue-Eyed Soul|Descriptors|melodic, quirky, rhythmic, female vocals, surreal, anxious, uplifting, playful, bittersweet, passionate, lush, male vocals, sensual, energetic|Zinc Alloy and the Hidden Riders of Tomorrow|(1974)|Marc Bolan & T. Rex|Review by|GARFIELDACRES|Beginning of the end for bolan really,there are some good songs (mostly on side1) and he quite successfully adds a bit of funk to his sound in places. But a lot of the material is definitely patchy and his girlfriend gloria jones vocals don't always work with the songs and she is all over everything.|'teenage dream' is the best thing here by a mile,a reminder of how great bolan's songs and tony visconti's production could be together. Drugs were becoming more of an issue at this point though and their relationship was sorely tested on this album.|Expand review|Hide|Close|Close|Rate Your Music|© 2000-2023 Sonemic, Inc.|Site links|RYM Network|RYM|music|Sonemic|new music site (beta)|Cinemos|film (beta)|Glitchwave|video games (beta)|Info|FAQ|Development status|RYMzilla|Submissions|Policy|Database standards|Privacy|Consent|Terms of service|Contact us|Support / Feedback",
          "|Zinc Alloy and the Hidden Riders of Tomorrow or A Creamed Cage in August|33 rpm, Gatefold, Limited Edition|1974|Vinyl LP|EMI|/ BLNA 7751 DELUXE|Zinc Alloy and the Hidden Riders of Tomorrow|33 rpm, Gatefold|1974|Vinyl LP|Jugoton|/ LSEMI - 73003|Zinc Alloy and the Hidden Riders of Tomorrow|33 rpm, Gatefold|1983|Vinyl LP|MARCL 505|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus Tracks|1985|CD|Marc on Wax|/ MARC D 505|Zinc Alloy and the Hidden Riders of Tomorrow|1987|CD|Teldec|/ 8.26713 243 909-2|Zinc Alloy and the Hidden Riders of Tomorrow|33 rpm|1988|Vinyl LP|PDI|/ E-30.1556|Zinc Alloy and the Hidden Riders of Tomorrow|1989|CD|MARCD 505|Change (The Alternate Zinc Alloy)|Archival|1994|CD|Edsel|/ EDCD 440|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus Tracks, Remastered|1994|CD|Edsel|/ EDCD392|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus Tracks, Digipak, Remastered|2000|CD|Repertoire|/ REP 4905|Zinc Alloy and the Hidden Riders of Tomorrow|CD Sized Album Replica, Limited Edition|2001|CD|TECI-24057|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus CD, Bonus Tracks, Deluxe Edition, Digipak|2002|CD|Edsel|/ MEDCD 717|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus CD, Deluxe Edition, Remastered|2005|CD|Rhino|/ R2 73219|Zinc Alloy and the Hidden Riders of Tomorrow|SHM|2009|CD|TECI-26566|Zinc Alloy & The Hidden Riders of Tomorrow|2011|CD|Fat Possum|/ FP1242|Expand all 20 issues|Compact issues|Expand all 20 issues|Credits|Credits|Tony Visconti|producer|,|string arrangements|Marc Bolan|producer|,|performer|,|writer|,|composer|Mickey Finn|performer|Steve Currie|performer|Bill Legend|performer|Jack Green|performer|Lonnie Jordan|performer|Danny Thompson|performer|B. J. Cole|performer|Sister Pat Hall|backing vocals|The Gloria Jones|backing vocals|Big Richard|backing vocals|Maestro David Katz|strings|The Pop Arts Orchestra|strings|45 Reviews|Page|1|2|3|4|5|6|>>|Jewlia|Sep 04 2006|I love T.REX, but I can admit when Marc Bolan sucks.  I like this album because I'm a rabid fan, but I know it's pretty terrible...|OH MARC WHY DID YOU GET FAT AND LET COCAINE MAKE YOU SUCK!   I STILL LOVE YOU ANYWAY MY PORKY PIXIE!|Published|ADVERTISEMENT|Walter12|Feb 25 2022|▼|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|Marc Bolan's career is one of the saddest stories in 70's rock music.  Even before his untimely death in 1977, the reputation of his work with T. Rex was in precipitous decline.  It's no small tragedy to transform from being a true trendsetter into a frustrating mediocrity, and that's precisely what Bolan accomplished in a few short years after inventing the entire genre of glam rock.  1974's|Zinc Alloy|is typically cited as the point where Bolan completely lost his way.  Critically panned at the time of its release, and including unwanted forays into funk and soul, it's a record that succeeded in confusing all but the biggest of T. Rex fanboys.  Fortunately, the album has aged better than many may have excepted.  It's still a big step down from Bolan's last three LPs, but it features enough engaging tunes to placate listeners who aren't wedded to the \"pure\" glam rock sound of|Electric Warrior|and|The Slider|.  Underwhelming but listenable enough to warrant 3.0 stars.|By the release of|Tanx|, the formula that Bolan had been using since|Electric Warrior|was obviously running out of steam.  Yet instead of drifting toward art rock, as was the case with many of his glam rock competitors, Bolan decided to add a more diverse slate of pop influences atop familiarly-structured tunes.  Foremost among the stylistic additions to|Zinc Alloy|are piles of Motown-influenced vocals, courtesy of Bolan's real-life partner Gloria Jones.  There's also a funkier vibe to many of the grooves, as well as full-blown orchestra behind most of the guitar lines.  All of these ingredients are brought together via an overblown, Phil Spector-inspired production (produced by Bolan himself).  The only things that haven't significantly changed are the lead vocals and the self-consciously \"trashy\" guitar lines, even if those elements are given far less space to breath than on previous T. Rex releases.  Every track here is immediately identifiable as a T. Rex tune, but those dense backing arrangements also immediately every tune as a part of|Zinc Alloy|.|Zinc Alloy|is an unusual album for me to honestly assess.  I understand the hate that it received back in the day, and I'm forced to admit that most of the stylistic innovations don't really work, but there's a certain charm that brings me back to the record more often that my rating might suggest.  In particular, for an artist who spent most of the 70's repeating himself, it's great to see Bolan attempt something slightly different.  The only truly unforgivable sin of|Zinc Alloy|is its cluttered, wall-of-sound production.  Bolan clearly wasn't ready to self-produce: if Tony Visconti had been involved, I have little doubt that most of arrangements would've been thinned out.  Gloria Jones' backing vocals are also way too high in the mix.  She's a decent singer, and I'm not completely averse to the funk/soul overtones that distinguish mid-70's T. Rex, but on this record her contributions repeatedly overwhelm Bolan's (always endearing) vocal melodies.  Everything on|Zinc Alloy|is simply way too \"huge\" for its own good.|When considered on a track-by-track basis,|Zinc Alloy|is also a mixed bag.  With both|The Slider|and|Tanx|, Bolan made the annoying decision to leave much of his best material off the studio LPs (in favor of releasing non-album singles); on|Zinc Alloy|, he veers wildly in the opposite direction, packing in every half-worthy idea from the past six months.  A 46-minute runtime doesn't usually result in a record that overstays in its welcome, but it's definitely too long for a T. Rex album.  The end result is a release with as many highs as|Tanx|or|Dandy in the Underworld|(both 3.5 stars), but with considerably more filler than any Bolan release since|T. Rex|.  Luckily,|Zinc Alloy|is still easy to listen through in its entirety, mostly because its individual track lengths hover around the three-minute mark, but that isn't enough to overcome to presence of obvious filler.|All of this makes|Zinc Alloy|most appealing as a repository of individually-entertaining tracks.  Foremost among these highlights is \"Teenage Dream\"- a soaring ballad that is arguably the strongest T. Rex single to be released after 1973.  \"Venus Loon\" and \"Explosive Mouth\" should also please the vast majority of casual listeners, assuming they can stomach the overwrought production.  Beyond those three tracks, I have a personal fascination with the|Slider|-esque \"The Avengers (Superbad)\" and the closing \"The Leopards…\", although many hardcore fans may disagree with my enthusiasm here.  The remainder of|Zinc Alloy|is mostly just unexciting, devoid of memorable melodies yet also lacking a clear clunker (although \"Nameless Wildness\" does test my patience with those shrill backing vocals…).  It's just enough to squeak by with a middling, 3.0-star rating, but not enough to warrant an honest recommendation for the album as a whole.|5.8/10|Published|ADVERTISEMENT|yugiaru|Dec 17 2021|▼|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|People back then were really deaf most of the time jesus. You'd think this would be a complete departure from the glam rock style that T. Rex was known for but it's not even that big of a significant change in their sound. There are soul elements in certain songs here and there, but overall, this is 100% pure exaggerated and over the top glam rock as you'd expect from Marc Bolan and his band. Some of the most bizarre songs he ever wrote and made with the band are all on Zinc Alloy, it's such a grandiose album in every sense. Not their best, but I'd count it as part of a great run of albums that began with Electric Warrior.|Published|TheVinylGuy|Sep 02 2021|an elegy to the heroin fuelled hedonism that ran rampant throughout the glam rock era of the early 70s. a ghostly, ghastly, gross experience; a truly cursed album and a terribly bad vibe overall. i love it.|Published|Castrovalva|Jan 24 2021|On this album, T.Rex faceplants into a mess of drugs, alcohol, self-doubt, ego, narcissism, and failed ambition. By 1974, glam rock was treading water, the rise of upstarts like KISS had started to take over, and Bolan completely lost direction with this strange experiment in 'interstellar soul'. Along with Bowie, this one attempts to fuse the British glam stomp with American soul music - only, while 'Young Americans' was a brilliant and inventive pastiche that knew when to stop, this one is a strangely ineffective, rambling mess that never quite decides what it wants to be. The title SOUNDS like it should be some kind of concept album, right? Is Zinc Alloy a person? A place? Who are the hidden riders? None of these questions are answered at any point in the album's tidal wave of verbiage. The first half is a set of more classic T.Rex-sounding songs, culminating in the self-mythologizing of 'Teenage Dream', but the second album descends into rambling, aimless madness. Song titles like 'Painless Persuasion V. The Meathawk Immaculate' and 'The Leopards Featuring Gardenia & The Mighty Slug', which fumble towards profundity, but are little more than Bolan's drunken, drug addled ramblings. He was a few years late for this kind of pseudo-conceptual nonsense in '74. Bolan's ego is so far out of control at this point that the band is now billed as 'Marc Bolan & T.Rex', and the cover art is a weirdly unflattering close up of his pouting face.|And, the production is awful. The playing is fine, but Marc's new girlfriend Gloria Jones is mixed so high that she overpowers every track that she's on. The album is just so overcooked and dense with aimless noodling, misplaced gospel vocals, and Bolan's increasingly incoherent fever dream ramblings that it drags to a completely unsatisfying close. There's a version of it that Edsel put out in the 90's called 'Changes' that strips all of the original production out of it and it is a MUCH better album in pretty much every way.|That said, I love Marc Bolan, so I love this stupid, awful album. It reminds me a lot of 'Be Here Now' by Oasis - it is a product of a band that is now so bloated, drug fucked, drunk, and arrogant, that when it is let loose in the studio with nobody who can say no anymore, the result is stupid, pointless excess in every direction. This is perfect fodder for an episode of 'Trainrecords' or something.|Published|Balance005|Jan 07 2019|Bolan : 9/12|There was a need for change at that point. Even if this cheezy overloaded thing only partially succeeds, it has groove and some kind of dramatic beauty. I had a really hard time getting into it so i can't blame people judging it baldy, especially after just a few listens. I'd admit that the whole thing is dense, long (and it seems longer than it is) and overproduced but there's some magic into it i'd say. While Zinc Alloy may not be one of the strongest T. Rex albums, i'm still deeply attached to it because it's such a unique album withs several great songs which are still quite overlooked in the T. Rex catalogue : Venus Loon, Change, Teenage Dream,  Interstellar Soul...|The 2014 Tony Visconti remaster is the one to get, it sounds terrific (the previous CD releases didn't help restoring the album's reputation).|Published|GARFIELDACRES|Mar 23 2017|Beginning of the end for bolan really,there are some good songs (mostly on side1) and he quite successfully adds a bit of funk to his sound in places. But a lot of the material is definitely patchy and his girlfriend gloria jones vocals don't always work with the songs and she is all over everything.|'teenage dream' is the best thing here by a mile,a reminder of how great bolan's songs and tony visconti's production could be together. Drugs were becoming more of an issue at this point though and their relationship was sorely tested on this album.|Published|MrBlues|Dec 12 2014|This is a disappointing album compared to the earlier glory of Bolan and co. There are a few really good songs, but the rest is just mediocre, non-memorable material. The unique T. Rex sound is here though, it's like a futuristic glam-rock gospel.|The best tracks are \"Venus Loon\", \"Explosive Mouth\", \"Change\" and \"Teenage Dream\". If they dropped off the filler and released just the better songs, it would have made a wonderful EP.|EDIT|: Listening to this again after a few years I find it more pleasing. The last two tracks are pretty good and the band is more funky than ever. I'm also getting more into the backing vocals. Bumped it up from 3 to 3.5 stars.|Published|Page|1|2|3|4|5|6|>>|Votes are used to help determine the most interesting content on RYM.|Vote up content that is on-topic, within the rules/guidelines, and will likely stay relevant long-term.|Vote down content which breaks the rules.|Catalog|Ratings:|757|Cataloged:|569|Track rating sets:|Track ratings:|57|Rating distribution|Rating trend|Page|1|2|..|5|..|10|..|15|..|20|..|25|..|30|..|35|..|40|..|45|..|51|>>|6 Jul 2023|BlackstarDyl|Try Again, Pal|6 Jul 2023|pass_it_around|28 Jun 2023|juantovar|Vinyl|26 Jun 2023|Redknot52|2 Jun 2023|hwaapczepap|Vinyl|31 May 2023|rupert_X|A shade below Wilco|30 May 2023|nouay|29 May 2023|BreakOut|Great|29 May 2023|IdkSomethingformymami|24 May 2023|slievemore|5 - neutral|23 May 2023|salone|A Certain Fondness|16 May 2023|Pokermask|15 May 2023|MianSwagger|▼|eat a fries|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|14 May 2023|Pulch|Great, solid; definitely listen to it|11 May 2023|themoviejudge|.|.|.|.|.|.|Previous|Next|Tanx|Light of Love|ADVERTISEMENT|Track listing|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|Credits|Tony Visconti|producer|,|string arrangements|Marc Bolan|producer|,|performer|,|writer|,|composer|Mickey Finn|performer|Steve Currie|performer|Bill Legend|performer|Jack Green|performer|Lonnie Jordan|performer|Danny Thompson|performer|B. J. Cole|performer|Sister Pat Hall|backing vocals|The Gloria Jones|backing vocals|Big Richard|backing vocals|Maestro David Katz|strings|The Pop Arts Orchestra|strings|84 Lists|Ranking Music 1974|dementri06|1974:Top 70 Rock Album|vanKuver|My Miniature LPs..|muzex|Series 29 - Generations|minnesotamurray|Worst album names|mibesu|Alphabetic albums, 20 per letter?|ronb626|1974|juicefacekilla|MY OWN VINYL COLLECTION (MY T. REX, MARC BOLAN´S ALBUMS)|mikelarambur|Wam Bam Thank You Glam !|popandcircumstance|Best Of Crossroads - 1973-1975 - 105 Albums Essentiels|ben007|My Top 100 Albums of All Time|List3n|My 1974 Albums, Muhammad Ali vs George Foreman|theflynet|My Album Collection [LP]|DaOneAndOnly1234|I got 'em on vinyl|DohertyClash|Purchases 2009|DrCrower|2018 - 580 Albums I listened to|djiaind|See all 84 lists|Comments|Rules for comments|Be respectful!  All the community rules apply here.|Keep your comments focused on the release.  Don't post randomness/off-topic comments.   Jokes are fine, but don't post tactless/inappropriate ones.|Don't get in arguments with people here, or start long discussions.  Use the boards for extended discussion.|Don't use this space to complain about the average rating, chart position, genre voting,  others' reviews or ratings, or errors on the page.|Don't comment just to troll/provoke.  Likewise, don't respond to trollish comments; just report them and ignore them.|Any spoilers should be placed in spoiler tags as such:|[spoiler]|(spoiler goes here)|[/spoiler]|Note|: Unlike reviews, comments are considered temporary and may be deleted/purged without notice.|jjmia|23 Jan 2020 02:45 GMT|Not bad but probably my least favourite from them. It’s too long as well|report|reported|strangefires|12 May 2021 05:55 GMT|I'll have some of what Marc was smoking when he made this|report|reported|abyss_lord|29 Sep 2021 17:52 GMT|Why do I kinda like this lol|Sounds like unintentional zolo|report|reported|ClimateOfHunter|22 Jan 2022 00:38 GMT|It’s wild how much better Teenage Dream is than every other song here. It’s like he used up all his good ideas on that song alone and then went “shit, I still have to write the rest of the album”|report|reported|rogueofmv|28 Jan 01:08 GMT|cedric bixler-zavala|report|reported|mc1382|09 May 09:27 GMT|This is like if one of the members of Dr. Frank-N-Furter's castle made an album|report|reported|krautrockism|20 May 03:30 GMT|mfs with blue eyes|report|reported|Log in to add a comment|Discussion|RYM Artists/Bands Top 20 Thread #132: T. Rex (incl. Tyrannosaurus Rex)|Music Polls/Games|Experimental Left Turns Post-Magnum Opus|Music|What is your favorite underrated album?|Music|comment on the last five rated albums by the user above you|Music Polls/Games|Each artist's best song from each of their albums|Music Polls/Games|Baker's Dozen-Albums|Music Polls/Games|Your favorite artists most underrated albums|Music|Type in random album codes to see what comes up|Music Polls/Games|Unpopular musical opinions.|Music|¿Que estas escuchando ahora mismo?|RYM en español|One Artist Releases with Various Artists on it|Rate Your Music|The RYM Artists Top 10|Music Polls/Games|Subscribe to see similar release suggestions|ADVERTISEMENT|Contributions|Contributors to this release:|hotlove|,|Communique|,|germannnn|,|jkra3168|,|yolz|,|ipoduser|,|unj|,|hugdeserver|,|Drifterdk|,|Lovinda|,|[deleted]|,|alcamus|,|Kronz|Log in|to submit a correction or upload art for this release|.|.|.|.|.|.|ADVERTISEMENT|Close|Close|Rate Your Music|© 2000-2023 Sonemic, Inc.|Site links|RYM Network|RYM|music|Sonemic|new music site (beta)|Cinemos|film (beta)|Glitchwave|video games (beta)|Info|FAQ|Development status|RYMzilla|Submissions|Policy|Database standards|Privacy|Consent|Terms of service|Contact us|Support / Feedback",
          "|It would be easy to dismiss \"Bolan's Zip Gun\" as a misfire, his only album in the 70's to miss the charts completely. Yes, it misses the production talent of Tony Visconti and the songs are a level or three below those of his early 70's heyday.|Unlike his contemporaries Bowie and Ferry, Bolan was never granted respected album-maker status so that when the TRextasy of his teenyboppers abated, he found himself in an artistic cul-de-sac and his commercial prospects greatly diminished.|To do him fair, he just ploughed on and kept going right up until his tragically early death only a couple of years later but this particular record finds him betwixt and between in no Marc's Land, lacking in inspiration and consistency. The guy who'd produced some of the best riffs of the decade (\"Get It On\", \"Telegram Sam' and \"20th Century Boy\", to name but three) is instead flailing about hoping another heavy one will land on him but it's more ifs than riffs, I'm sorry to say.|The album-bookending singles are okay, the cheery but lightweight \"Light Of Love\" and the punchier, keyboard-driven \"Zip Gun Boogie\" but in between there's more effort than excellence on display. You do miss Visconti's magical way especially with strings as a good number of the tracks sound underpowered, undeedeveloped and yes, under-produced, there's barely a string arrangement or horns break to provide a point of difference never mind excitement to the songs.|Perhaps the more stripped-back sound reflects a conscious decision by Bolan himself as producer but the songs are mostly slight with often trite lyrics and little of the love-him-or-hate-him cocksure confidence which carried him through his initial success.|That said, a little elfin magic goes a long way and you can hear him striving for inspiration throughout, throwing everything at the wall and hoping something might stick but in the end the material just fails to excite. Choruses are repeated over and over to often basic arrangements with too many songs given over to the over-loud female backing singers, who prominently included his future wife Gloria Jones.|\"Solid Baby\" sounds like a rewrite of Roy Orbison's \"Dream Baby\", ditto \"Token Of My Love\" and Phil Phillips's \"Sea Of Love\" right down to re-using its opening line while Bolan would never admit that his \"Precious Star\" seems to crib from friend-turned-rival David Bowie's \"The Prettiest Star\". He also can't resist referencing Bowie's \"Diamond Dogs\" in|\"I Really Love You Babe\", the track where I just about offered up my aural submission to his caterwauling choir.|Others like \"Space Boss\", \"Think Zinc\" and \"Girl in the Thunderbolt Suit\" sound like choruses in search of songs and even though \"Til Dawn\" and \"Golden Belt\" both aim for something heavier they likewise struggle to really deliver.|You had to feel for Bolan at this stage of his career, seeing Bowie and Ferry at the time achieve the artistic integrity and respectability never mind record sales denied to him. To be frank, this record didn't deserve much more than it got both from the critics and the public but better was to come from the Bopping Elf before he met his sad end in early 1977.|Published|ADVERTISEMENT|Walter12|Mar 05 2022|▼|A1|Light of Love|A2|Solid Baby|A3|Precious Star|A4|Token of My Love|A5|Space Boss|A6|Think Zinc|B1|Till Dawn|B2|Girl in the Thunderbolt Suit|B3|I Really Love You Babe|B4|Golden Belt|B5|Zip Gun Boogie|Glam has always been a divisive genre, with unsympathetic listeners deriding most glam rock as \"trashy\" and self-consciously \"kitsch\".  Such accusations are especially common with a band like T. Rex, whose comparatively unambitious approach is easy to dismiss as repetitive or downright naïve.  Now, I have little doubt that a purposefully unsophisticated sound was on Marc Bolan's mind when he founded glam rock back in 1971, but that doesn't mean that I'd categorize the bulk of T. Rex's discography as kitsch.  The one place where this hesitancy fades is with respect to|Bolan's Zip Gun|.  Widely considered to be the nadir of Bolan's glam rock phase, it's a record where all of T. Rex's least endearing aspects take center stage.  The end result isn't quite a disaster, but it routinely crosses the boundary into trashy mediocrity.  An utterly superfluous record for someone who isn't already a devoted T. Rex fan.|Bolan's Zip Gun|expands upon the stylistic \"innovations\" of|Zinc Alloy|while ditching its predecessor's overblown, wall-of-sound production.  Every track here still qualifies as straightforward glam rock, with T. Rex's usual supply of toe-tapping grooves and elfin vocals, but Bolan has continued to pile on bits of soul and funk.  These developments are epitomized in the backing vocals of Gloria Jones- Bolan's real-life partner, and by this point an essential component in his songwriting process.  Jones' full-throated vocals repeatedly crowd out Bolan's more understated contributions, to the degree that many tracks border on becoming full-blown duets.|Bolan's Zip Gun|also features more saxophone than any previous T. Rex release, whereas the electric guitar (when it actually appears) is sometimes distorted to such a degree that it's difficult to distinguish from saxophone.  Rounding out the overall vibe are a collection of vocal melodies that are simplistic even by T. Rex standards, with \"choruses\" than often involve little more than repeating a single phrase with minor difference in inflection.|As I've stated in earlier T. Rex reviews, I'm not openly averse to Bolan's infatuation with funk and soul infatuations, but I'm repeatedly underwhelmed by how Bolan actually implements those touches.|Bolan's Zip Gun|only accentuates many of Bolan's worst habits with respect to the style.  In particular, I'm routinely bothered by Jones' backing vocals.  She's always way too far up in the mix, and she repeatedly opts for a shrill tone that clashes with Bolan's understated delivery.  Nearly as frustrating is the fact that all those toe-tapping grooves seem to have convinced Bolan that his vocal melodies don't require melodic development.  Many of the album's vocal melodies are built around a catchy hook, but then Bolan absolutely beats that hook to death.  The only way that|Bolan's Zip Gun|represents an improvement over|Zinc Alloy|is via its crisper production, which harkens all of the way back to|Electric Warrior|.  Bolan has come a long way as a producer since|Zinc Alloy|, even if I'm sure that he would've been far better off with Tony Visconti in the production studio.|Bolan's Zip Gun|also features fewer great tracks than any other T. Rex record of the decade.  This lack of highlights extends all of the way up to the album's lead single, \"Light of Love\".  I simply can't understand the appeal of that track, either from a glam perspective or a pop soul perspective, seeing as I find it's repetitive vocal hook to be borderline-annoying.  Arguably Bolan's weakest single that charted relatively well.  The album's other single, \"Zip Gun Boogie\", is far more entertaining but still pales in comparison to most T. Rex hits.  Alongside \"Space Boss\" and \"Think Zinc\", \"Zip Gun Boogie\" is also one of the tracks off|Bolan's Zip Gun|were Bolan fully gives succumbs to unapologetic kitsch.  A guilty pleasure, perhaps, but little more.  The rest of|Bolan's Zip Gun|is consistently listenable but never great.  My (apparently unconventional) choice for the album's best deep cut is \"Girl in the Thunderbolt Suit\"- an interesting mix of rock 'n roll with pop soul that features more vocal swagger than anything else here.  \"Solid Baby\", \"Think Zinc\", and \"I Really Love You Babe\" are also worthy of mention, but none of these tracks invite repeated listening.|I suppose it's a testament to Bolan's talent that even the weakest (mature) record of his career is still semi-engaging enough to warrant 2.5 stars.  Just don't mistake this admission for an endorsement.|Bolan's Zip Gun|is still utterly inessential, even by the incredibly modest standard of other 2.5-star albums in my 70's rock collection.  Luckily, Bolan would subsequently recover some semblance of his mojo on|Futuristic Dragon|, leaving|Bolan's Zip Gun|as the sole T. Rex album in the 2.5-star tier.|5.3/10|Published|Castrovalva|Jan 24 2021|The most common take on this album is that it is Bolan's absolute nadir, was recorded when he was a fat, bloated drug addict, and is packed with derivative, nonsensical garbage that squanders his talent. Everyone is wrong - 'Bolan's Zip Gun' is a fucking GREAT record, and kicks off the final arc of his career, after the slump into the excessive lunacy of the 'Zinc Alloy' era. Here, T.Rex is completely stripped back and lean, and the glam/soul fusion actually works really well. 'Light Of Love' is classic T.Rex, 'Solid Baby'  is lean and randy, and on 'Token Of My Love', Bolan manages to merge his twiddly guitar antics with the screaming vocals of Gloria Jones to extremely impressive effect. Gloria is still waaaay high in the mix here, but she's less obnoxious than on 'Zinc Alloy', and some attempt seems to have been made to fold her into the sound, rather than letting her sit on top. Produced by Bolan, the lack of Visconti's hand doesn't destroy this material - the sound is leaner, starker, and harder. It's definitely a different direction, but it's fucking great.|The two tracks that I really love from this one are 'Zip Gun Boogie' and 'Golden Belt'. 'Zip Gun Boogie' pairs one of the best hard rock riffs that Bolan would ever right, with an excellent 'The Groover'-esque verse. That descending, crunchy lead line in the intro and chorus - it's just awesome. And, 'Golden Belt' is a soul/funk jam full of tinkling pianos, suspended chords, and great use made of Gloria's vocals. So, ignore all of the people who ran this album down for the last 40 years - THIS, and not 'Futuristic Dragon', is the ACTUAL rebirth of T.Rex, and kicks off Bolan's remarkable late 70's comeback as one of the architects of punk.|Published|Balance005|Jan 07 2019|Bolan : 10/12|The album is often seen as a career nadir. Bolan eventually admitted the record was a failure, saying it was completely over-produced and the worst he made. Even if it is, the fact that Bolan's career lasted only about 10 years makes that not such a huge statement. Thinking about it i'm not really sure i'd take \"Prophets...\" over that one. Anyway what i meant to say was simply that the album is not that bad at all. Bolan's Zip Gun can be either fun (most of the songs are pleasantly funny, even the stupid Zip Gun Boogie) or irritating because of the production and bad tastes (Zip Gun Boogie, Space Boss...). There is less violins than in Zinc Alloy, probably because Visconti is gone (he worked on Till Dawn though). The female backing vocals remain very intrusive, you have to be prepared for that.  To put it simply, when i want my T. Rex to be shiny, fun and easy, i can put that one and appreciate it. It's a bit inconsequential and hard to digest but it's also awkwardly fun. There is some life in it that's for sure. A short and sweet listening experience as far as i'm concerned.|Published|GARFIELDACRES|Mar 23 2017|Carries on from 'zinc alloy' really,with marc continuing to add his own spin on funk and disco to his sound. The songs are nearly all pretty repetitive and mostly lacking in magic,and lacking on the kind of smooth rhythms and grooves that bowie managed with 'young americans' for instance. Bolan had taken over production too,and the sound badly misses tony visconti's touch.|That said it's probably slightly more listenable than 'zinc alloy' and boasts a couple of very decent tracks in 'zip gun boogie' and 'til dawn'... the latter frustratingly being the only occasion here where it sounds like he was capable of achieving the kind of music he was clearly after here.|Published|Warthur|Oct 17 2012|Bolan's Zip Gun continues the approach of Zinc Alloy and the Hidden Riders of Tomorrow when it comes to fusing soul with the glam rock sound, though less successfully - in particular, I kind of miss the bombastic over-the-top production job the previous album had. Light of Love is charming, and Think Zinc is an engaging enough stomper, but a lot of the songs on here (including the entire second side) are just kind of forgettable. It's not a bad album and T. Rex fans will find reasons to enjoy it, but at the same time I think it might be their least successful studio albums if you discount posthumous material. Now, if I could only get the refrain from Think Zinc out of my head...|Published|Page|1|2|3|4|>>|Votes are used to help determine the most interesting content on RYM.|Vote up content that is on-topic, within the rules/guidelines, and will likely stay relevant long-term.|Vote down content which breaks the rules.|Catalog|Ratings:|557|Cataloged:|365|Track rating sets:|Track ratings:|32|Rating distribution|Rating trend|Page|1|2|3|..|7|..|11|..|15|..|19|..|22|..|26|..|30|..|34|..|38|>>|28 Jun 2023|juantovar|Vinyl|26 Jun 2023|Redknot52|29 May 2023|BreakOut|Really good|29 May 2023|IdkSomethingformymami|26 May 2023|salone|Pleasurable Feelings|25 May 2023|Lejink|17 May 2023|Pokermask|16 May 2023|Piggy_Better|11 May 2023|themoviejudge|3 May 2023|MordoGoodIGuess|Barnes & Noble Record Aisle|2 May 2023|BlackMidiIsMid|Thom Yorke (Matt Bellamy)|2 May 2023|feloniousPUNK|26 Apr 2023|HermitCook|Bad|17 Apr 2023|leonardohiei|13 Apr 2023|Jamie_Spraggon|CD|Below Average|.|.|.|.|Previous|Next|Light of Love|Futuristic Dragon|ADVERTISEMENT|Track listing|A1|Light of Love|3:15|A2|Solid Baby|2:36|A3|Precious Star|2:51|A4|Token of My Love|3:39|A5|Space Boss|2:47|A6|Think Zinc|3:20|B1|Till Dawn|3:01|B2|Girl in the Thunderbolt Suit|2:19|B3|I Really Love You Babe|3:31|B4|Golden Belt|2:39|B5|Zip Gun Boogie|3:18|Total length: 33:16|Credits|Marc Bolan|writer|,|producer|,|vocals|,|guitar|Steve Currie|bass|Gloria Jones|vocals|,|Clavinet|David Lutton|drums|Dino Dines|keyboards|Mickey Finn|percussion|Keith Morris|photography|John Kosh|artwork|46 Lists|1975 Albums Ranked|mgars4|A Listener's Diary 2017|yerblues|Favourite Albums of 1975|turbotiger|1975: Albums Ranked|metsfan5150|\"All Schools are Strange\": Marc Bolan Roop's Top 150 Songs...|rupertlenz|Ranking T.Rex's Studio Albums|mtopper|Ranking Marc Bolan T.Rex|beestie|Virtual Crate-Digging: Every Album in My Library|DonRaoul|The Best of T. Rex!|Malchemist|1975|kenjah|Albums from 1975 (in no particular order)|ThePunkPanther5|Earthbound: Samples, References, etc.|chainchomp|1975 - The Best of (According to Jake)|jakelicious|T. REX : Best to Worst|BoboOtter|NEW MUSIC|MianSwagger|Best Records from 1975|bubrub|See all 46 lists|Comments|Rules for comments|Be respectful!  All the community rules apply here.|Keep your comments focused on the release.  Don't post randomness/off-topic comments.   Jokes are fine, but don't post tactless/inappropriate ones.|Don't get in arguments with people here, or start long discussions.  Use the boards for extended discussion.|Don't use this space to complain about the average rating, chart position, genre voting,  others' reviews or ratings, or errors on the page.|Don't comment just to troll/provoke.  Likewise, don't respond to trollish comments; just report them and ignore them.|Any spoilers should be placed in spoiler tags as such:|[spoiler]|(spoiler goes here)|[/spoiler]|Note|: Unlike reviews, comments are considered temporary and may be deleted/purged without notice.|jjmia|23 Jan 2020 02:45 GMT|His most underrated album. Better and more focused than Zinc Alloy|report|reported|crackitydjango|24 Jun 07:33 GMT|*Listens to Gary Glitter and Sweet for a month* *Snorts a line of cocaine* *Adjusts jumpsuit and roller skates* *Fix up the old mascara* *Warm up the amps* *Invite your closest friends over to clap into a microphone* Alright gang, let's rock!|report|reported|Log in to add a comment|Discussion|RYM Artists/Bands Top 20 Thread #132: T. Rex (incl. Tyrannosaurus Rex)|Music Polls/Games|Each artist's best song from each of their albums|Music Polls/Games|Your favorite songs from albums you've rated 2.0 or worse|Music|Baker's Dozen-Albums|Music Polls/Games|The Album Title show|Music Polls/Games|Unpopular musical opinions.|Music|Subscribe to see similar release suggestions|ADVERTISEMENT|Contributions|Contributors to this release:|hotlove|,|PierT|,|jkra3168|,|fixbutte|,|unj|,|jg_|,|alcamus|,|Kronz|Log in|to submit a correction or upload art for this release|.|.|.|.|ADVERTISEMENT|Close|Close|Rate Your Music|© 2000-2023 Sonemic, Inc.|Site links|RYM Network|RYM|music|Sonemic|new music site (beta)|Cinemos|film (beta)|Glitchwave|video games (beta)|Info|FAQ|Development status|RYMzilla|Submissions|Policy|Database standards|Privacy|Consent|Terms of service|Contact us|Support / Feedback",
          "|It would be easy to dismiss \"Bolan's Zip Gun\" as a misfire, his only album in the 70's to miss the charts completely. Yes, it misses the production talent of Tony Visconti and the songs are a level or three below those of his early 70's heyday.|Unlike his contemporaries Bowie and Ferry, Bolan was never granted respected album-maker status so that when the TRextasy of his teenyboppers abated, he found himself in an artistic cul-de-sac and his commercial prospects greatly diminished.|To do him fair, he just ploughed on and kept going right up until his tragically early death only a couple of years later but this particular record finds him betwixt and between in no Marc's Land, lacking in inspiration and consistency. The guy who'd produced some of the best riffs of the decade (\"Get It On\", \"Telegram Sam' and \"20th Century Boy\", to name but three) is instead flailing about hoping another heavy one will land on him but it's more ifs than riffs, I'm sorry to say.|The album-bookending singles are okay, the cheery but lightweight \"Light Of Love\" and the punchier, keyboard-driven \"Zip Gun Boogie\" but in between there's more effort than excellence on display. You do miss Visconti's magical way especially with strings as a good number of the tracks sound underpowered, undeedeveloped and yes, under-produced, there's barely a string arrangement or horns break to provide a point of difference never mind excitement to the songs.|Perhaps the more stripped-back sound reflects a conscious decision by Bolan himself as producer but the songs are mostly slight with often trite lyrics and little of the love-him-or-hate-him cocksure confidence which carried him through his initial success.|That said, a little elfin magic goes a long way and you can hear him striving for inspiration throughout, throwing everything at the wall and hoping something might stick but in the end the material just fails to excite. Choruses are repeated over and over to often basic arrangements with too many songs given over to the over-loud female backing singers, who prominently included his future wife Gloria Jones.|\"Solid Baby\" sounds like a rewrite of Roy Orbison's \"Dream Baby\", ditto \"Token Of My Love\" and Phil Phillips's \"Sea Of Love\" right down to re-using its opening line while Bolan would never admit that his \"Precious Star\" seems to crib from friend-turned-rival David Bowie's \"The Prettiest Star\". He also can't resist referencing Bowie's \"Diamond Dogs\" in|\"I Really Love You Babe\", the track where I just about offered up my aural submission to his caterwauling choir.|Others like \"Space Boss\", \"Think Zinc\" and \"Girl in the Thunderbolt Suit\" sound like choruses in search of songs and even though \"Til Dawn\" and \"Golden Belt\" both aim for something heavier they likewise struggle to really deliver.|You had to feel for Bolan at this stage of his career, seeing Bowie and Ferry at the time achieve the artistic integrity and respectability never mind record sales denied to him. To be frank, this record didn't deserve much more than it got both from the critics and the public but better was to come from the Bopping Elf before he met his sad end in early 1977.|Published|ADVERTISEMENT|Walter12|Mar 05 2022|▼|A1|Light of Love|A2|Solid Baby|A3|Precious Star|A4|Token of My Love|A5|Space Boss|A6|Think Zinc|B1|Till Dawn|B2|Girl in the Thunderbolt Suit|B3|I Really Love You Babe|B4|Golden Belt|B5|Zip Gun Boogie|Glam has always been a divisive genre, with unsympathetic listeners deriding most glam rock as \"trashy\" and self-consciously \"kitsch\".  Such accusations are especially common with a band like T. Rex, whose comparatively unambitious approach is easy to dismiss as repetitive or downright naïve.  Now, I have little doubt that a purposefully unsophisticated sound was on Marc Bolan's mind when he founded glam rock back in 1971, but that doesn't mean that I'd categorize the bulk of T. Rex's discography as kitsch.  The one place where this hesitancy fades is with respect to|Bolan's Zip Gun|.  Widely considered to be the nadir of Bolan's glam rock phase, it's a record where all of T. Rex's least endearing aspects take center stage.  The end result isn't quite a disaster, but it routinely crosses the boundary into trashy mediocrity.  An utterly superfluous record for someone who isn't already a devoted T. Rex fan.|Bolan's Zip Gun|expands upon the stylistic \"innovations\" of|Zinc Alloy|while ditching its predecessor's overblown, wall-of-sound production.  Every track here still qualifies as straightforward glam rock, with T. Rex's usual supply of toe-tapping grooves and elfin vocals, but Bolan has continued to pile on bits of soul and funk.  These developments are epitomized in the backing vocals of Gloria Jones- Bolan's real-life partner, and by this point an essential component in his songwriting process.  Jones' full-throated vocals repeatedly crowd out Bolan's more understated contributions, to the degree that many tracks border on becoming full-blown duets.|Bolan's Zip Gun|also features more saxophone than any previous T. Rex release, whereas the electric guitar (when it actually appears) is sometimes distorted to such a degree that it's difficult to distinguish from saxophone.  Rounding out the overall vibe are a collection of vocal melodies that are simplistic even by T. Rex standards, with \"choruses\" than often involve little more than repeating a single phrase with minor difference in inflection.|As I've stated in earlier T. Rex reviews, I'm not openly averse to Bolan's infatuation with funk and soul infatuations, but I'm repeatedly underwhelmed by how Bolan actually implements those touches.|Bolan's Zip Gun|only accentuates many of Bolan's worst habits with respect to the style.  In particular, I'm routinely bothered by Jones' backing vocals.  She's always way too far up in the mix, and she repeatedly opts for a shrill tone that clashes with Bolan's understated delivery.  Nearly as frustrating is the fact that all those toe-tapping grooves seem to have convinced Bolan that his vocal melodies don't require melodic development.  Many of the album's vocal melodies are built around a catchy hook, but then Bolan absolutely beats that hook to death.  The only way that|Bolan's Zip Gun|represents an improvement over|Zinc Alloy|is via its crisper production, which harkens all of the way back to|Electric Warrior|.  Bolan has come a long way as a producer since|Zinc Alloy|, even if I'm sure that he would've been far better off with Tony Visconti in the production studio.|Bolan's Zip Gun|also features fewer great tracks than any other T. Rex record of the decade.  This lack of highlights extends all of the way up to the album's lead single, \"Light of Love\".  I simply can't understand the appeal of that track, either from a glam perspective or a pop soul perspective, seeing as I find it's repetitive vocal hook to be borderline-annoying.  Arguably Bolan's weakest single that charted relatively well.  The album's other single, \"Zip Gun Boogie\", is far more entertaining but still pales in comparison to most T. Rex hits.  Alongside \"Space Boss\" and \"Think Zinc\", \"Zip Gun Boogie\" is also one of the tracks off|Bolan's Zip Gun|were Bolan fully gives succumbs to unapologetic kitsch.  A guilty pleasure, perhaps, but little more.  The rest of|Bolan's Zip Gun|is consistently listenable but never great.  My (apparently unconventional) choice for the album's best deep cut is \"Girl in the Thunderbolt Suit\"- an interesting mix of rock 'n roll with pop soul that features more vocal swagger than anything else here.  \"Solid Baby\", \"Think Zinc\", and \"I Really Love You Babe\" are also worthy of mention, but none of these tracks invite repeated listening.|I suppose it's a testament to Bolan's talent that even the weakest (mature) record of his career is still semi-engaging enough to warrant 2.5 stars.  Just don't mistake this admission for an endorsement.|Bolan's Zip Gun|is still utterly inessential, even by the incredibly modest standard of other 2.5-star albums in my 70's rock collection.  Luckily, Bolan would subsequently recover some semblance of his mojo on|Futuristic Dragon|, leaving|Bolan's Zip Gun|as the sole T. Rex album in the 2.5-star tier.|5.3/10|Published|Castrovalva|Jan 24 2021|The most common take on this album is that it is Bolan's absolute nadir, was recorded when he was a fat, bloated drug addict, and is packed with derivative, nonsensical garbage that squanders his talent. Everyone is wrong - 'Bolan's Zip Gun' is a fucking GREAT record, and kicks off the final arc of his career, after the slump into the excessive lunacy of the 'Zinc Alloy' era. Here, T.Rex is completely stripped back and lean, and the glam/soul fusion actually works really well. 'Light Of Love' is classic T.Rex, 'Solid Baby'  is lean and randy, and on 'Token Of My Love', Bolan manages to merge his twiddly guitar antics with the screaming vocals of Gloria Jones to extremely impressive effect. Gloria is still waaaay high in the mix here, but she's less obnoxious than on 'Zinc Alloy', and some attempt seems to have been made to fold her into the sound, rather than letting her sit on top. Produced by Bolan, the lack of Visconti's hand doesn't destroy this material - the sound is leaner, starker, and harder. It's definitely a different direction, but it's fucking great.|The two tracks that I really love from this one are 'Zip Gun Boogie' and 'Golden Belt'. 'Zip Gun Boogie' pairs one of the best hard rock riffs that Bolan would ever right, with an excellent 'The Groover'-esque verse. That descending, crunchy lead line in the intro and chorus - it's just awesome. And, 'Golden Belt' is a soul/funk jam full of tinkling pianos, suspended chords, and great use made of Gloria's vocals. So, ignore all of the people who ran this album down for the last 40 years - THIS, and not 'Futuristic Dragon', is the ACTUAL rebirth of T.Rex, and kicks off Bolan's remarkable late 70's comeback as one of the architects of punk.|Published|Balance005|Jan 07 2019|Bolan : 10/12|The album is often seen as a career nadir. Bolan eventually admitted the record was a failure, saying it was completely over-produced and the worst he made. Even if it is, the fact that Bolan's career lasted only about 10 years makes that not such a huge statement. Thinking about it i'm not really sure i'd take \"Prophets...\" over that one. Anyway what i meant to say was simply that the album is not that bad at all. Bolan's Zip Gun can be either fun (most of the songs are pleasantly funny, even the stupid Zip Gun Boogie) or irritating because of the production and bad tastes (Zip Gun Boogie, Space Boss...). There is less violins than in Zinc Alloy, probably because Visconti is gone (he worked on Till Dawn though). The female backing vocals remain very intrusive, you have to be prepared for that.  To put it simply, when i want my T. Rex to be shiny, fun and easy, i can put that one and appreciate it. It's a bit inconsequential and hard to digest but it's also awkwardly fun. There is some life in it that's for sure. A short and sweet listening experience as far as i'm concerned.|Published|GARFIELDACRES|Mar 23 2017|Carries on from 'zinc alloy' really,with marc continuing to add his own spin on funk and disco to his sound. The songs are nearly all pretty repetitive and mostly lacking in magic,and lacking on the kind of smooth rhythms and grooves that bowie managed with 'young americans' for instance. Bolan had taken over production too,and the sound badly misses tony visconti's touch.|That said it's probably slightly more listenable than 'zinc alloy' and boasts a couple of very decent tracks in 'zip gun boogie' and 'til dawn'... the latter frustratingly being the only occasion here where it sounds like he was capable of achieving the kind of music he was clearly after here.|Published|Warthur|Oct 17 2012|Bolan's Zip Gun continues the approach of Zinc Alloy and the Hidden Riders of Tomorrow when it comes to fusing soul with the glam rock sound, though less successfully - in particular, I kind of miss the bombastic over-the-top production job the previous album had. Light of Love is charming, and Think Zinc is an engaging enough stomper, but a lot of the songs on here (including the entire second side) are just kind of forgettable. It's not a bad album and T. Rex fans will find reasons to enjoy it, but at the same time I think it might be their least successful studio albums if you discount posthumous material. Now, if I could only get the refrain from Think Zinc out of my head...|Published|Page|1|2|3|4|>>|Votes are used to help determine the most interesting content on RYM.|Vote up content that is on-topic, within the rules/guidelines, and will likely stay relevant long-term.|Vote down content which breaks the rules.|Catalog|Ratings:|618|Cataloged:|453|Track rating sets:|Track ratings:|34|Rating distribution|Rating trend|Page|1|2|..|4|..|8|..|12|..|16|..|21|..|25|..|29|..|33|..|37|..|42|>>|28 Jun 2023|juantovar|Vinyl|26 Jun 2023|Redknot52|29 May 2023|BreakOut|Really good|29 May 2023|IdkSomethingformymami|26 May 2023|salone|Pleasurable Feelings|25 May 2023|Lejink|17 May 2023|Pokermask|16 May 2023|Piggy_Better|11 May 2023|themoviejudge|3 May 2023|MordoGoodIGuess|Barnes & Noble Record Aisle|2 May 2023|BlackMidiIsMid|Thom Yorke (Matt Bellamy)|2 May 2023|feloniousPUNK|26 Apr 2023|HermitCook|Bad|17 Apr 2023|leonardohiei|13 Apr 2023|Jamie_Spraggon|CD|Below Average|.|.|.|.|Previous|Next|Light of Love|Futuristic Dragon|ADVERTISEMENT|Track listing|A1|Light of Love|3:15|A2|Solid Baby|2:36|A3|Precious Star|2:51|A4|Token of My Love|3:39|A5|Space Boss|2:47|A6|Think Zinc|3:20|B1|Till Dawn|3:01|B2|Girl in the Thunderbolt Suit|2:19|B3|I Really Love You Babe|3:31|B4|Golden Belt|2:39|B5|Zip Gun Boogie|3:18|Total length: 33:16|Credits|Marc Bolan|writer|,|producer|,|vocals|,|guitar|Steve Currie|bass|Gloria Jones|vocals|,|Clavinet|David Lutton|drums|Dino Dines|keyboards|Mickey Finn|percussion|Keith Morris|photography|John Kosh|artwork|59 Lists|1975 Top LPS|popandcircumstance|THE BEST OF T.REX|mehhem|A Road to Hell... The Greatest Misses ( by Artists I usually like or even love ! )|rupertlenz|Best Bolan Boogie|popandcircumstance|70s|Gullian|\"All Schools are Strange\": Marc Bolan Roop's Top 150 Songs...|rupertlenz|MY TOP 85 ALBUMS for 1975... so far|artxploiters|A Listener's Diary 2017|yerblues|Cover Art by Kosh|misterteeth|Complete Collection|kenjah|Рок-1975|AlexVox|1975 - The Best of (According to Jake)|jakelicious|Music on Vinyl: LP's From 1960 to 1979|chuchi|My least favourite studio album by some of my favorite artists (often not easy to decide!)|Communique|1975|kenjah|Virtual Crate-Digging: Every Album in My Library|DonRaoul|See all 59 lists|Comments|Rules for comments|Be respectful!  All the community rules apply here.|Keep your comments focused on the release.  Don't post randomness/off-topic comments.   Jokes are fine, but don't post tactless/inappropriate ones.|Don't get in arguments with people here, or start long discussions.  Use the boards for extended discussion.|Don't use this space to complain about the average rating, chart position, genre voting,  others' reviews or ratings, or errors on the page.|Don't comment just to troll/provoke.  Likewise, don't respond to trollish comments; just report them and ignore them.|Any spoilers should be placed in spoiler tags as such:|[spoiler]|(spoiler goes here)|[/spoiler]|Note|: Unlike reviews, comments are considered temporary and may be deleted/purged without notice.|jjmia|23 Jan 2020 02:45 GMT|His most underrated album. Better and more focused than Zinc Alloy|report|reported|crackitydjango|24 Jun 07:33 GMT|*Listens to Gary Glitter and Sweet for a month* *Snorts a line of cocaine* *Adjusts jumpsuit and roller skates* *Fix up the old mascara* *Warm up the amps* *Invite your closest friends over to clap into a microphone* Alright gang, let's rock!|report|reported|Log in to add a comment|Discussion|RYM Artists/Bands Top 20 Thread #132: T. Rex (incl. Tyrannosaurus Rex)|Music Polls/Games|Each artist's best song from each of their albums|Music Polls/Games|Your favorite songs from albums you've rated 2.0 or worse|Music|Baker's Dozen-Albums|Music Polls/Games|The Album Title show|Music Polls/Games|Unpopular musical opinions.|Music|Subscribe to see similar release suggestions|ADVERTISEMENT|Contributions|Contributors to this release:|hotlove|,|PierT|,|jkra3168|,|fixbutte|,|unj|,|jg_|,|alcamus|,|Kronz|Log in|to submit a correction or upload art for this release|.|.|.|.|ADVERTISEMENT|Close|Close|Rate Your Music|© 2000-2023 Sonemic, Inc.|Site links|RYM Network|RYM|music|Sonemic|new music site (beta)|Cinemos|film (beta)|Glitchwave|video games (beta)|Info|FAQ|Development status|RYMzilla|Submissions|Policy|Database standards|Privacy|Consent|Terms of service|Contact us|Support / Feedback",
          "|Vinyl LP|T. Rex|/ 3C 064-95 172|Zinc Alloy and the Hidden Riders of Tomorrow or A Creamed Cage in August|33 rpm, Gatefold, Limited Edition|1974|Vinyl LP|EMI|/ BLNA 7751 DELUXE|Zinc Alloy and the Hidden Riders of Tomorrow|33 rpm, Gatefold|1974|Vinyl LP|Jugoton|/ LSEMI - 73003|Zinc Alloy and the Hidden Riders of Tomorrow|33 rpm, Gatefold|1983|Vinyl LP|MARCL 505|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus Tracks|1985|CD|Marc on Wax|/ MARC D 505|Zinc Alloy and the Hidden Riders of Tomorrow|1987|CD|Teldec|/ 8.26713 243 909-2|Zinc Alloy and the Hidden Riders of Tomorrow|33 rpm|1988|Vinyl LP|PDI|/ E-30.1556|Zinc Alloy and the Hidden Riders of Tomorrow|1989|CD|MARCD 505|Change (The Alternate Zinc Alloy)|Archival|1994|CD|Edsel|/ EDCD 440|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus Tracks, Remastered|1994|CD|Edsel|/ EDCD392|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus Tracks, Digipak, Remastered|2000|CD|Repertoire|/ REP 4905|Zinc Alloy and the Hidden Riders of Tomorrow|CD Sized Album Replica, Limited Edition|2001|CD|TECI-24057|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus CD, Bonus Tracks, Deluxe Edition, Digipak|2002|CD|Edsel|/ MEDCD 717|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus CD, Deluxe Edition, Remastered|2005|CD|Rhino|/ R2 73219|Zinc Alloy and the Hidden Riders of Tomorrow|SHM|2009|CD|TECI-26566|Zinc Alloy & The Hidden Riders of Tomorrow|2011|CD|Fat Possum|/ FP1242|Expand all 20 issues|Compact issues|Expand all 20 issues|Credits|Credits|Tony Visconti|producer|,|string arrangements|Marc Bolan|producer|,|performer|,|writer|,|composer|Mickey Finn|performer|Steve Currie|performer|Bill Legend|performer|Jack Green|performer|Lonnie Jordan|performer|Danny Thompson|performer|B. J. Cole|performer|Sister Pat Hall|backing vocals|The Gloria Jones|backing vocals|Big Richard|backing vocals|Maestro David Katz|strings|The Pop Arts Orchestra|strings|38 Reviews|Page|1|2|3|4|5|>>|Jewlia|Sep 04 2006|I love T.REX, but I can admit when Marc Bolan sucks.  I like this album because I'm a rabid fan, but I know it's pretty terrible...|OH MARC WHY DID YOU GET FAT AND LET COCAINE MAKE YOU SUCK!   I STILL LOVE YOU ANYWAY MY PORKY PIXIE!|Published|ADVERTISEMENT|Walter12|Feb 25 2022|▼|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|Marc Bolan's career is one of the saddest stories in 70's rock music.  Even before his untimely death in 1977, the reputation of his work with T. Rex was in precipitous decline.  It's no small tragedy to transform from being a true trendsetter into a frustrating mediocrity, and that's precisely what Bolan accomplished in a few short years after inventing the entire genre of glam rock.  1974's|Zinc Alloy|is typically cited as the point where Bolan completely lost his way.  Critically panned at the time of its release, and including unwanted forays into funk and soul, it's a record that succeeded in confusing all but the biggest of T. Rex fanboys.  Fortunately, the album has aged better than many may have excepted.  It's still a big step down from Bolan's last three LPs, but it features enough engaging tunes to placate listeners who aren't wedded to the \"pure\" glam rock sound of|Electric Warrior|and|The Slider|.  Underwhelming but listenable enough to warrant 3.0 stars.|By the release of|Tanx|, the formula that Bolan had been using since|Electric Warrior|was obviously running out of steam.  Yet instead of drifting toward art rock, as was the case with many of his glam rock competitors, Bolan decided to add a more diverse slate of pop influences atop familiarly-structured tunes.  Foremost among the stylistic additions to|Zinc Alloy|are piles of Motown-influenced vocals, courtesy of Bolan's real-life partner Gloria Jones.  There's also a funkier vibe to many of the grooves, as well as full-blown orchestra behind most of the guitar lines.  All of these ingredients are brought together via an overblown, Phil Spector-inspired production (produced by Bolan himself).  The only things that haven't significantly changed are the lead vocals and the self-consciously \"trashy\" guitar lines, even if those elements are given far less space to breath than on previous T. Rex releases.  Every track here is immediately identifiable as a T. Rex tune, but those dense backing arrangements also immediately every tune as a part of|Zinc Alloy|.|Zinc Alloy|is an unusual album for me to honestly assess.  I understand the hate that it received back in the day, and I'm forced to admit that most of the stylistic innovations don't really work, but there's a certain charm that brings me back to the record more often that my rating might suggest.  In particular, for an artist who spent most of the 70's repeating himself, it's great to see Bolan attempt something slightly different.  The only truly unforgivable sin of|Zinc Alloy|is its cluttered, wall-of-sound production.  Bolan clearly wasn't ready to self-produce: if Tony Visconti had been involved, I have little doubt that most of arrangements would've been thinned out.  Gloria Jones' backing vocals are also way too high in the mix.  She's a decent singer, and I'm not completely averse to the funk/soul overtones that distinguish mid-70's T. Rex, but on this record her contributions repeatedly overwhelm Bolan's (always endearing) vocal melodies.  Everything on|Zinc Alloy|is simply way too \"huge\" for its own good.|When considered on a track-by-track basis,|Zinc Alloy|is also a mixed bag.  With both|The Slider|and|Tanx|, Bolan made the annoying decision to leave much of his best material off the studio LPs (in favor of releasing non-album singles); on|Zinc Alloy|, he veers wildly in the opposite direction, packing in every half-worthy idea from the past six months.  A 46-minute runtime doesn't usually result in a record that overstays in its welcome, but it's definitely too long for a T. Rex album.  The end result is a release with as many highs as|Tanx|or|Dandy in the Underworld|(both 3.5 stars), but with considerably more filler than any Bolan release since|T. Rex|.  Luckily,|Zinc Alloy|is still easy to listen through in its entirety, mostly because its individual track lengths hover around the three-minute mark, but that isn't enough to overcome to presence of obvious filler.|All of this makes|Zinc Alloy|most appealing as a repository of individually-entertaining tracks.  Foremost among these highlights is \"Teenage Dream\"- a soaring ballad that is arguably the strongest T. Rex single to be released after 1973.  \"Venus Loon\" and \"Explosive Mouth\" should also please the vast majority of casual listeners, assuming they can stomach the overwrought production.  Beyond those three tracks, I have a personal fascination with the|Slider|-esque \"The Avengers (Superbad)\" and the closing \"The Leopards…\", although many hardcore fans may disagree with my enthusiasm here.  The remainder of|Zinc Alloy|is mostly just unexciting, devoid of memorable melodies yet also lacking a clear clunker (although \"Nameless Wildness\" does test my patience with those shrill backing vocals…).  It's just enough to squeak by with a middling, 3.0-star rating, but not enough to warrant an honest recommendation for the album as a whole.|5.8/10|Published|ADVERTISEMENT|yugiaru|Dec 17 2021|▼|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|People back then were really deaf most of the time jesus. You'd think this would be a complete departure from the glam rock style that T. Rex was known for but it's not even that big of a significant change in their sound. There are soul elements in certain songs here and there, but overall, this is 100% pure exaggerated and over the top glam rock as you'd expect from Marc Bolan and his band. Some of the most bizarre songs he ever wrote and made with the band are all on Zinc Alloy, it's such a grandiose album in every sense. Not their best, but I'd count it as part of a great run of albums that began with Electric Warrior.|Published|TheVinylGuy|Sep 02 2021|an elegy to the heroin fuelled hedonism that ran rampant throughout the glam rock era of the early 70s. a ghostly, ghastly, gross experience; a truly cursed album and a terribly bad vibe overall. i love it.|Published|Castrovalva|Jan 24 2021|On this album, T.Rex faceplants into a mess of drugs, alcohol, self-doubt, ego, narcissism, and failed ambition. By 1974, glam rock was treading water, the rise of upstarts like KISS had started to take over, and Bolan completely lost direction with this strange experiment in 'interstellar soul'. Along with Bowie, this one attempts to fuse the British glam stomp with American soul music - only, while 'Young Americans' was a brilliant and inventive pastiche that knew when to stop, this one is a strangely ineffective, rambling mess that never quite decides what it wants to be. The title SOUNDS like it should be some kind of concept album, right? Is Zinc Alloy a person? A place? Who are the hidden riders? None of these questions are answered at any point in the album's tidal wave of verbiage. The first half is a set of more classic T.Rex-sounding songs, culminating in the self-mythologizing of 'Teenage Dream', but the second album descends into rambling, aimless madness. Song titles like 'Painless Persuasion V. The Meathawk Immaculate' and 'The Leopards Featuring Gardenia & The Mighty Slug', which fumble towards profundity, but are little more than Bolan's drunken, drug addled ramblings. He was a few years late for this kind of pseudo-conceptual nonsense in '74. Bolan's ego is so far out of control at this point that the band is now billed as 'Marc Bolan & T.Rex', and the cover art is a weirdly unflattering close up of his pouting face.|And, the production is awful. The playing is fine, but Marc's new girlfriend Gloria Jones is mixed so high that she overpowers every track that she's on. The album is just so overcooked and dense with aimless noodling, misplaced gospel vocals, and Bolan's increasingly incoherent fever dream ramblings that it drags to a completely unsatisfying close. There's a version of it that Edsel put out in the 90's called 'Changes' that strips all of the original production out of it and it is a MUCH better album in pretty much every way.|That said, I love Marc Bolan, so I love this stupid, awful album. It reminds me a lot of 'Be Here Now' by Oasis - it is a product of a band that is now so bloated, drug fucked, drunk, and arrogant, that when it is let loose in the studio with nobody who can say no anymore, the result is stupid, pointless excess in every direction. This is perfect fodder for an episode of 'Trainrecords' or something.|Published|Balance005|Jan 07 2019|Bolan : 9/12|There was a need for change at that point. Even if this cheezy overloaded thing only partially succeeds, it has groove and some kind of dramatic beauty. I had a really hard time getting into it so i can't blame people judging it baldy, especially after just a few listens. I'd admit that the whole thing is dense, long (and it seems longer than it is) and overproduced but there's some magic into it i'd say. While Zinc Alloy may not be one of the strongest T. Rex albums, i'm still deeply attached to it because it's such a unique album withs several great songs which are still quite overlooked in the T. Rex catalogue : Venus Loon, Change, Teenage Dream,  Interstellar Soul...|The 2014 Tony Visconti remaster is the one to get, it sounds terrific (the previous CD releases didn't help restoring the album's reputation).|Published|GARFIELDACRES|Mar 23 2017|Beginning of the end for bolan really,there are some good songs (mostly on side1) and he quite successfully adds a bit of funk to his sound in places. But a lot of the material is definitely patchy and his girlfriend gloria jones vocals don't always work with the songs and she is all over everything.|'teenage dream' is the best thing here by a mile,a reminder of how great bolan's songs and tony visconti's production could be together. Drugs were becoming more of an issue at this point though and their relationship was sorely tested on this album.|Published|MrBlues|Dec 12 2014|This is a disappointing album compared to the earlier glory of Bolan and co. There are a few really good songs, but the rest is just mediocre, non-memorable material. The unique T. Rex sound is here though, it's like a futuristic glam-rock gospel.|The best tracks are \"Venus Loon\", \"Explosive Mouth\", \"Change\" and \"Teenage Dream\". If they dropped off the filler and released just the better songs, it would have made a wonderful EP.|EDIT|: Listening to this again after a few years I find it more pleasing. The last two tracks are pretty good and the band is more funky than ever. I'm also getting more into the backing vocals. Bumped it up from 3 to 3.5 stars.|Published|Page|1|2|3|4|5|>>|Votes are used to help determine the most interesting content on RYM.|Vote up content that is on-topic, within the rules/guidelines, and will likely stay relevant long-term.|Vote down content which breaks the rules.|Catalog|Ratings:|678|Cataloged:|456|Track rating sets:|Track ratings:|55|Rating distribution|Rating trend|Page|1|2|..|4|..|9|..|13|..|18|..|23|..|27|..|32|..|36|..|41|..|46|>>|6 Jul 2023|BlackstarDyl|Try Again, Pal|6 Jul 2023|pass_it_around|28 Jun 2023|juantovar|Vinyl|26 Jun 2023|Redknot52|2 Jun 2023|hwaapczepap|Vinyl|31 May 2023|rupert_X|A shade below Wilco|30 May 2023|nouay|29 May 2023|BreakOut|Great|29 May 2023|IdkSomethingformymami|24 May 2023|slievemore|5 - neutral|23 May 2023|salone|A Certain Fondness|16 May 2023|Pokermask|15 May 2023|MianSwagger|▼|eat a fries|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|14 May 2023|Pulch|Great, solid; definitely listen to it|11 May 2023|themoviejudge|.|.|.|.|.|.|Previous|Next|Tanx|Light of Love|ADVERTISEMENT|Track listing|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|Credits|Tony Visconti|producer|,|string arrangements|Marc Bolan|producer|,|performer|,|writer|,|composer|Mickey Finn|performer|Steve Currie|performer|Bill Legend|performer|Jack Green|performer|Lonnie Jordan|performer|Danny Thompson|performer|B. J. Cole|performer|Sister Pat Hall|backing vocals|The Gloria Jones|backing vocals|Big Richard|backing vocals|Maestro David Katz|strings|The Pop Arts Orchestra|strings|72 Lists|Albums from England - T|Zaragon|1974 Albums Ranked|mgars4|Favorite T. Rex Albums|stanley_the_bugman|Cover Art by Kosh|misterteeth|Tonight’s The Night|BlackstarDyl|Kids... Against the 70s!|massimo73|Series 29 - Generations|minnesotamurray|Albums from 1974 (in no particular order)|ThePunkPanther5|I got 'em on vinyl|DohertyClash|Best Of Crossroads - 1973-1975 - 105 Albums Essentiels|ben007|Love your tan! Albums of 1974 ranked.|Herbie|Lately|Thatstheirbestalbum|BEST 1974'S ALBUM|tblackie|Virtual Crate-Digging: Every Album in My Library|DonRaoul|The Best of T. Rex!|Malchemist|THE BEST OF T.REX|mehhem|See all 72 lists|Comments|Rules for comments|Be respectful!  All the community rules apply here.|Keep your comments focused on the release.  Don't post randomness/off-topic comments.   Jokes are fine, but don't post tactless/inappropriate ones.|Don't get in arguments with people here, or start long discussions.  Use the boards for extended discussion.|Don't use this space to complain about the average rating, chart position, genre voting,  others' reviews or ratings, or errors on the page.|Don't comment just to troll/provoke.  Likewise, don't respond to trollish comments; just report them and ignore them.|Any spoilers should be placed in spoiler tags as such:|[spoiler]|(spoiler goes here)|[/spoiler]|Note|: Unlike reviews, comments are considered temporary and may be deleted/purged without notice.|jjmia|23 Jan 2020 02:45 GMT|Not bad but probably my least favourite from them. It’s too long as well|report|reported|strangefires|12 May 2021 05:55 GMT|I'll have some of what Marc was smoking when he made this|report|reported|abyss_lord|29 Sep 2021 17:52 GMT|Why do I kinda like this lol|Sounds like unintentional zolo|report|reported|ClimateOfHunter|22 Jan 2022 00:38 GMT|It’s wild how much better Teenage Dream is than every other song here. It’s like he used up all his good ideas on that song alone and then went “shit, I still have to write the rest of the album”|report|reported|rogueofmv|28 Jan 01:08 GMT|cedric bixler-zavala|report|reported|mc1382|09 May 09:27 GMT|This is like if one of the members of Dr. Frank-N-Furter's castle made an album|report|reported|krautrockism|20 May 03:30 GMT|mfs with blue eyes|report|reported|Log in to add a comment|Discussion|RYM Artists/Bands Top 20 Thread #132: T. Rex (incl. Tyrannosaurus Rex)|Music Polls/Games|Experimental Left Turns Post-Magnum Opus|Music|What is your favorite underrated album?|Music|comment on the last five rated albums by the user above you|Music Polls/Games|Each artist's best song from each of their albums|Music Polls/Games|Baker's Dozen-Albums|Music Polls/Games|Your favorite artists most underrated albums|Music|Type in random album codes to see what comes up|Music Polls/Games|Unpopular musical opinions.|Music|¿Que estas escuchando ahora mismo?|RYM en español|One Artist Releases with Various Artists on it|Rate Your Music|The RYM Artists Top 10|Music Polls/Games|Subscribe to see similar release suggestions|ADVERTISEMENT|Contributions|Contributors to this release:|hotlove|,|Communique|,|germannnn|,|jkra3168|,|yolz|,|ipoduser|,|unj|,|hugdeserver|,|Drifterdk|,|Lovinda|,|[deleted]|,|alcamus|,|Kronz|Log in|to submit a correction or upload art for this release|.|.|.|.|.|.|ADVERTISEMENT|Close|Close|Rate Your Music|© 2000-2023 Sonemic, Inc.|Site links|RYM Network|RYM|music|Sonemic|new music site (beta)|Cinemos|film (beta)|Glitchwave|video games (beta)|Info|FAQ|Development status|RYMzilla|Submissions|Policy|Database standards|Privacy|Consent|Terms of service|Contact us|Support / Feedback",
          "Marc Bolan Albums: songs, discography, biography, and listening guide - Rate Your Music|sign in|RYM|new music|genres|charts|lists|community|Close|Search:|Music|Film|Games|for:|New Music|Genres|Charts|Lists|Community|Marc Bolan|The Beginning of Doves|Born|30 September 1947,|Hackney, Greater London, United Kingdom|Died|16 September 1977,|Barnes, Greater London, United Kingdom|Member of|Big Carrot|,|Dib Cochran and the Earwigs|,|John's Children|,|T. Rex|Notes|Father of|Rolan Bolan|; founder of|T. Rex|Also Known As|Mark Feld, Toby Tyler|Genres|Glam Rock|,|Contemporary Folk|,|Singer-Songwriter|,|Folk Rock|,|Acoustic Rock|,|Television Music|Share|Follow|651 followers|ADVERTISEMENT|Discography|143|Credits|188|Filmography|5|Album|Showing all (17)|Issues|Average|Avg.|Ratings|Reviews|Ratings/Rev.|Title|/|Release Date|+8|3.23|123|3|123|3|The Beginning of Doves|1974|+10|3.11|60|6|60|6|You Scare Me to Death|1981|+3|3.06|48|3|48|3|Billy Super Duper|1982|•|Marc Bolan & T. Rex|T. Rex|Marc Bolan|3.09|17|1|17|1|Dance in the Midnight|1983|+2|3.08|18|1|18|1|Love and Death|1986|+1|3.22|39|3|39|3|Acoustic Warrior|[archival]|1996|+3|3.50|31|4|31|4|Marc: Songs From the Granada TV Series|[tv soundtrack]|1998|•|Marc Bolan and T. Rex|Marc Bolan|T. Rex|3.84|3|3|-|Twopenny Prince|[archival]|2010|3.98|7|7|-|Beyond the Risin' Sun|2010|2.77|2|2|-|Baby Strange: A Rarities Collection|[archival]|2017|3.50|1|1|-|Misfortune Gatehouse|[archival]|2018|4.00|1|1|-|Tramp King of the City|[archival]|2018|4.00|1|1|-|There Was a Time|[archival]|2018|4.00|1|1|-|Slight Thigh Be-Bop|[archival]|2018|4.53|2|2|-|Home Demos|[archival]|2019|+1|4.02|4|4|-|Pictures of Purple People|[archival]|2019|4.17|3|3|-|Electronic Musik|[archival]|2019|ADVERTISEMENT|Live Album|Showing all (3)|Issues|Average|Avg.|Ratings|Reviews|Ratings/Rev.|Title|/|Release Date|+3|3.54|42|5|42|5|Live 1977|1997|•|Marc Bolan & T. Rex|Marc Bolan|T. Rex|4.00|1|1|-|Marc Bolan & T. Rex (The Acoustic and Live Collection)|[archival]|2009|5.00|1|1|-|Electric Seven 2 at the BBC",
          "|Mark Feld",
          "|I'm well aware that at the time Marc was beginning to incorporate soul (and funk) into his sound (with the aid of his partner Gloria Jones and co.)yet this version of soul tends to sound at times more like a overblown caricature of the sound he was making with Mark Volman and Howard Kaylan. Unfortunately here there was no room for the complementary vocals Mark and Howard excelled at -  more a grossly excessive 'noise' which seemed to all intent and purposes to drown out much of Marc's singing. Beneath all flamboyance and overproduction there are, however, some rather inspired moments. Marc is experimenting  on a number of these tracks rather effectively and some of his guitar work (in particular on 'Carsmile Smith') sounds genuinely soulful.|Zinc Alloy|does have much more to offer than the more simplistic and less consistent|Tanx|certainly, and it's also probably true to say it's Marc's first significant change of direction since|Electric Warrior|.In addition it contains one of Marc's very best singles - the autobiographical 'Teenage Dream'.|It's flawed for sure but Marc's not playing so safe here as on his previous couple of albums and it makes this album perhaps a little more revealing as a result.|Published|ADVERTISEMENT|jbjamieblack|Mar 16 2006|'Zinc Alloy and the Hidden Riders of Tomorrow'|was released in 1974 (which may I say is a splendid title.) As an album people have said that it was a comercial failure. Marc was trying to get rid of the glam rock sound and adding soul and making the T.Rex sound heavier. Adding more strength in backing vocals, heavy guitars, a louder more hard hitting sound.|In my opinion I think this album is under-rated. It deserves more recognition that what It's earned I think. Also the album was a real grower on me. The more I listened to it the more I liked it.|The album starts off with the song 'Venus loon'. 'Venus loon' is a very cathchy song. Same with 'Sound Pit', 'Explosive Mouth', and 'Galaxy'. Also when I listen to all these songs there is something quite magical about it that I just can't put my finger on. 'Change' is a down tempo song which is has a nice sadness about it. Nameless Wildness is a fun song. 'Teenage Dream' the only single from the album. 'Teenage Dream' is a masterpiece! The song is soposed to be about Marc's star on a wane. 'Liquid Gang' another catchy fun song. 'Carsmile Smith and the Old One' is another sad song. Then a beautiful medley arrives - 'You've got to jive to stay alive / Spanish Midnight'. 'Interstellar Soul' - Another fun song. 'Painless Persuasion v. The Meathawauk Immaculate' is another great song. And the last 2 songs are 'The Avengers (Superbad') which is a fun song and 'The Leopards Featuring Gardenia And The Mighty Slug' which is quite weird, Marc does a song where he talks through it which is quite cool.|And the bonus tracks they have added to this collection makes it even more spectacular!|My favourite song on this album is Teenage Dream.|Overall I think this album is an underated classic. I think it should be judged after a few listens. It's not my fave T.Rex album but|I Love It!|Published|slider72|Apr 17 2005|Zinc Alloy, Marc tried to do the name change thing with this one and the record company insisted on Marc Bolan and T.Rex appearing on the sleeve. It was panned when released but through the age of time, songs like \"Change\" Carsmile Smith, The Avengers (Superbad Tiger), Venus Loon, Explosive Mouth, and Teenage Dream, all have improved when listening again and again and again, must be the red wine.|I think the Alternative Issue has more to offer that the Vinyl.|Buy it, play it, put it away, and then in 5 years time you will realise it was a classic T.Rex album or in my case 30+ years|Published|weejum|Apr 16 2005|This is probably Bolan's most bizarre album but I don't think I can rate it as high as his other albums.|Published|<<|Page|1|2|3|4|5|6|>>|Votes are used to help determine the most interesting content on RYM.|Vote up content that is on-topic, within the rules/guidelines, and will likely stay relevant long-term.|Vote down content which breaks the rules.|.|.|.|.|.|.|Track listing|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|Credits|Tony Visconti|producer|,|string arrangements|Marc Bolan|producer|,|performer|,|writer|,|composer|Mickey Finn|performer|Steve Currie|performer|Bill Legend|performer|Jack Green|performer|Lonnie Jordan|performer|Danny Thompson|performer|B. J. Cole|performer|Sister Pat Hall|backing vocals|The Gloria Jones|backing vocals|Big Richard|backing vocals|Maestro David Katz|strings|The Pop Arts Orchestra|strings|.|.|.|.|.|.|ADVERTISEMENT|Close|Close|Rate Your Music|© 2000-2023 Sonemic, Inc.|Site links|RYM Network|RYM|music|Sonemic|new music site (beta)|Cinemos|film (beta)|Glitchwave|video games (beta)|Info|FAQ|Development status|RYMzilla|Submissions|Policy|Database standards|Privacy|Consent|Terms of service|Contact us|Support / Feedback",
          "|a lot of people don't like this lp very much but i think it is one of t rex's best and most interesting offerings.",
          "Review for Zinc Alloy and the Hidden Riders of Tomorrow - Marc Bolan & T. Rex by GARFIELDACRES - Rate Your Music|sign in|RYM|new music|genres|charts|lists|community|Close|Search:|Music|Film|Games|for:|New Music|Genres|Charts|Lists|Community|Welcome to|Rate Your Music|RYM is one of the largest music databases and communities online, which you can use in endless ways to discover new music.|Learn about some of the ways you can use RYM for music discovery.|Zinc Alloy and the Hidden Riders of Tomorrow|(1974)|Marc Bolan & T. Rex|3.19|from 757 ratings|Genres|Glam Rock|Blue-Eyed Soul|Descriptors|melodic, quirky, rhythmic, female vocals, surreal, anxious, uplifting, playful, bittersweet, passionate, lush, male vocals, sensual, energetic|Zinc Alloy and the Hidden Riders of Tomorrow|(1974)|Marc Bolan & T. Rex|Review by|GARFIELDACRES|Beginning of the end for bolan really,there are some good songs (mostly on side1) and he quite successfully adds a bit of funk to his sound in places. But a lot of the material is definitely patchy and his girlfriend gloria jones vocals don't always work with the songs and she is all over everything.|'teenage dream' is the best thing here by a mile,a reminder of how great bolan's songs and tony visconti's production could be together. Drugs were becoming more of an issue at this point though and their relationship was sorely tested on this album.|Expand review|Hide|Close|Close|Rate Your Music|© 2000-2023 Sonemic, Inc.|Site links|RYM Network|RYM|music|Sonemic|new music site (beta)|Cinemos|film (beta)|Glitchwave|video games (beta)|Info|FAQ|Development status|RYMzilla|Submissions|Policy|Database standards|Privacy|Consent|Terms of service|Contact us|Support / Feedback",
          "|Zinc Alloy and the Hidden Riders of Tomorrow or A Creamed Cage in August|33 rpm, Gatefold, Limited Edition|1974|Vinyl LP|EMI|/ BLNA 7751 DELUXE|Zinc Alloy and the Hidden Riders of Tomorrow|33 rpm, Gatefold|1974|Vinyl LP|Jugoton|/ LSEMI - 73003|Zinc Alloy and the Hidden Riders of Tomorrow|33 rpm, Gatefold|1983|Vinyl LP|MARCL 505|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus Tracks|1985|CD|Marc on Wax|/ MARC D 505|Zinc Alloy and the Hidden Riders of Tomorrow|1987|CD|Teldec|/ 8.26713 243 909-2|Zinc Alloy and the Hidden Riders of Tomorrow|33 rpm|1988|Vinyl LP|PDI|/ E-30.1556|Zinc Alloy and the Hidden Riders of Tomorrow|1989|CD|MARCD 505|Change (The Alternate Zinc Alloy)|Archival|1994|CD|Edsel|/ EDCD 440|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus Tracks, Remastered|1994|CD|Edsel|/ EDCD392|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus Tracks, Digipak, Remastered|2000|CD|Repertoire|/ REP 4905|Zinc Alloy and the Hidden Riders of Tomorrow|CD Sized Album Replica, Limited Edition|2001|CD|TECI-24057|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus CD, Bonus Tracks, Deluxe Edition, Digipak|2002|CD|Edsel|/ MEDCD 717|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus CD, Deluxe Edition, Remastered|2005|CD|Rhino|/ R2 73219|Zinc Alloy and the Hidden Riders of Tomorrow|SHM|2009|CD|TECI-26566|Zinc Alloy & The Hidden Riders of Tomorrow|2011|CD|Fat Possum|/ FP1242|Expand all 20 issues|Compact issues|Expand all 20 issues|Credits|Credits|Tony Visconti|producer|,|string arrangements|Marc Bolan|producer|,|performer|,|writer|,|composer|Mickey Finn|performer|Steve Currie|performer|Bill Legend|performer|Jack Green|performer|Lonnie Jordan|performer|Danny Thompson|performer|B. J. Cole|performer|Sister Pat Hall|backing vocals|The Gloria Jones|backing vocals|Big Richard|backing vocals|Maestro David Katz|strings|The Pop Arts Orchestra|strings|45 Reviews|Page|1|2|3|4|5|6|>>|Jewlia|Sep 04 2006|I love T.REX, but I can admit when Marc Bolan sucks.  I like this album because I'm a rabid fan, but I know it's pretty terrible...|OH MARC WHY DID YOU GET FAT AND LET COCAINE MAKE YOU SUCK!   I STILL LOVE YOU ANYWAY MY PORKY PIXIE!|Published|ADVERTISEMENT|Walter12|Feb 25 2022|▼|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|Marc Bolan's career is one of the saddest stories in 70's rock music.  Even before his untimely death in 1977, the reputation of his work with T. Rex was in precipitous decline.  It's no small tragedy to transform from being a true trendsetter into a frustrating mediocrity, and that's precisely what Bolan accomplished in a few short years after inventing the entire genre of glam rock.  1974's|Zinc Alloy|is typically cited as the point where Bolan completely lost his way.  Critically panned at the time of its release, and including unwanted forays into funk and soul, it's a record that succeeded in confusing all but the biggest of T. Rex fanboys.  Fortunately, the album has aged better than many may have excepted.  It's still a big step down from Bolan's last three LPs, but it features enough engaging tunes to placate listeners who aren't wedded to the \"pure\" glam rock sound of|Electric Warrior|and|The Slider|.  Underwhelming but listenable enough to warrant 3.0 stars.|By the release of|Tanx|, the formula that Bolan had been using since|Electric Warrior|was obviously running out of steam.  Yet instead of drifting toward art rock, as was the case with many of his glam rock competitors, Bolan decided to add a more diverse slate of pop influences atop familiarly-structured tunes.  Foremost among the stylistic additions to|Zinc Alloy|are piles of Motown-influenced vocals, courtesy of Bolan's real-life partner Gloria Jones.  There's also a funkier vibe to many of the grooves, as well as full-blown orchestra behind most of the guitar lines.  All of these ingredients are brought together via an overblown, Phil Spector-inspired production (produced by Bolan himself).  The only things that haven't significantly changed are the lead vocals and the self-consciously \"trashy\" guitar lines, even if those elements are given far less space to breath than on previous T. Rex releases.  Every track here is immediately identifiable as a T. Rex tune, but those dense backing arrangements also immediately every tune as a part of|Zinc Alloy|.|Zinc Alloy|is an unusual album for me to honestly assess.  I understand the hate that it received back in the day, and I'm forced to admit that most of the stylistic innovations don't really work, but there's a certain charm that brings me back to the record more often that my rating might suggest.  In particular, for an artist who spent most of the 70's repeating himself, it's great to see Bolan attempt something slightly different.  The only truly unforgivable sin of|Zinc Alloy|is its cluttered, wall-of-sound production.  Bolan clearly wasn't ready to self-produce: if Tony Visconti had been involved, I have little doubt that most of arrangements would've been thinned out.  Gloria Jones' backing vocals are also way too high in the mix.  She's a decent singer, and I'm not completely averse to the funk/soul overtones that distinguish mid-70's T. Rex, but on this record her contributions repeatedly overwhelm Bolan's (always endearing) vocal melodies.  Everything on|Zinc Alloy|is simply way too \"huge\" for its own good.|When considered on a track-by-track basis,|Zinc Alloy|is also a mixed bag.  With both|The Slider|and|Tanx|, Bolan made the annoying decision to leave much of his best material off the studio LPs (in favor of releasing non-album singles); on|Zinc Alloy|, he veers wildly in the opposite direction, packing in every half-worthy idea from the past six months.  A 46-minute runtime doesn't usually result in a record that overstays in its welcome, but it's definitely too long for a T. Rex album.  The end result is a release with as many highs as|Tanx|or|Dandy in the Underworld|(both 3.5 stars), but with considerably more filler than any Bolan release since|T. Rex|.  Luckily,|Zinc Alloy|is still easy to listen through in its entirety, mostly because its individual track lengths hover around the three-minute mark, but that isn't enough to overcome to presence of obvious filler.|All of this makes|Zinc Alloy|most appealing as a repository of individually-entertaining tracks.  Foremost among these highlights is \"Teenage Dream\"- a soaring ballad that is arguably the strongest T. Rex single to be released after 1973.  \"Venus Loon\" and \"Explosive Mouth\" should also please the vast majority of casual listeners, assuming they can stomach the overwrought production.  Beyond those three tracks, I have a personal fascination with the|Slider|-esque \"The Avengers (Superbad)\" and the closing \"The Leopards…\", although many hardcore fans may disagree with my enthusiasm here.  The remainder of|Zinc Alloy|is mostly just unexciting, devoid of memorable melodies yet also lacking a clear clunker (although \"Nameless Wildness\" does test my patience with those shrill backing vocals…).  It's just enough to squeak by with a middling, 3.0-star rating, but not enough to warrant an honest recommendation for the album as a whole.|5.8/10|Published|ADVERTISEMENT|yugiaru|Dec 17 2021|▼|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|People back then were really deaf most of the time jesus. You'd think this would be a complete departure from the glam rock style that T. Rex was known for but it's not even that big of a significant change in their sound. There are soul elements in certain songs here and there, but overall, this is 100% pure exaggerated and over the top glam rock as you'd expect from Marc Bolan and his band. Some of the most bizarre songs he ever wrote and made with the band are all on Zinc Alloy, it's such a grandiose album in every sense. Not their best, but I'd count it as part of a great run of albums that began with Electric Warrior.|Published|TheVinylGuy|Sep 02 2021|an elegy to the heroin fuelled hedonism that ran rampant throughout the glam rock era of the early 70s. a ghostly, ghastly, gross experience; a truly cursed album and a terribly bad vibe overall. i love it.|Published|Castrovalva|Jan 24 2021|On this album, T.Rex faceplants into a mess of drugs, alcohol, self-doubt, ego, narcissism, and failed ambition. By 1974, glam rock was treading water, the rise of upstarts like KISS had started to take over, and Bolan completely lost direction with this strange experiment in 'interstellar soul'. Along with Bowie, this one attempts to fuse the British glam stomp with American soul music - only, while 'Young Americans' was a brilliant and inventive pastiche that knew when to stop, this one is a strangely ineffective, rambling mess that never quite decides what it wants to be. The title SOUNDS like it should be some kind of concept album, right? Is Zinc Alloy a person? A place? Who are the hidden riders? None of these questions are answered at any point in the album's tidal wave of verbiage. The first half is a set of more classic T.Rex-sounding songs, culminating in the self-mythologizing of 'Teenage Dream', but the second album descends into rambling, aimless madness. Song titles like 'Painless Persuasion V. The Meathawk Immaculate' and 'The Leopards Featuring Gardenia & The Mighty Slug', which fumble towards profundity, but are little more than Bolan's drunken, drug addled ramblings. He was a few years late for this kind of pseudo-conceptual nonsense in '74. Bolan's ego is so far out of control at this point that the band is now billed as 'Marc Bolan & T.Rex', and the cover art is a weirdly unflattering close up of his pouting face.|And, the production is awful. The playing is fine, but Marc's new girlfriend Gloria Jones is mixed so high that she overpowers every track that she's on. The album is just so overcooked and dense with aimless noodling, misplaced gospel vocals, and Bolan's increasingly incoherent fever dream ramblings that it drags to a completely unsatisfying close. There's a version of it that Edsel put out in the 90's called 'Changes' that strips all of the original production out of it and it is a MUCH better album in pretty much every way.|That said, I love Marc Bolan, so I love this stupid, awful album. It reminds me a lot of 'Be Here Now' by Oasis - it is a product of a band that is now so bloated, drug fucked, drunk, and arrogant, that when it is let loose in the studio with nobody who can say no anymore, the result is stupid, pointless excess in every direction. This is perfect fodder for an episode of 'Trainrecords' or something.|Published|Balance005|Jan 07 2019|Bolan : 9/12|There was a need for change at that point. Even if this cheezy overloaded thing only partially succeeds, it has groove and some kind of dramatic beauty. I had a really hard time getting into it so i can't blame people judging it baldy, especially after just a few listens. I'd admit that the whole thing is dense, long (and it seems longer than it is) and overproduced but there's some magic into it i'd say. While Zinc Alloy may not be one of the strongest T. Rex albums, i'm still deeply attached to it because it's such a unique album withs several great songs which are still quite overlooked in the T. Rex catalogue : Venus Loon, Change, Teenage Dream,  Interstellar Soul...|The 2014 Tony Visconti remaster is the one to get, it sounds terrific (the previous CD releases didn't help restoring the album's reputation).|Published|GARFIELDACRES|Mar 23 2017|Beginning of the end for bolan really,there are some good songs (mostly on side1) and he quite successfully adds a bit of funk to his sound in places. But a lot of the material is definitely patchy and his girlfriend gloria jones vocals don't always work with the songs and she is all over everything.|'teenage dream' is the best thing here by a mile,a reminder of how great bolan's songs and tony visconti's production could be together. Drugs were becoming more of an issue at this point though and their relationship was sorely tested on this album.|Published|MrBlues|Dec 12 2014|This is a disappointing album compared to the earlier glory of Bolan and co. There are a few really good songs, but the rest is just mediocre, non-memorable material. The unique T. Rex sound is here though, it's like a futuristic glam-rock gospel.|The best tracks are \"Venus Loon\", \"Explosive Mouth\", \"Change\" and \"Teenage Dream\". If they dropped off the filler and released just the better songs, it would have made a wonderful EP.|EDIT|: Listening to this again after a few years I find it more pleasing. The last two tracks are pretty good and the band is more funky than ever. I'm also getting more into the backing vocals. Bumped it up from 3 to 3.5 stars.|Published|Page|1|2|3|4|5|6|>>|Votes are used to help determine the most interesting content on RYM.|Vote up content that is on-topic, within the rules/guidelines, and will likely stay relevant long-term.|Vote down content which breaks the rules.|Catalog|Ratings:|757|Cataloged:|569|Track rating sets:|Track ratings:|57|Rating distribution|Rating trend|Page|1|2|..|5|..|10|..|15|..|20|..|25|..|30|..|35|..|40|..|45|..|51|>>|6 Jul 2023|BlackstarDyl|Try Again, Pal|6 Jul 2023|pass_it_around|28 Jun 2023|juantovar|Vinyl|26 Jun 2023|Redknot52|2 Jun 2023|hwaapczepap|Vinyl|31 May 2023|rupert_X|A shade below Wilco|30 May 2023|nouay|29 May 2023|BreakOut|Great|29 May 2023|IdkSomethingformymami|24 May 2023|slievemore|5 - neutral|23 May 2023|salone|A Certain Fondness|16 May 2023|Pokermask|15 May 2023|MianSwagger|▼|eat a fries|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|14 May 2023|Pulch|Great, solid; definitely listen to it|11 May 2023|themoviejudge|.|.|.|.|.|.|Previous|Next|Tanx|Light of Love|ADVERTISEMENT|Track listing|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|Credits|Tony Visconti|producer|,|string arrangements|Marc Bolan|producer|,|performer|,|writer|,|composer|Mickey Finn|performer|Steve Currie|performer|Bill Legend|performer|Jack Green|performer|Lonnie Jordan|performer|Danny Thompson|performer|B. J. Cole|performer|Sister Pat Hall|backing vocals|The Gloria Jones|backing vocals|Big Richard|backing vocals|Maestro David Katz|strings|The Pop Arts Orchestra|strings|84 Lists|Ranking Music 1974|dementri06|1974:Top 70 Rock Album|vanKuver|My Miniature LPs..|muzex|Series 29 - Generations|minnesotamurray|Worst album names|mibesu|Alphabetic albums, 20 per letter?|ronb626|1974|juicefacekilla|MY OWN VINYL COLLECTION (MY T. REX, MARC BOLAN´S ALBUMS)|mikelarambur|Wam Bam Thank You Glam !|popandcircumstance|Best Of Crossroads - 1973-1975 - 105 Albums Essentiels|ben007|My Top 100 Albums of All Time|List3n|My 1974 Albums, Muhammad Ali vs George Foreman|theflynet|My Album Collection [LP]|DaOneAndOnly1234|I got 'em on vinyl|DohertyClash|Purchases 2009|DrCrower|2018 - 580 Albums I listened to|djiaind|See all 84 lists|Comments|Rules for comments|Be respectful!  All the community rules apply here.|Keep your comments focused on the release.  Don't post randomness/off-topic comments.   Jokes are fine, but don't post tactless/inappropriate ones.|Don't get in arguments with people here, or start long discussions.  Use the boards for extended discussion.|Don't use this space to complain about the average rating, chart position, genre voting,  others' reviews or ratings, or errors on the page.|Don't comment just to troll/provoke.  Likewise, don't respond to trollish comments; just report them and ignore them.|Any spoilers should be placed in spoiler tags as such:|[spoiler]|(spoiler goes here)|[/spoiler]|Note|: Unlike reviews, comments are considered temporary and may be deleted/purged without notice.|jjmia|23 Jan 2020 02:45 GMT|Not bad but probably my least favourite from them. It’s too long as well|report|reported|strangefires|12 May 2021 05:55 GMT|I'll have some of what Marc was smoking when he made this|report|reported|abyss_lord|29 Sep 2021 17:52 GMT|Why do I kinda like this lol|Sounds like unintentional zolo|report|reported|ClimateOfHunter|22 Jan 2022 00:38 GMT|It’s wild how much better Teenage Dream is than every other song here. It’s like he used up all his good ideas on that song alone and then went “shit, I still have to write the rest of the album”|report|reported|rogueofmv|28 Jan 01:08 GMT|cedric bixler-zavala|report|reported|mc1382|09 May 09:27 GMT|This is like if one of the members of Dr. Frank-N-Furter's castle made an album|report|reported|krautrockism|20 May 03:30 GMT|mfs with blue eyes|report|reported|Log in to add a comment|Discussion|RYM Artists/Bands Top 20 Thread #132: T. Rex (incl. Tyrannosaurus Rex)|Music Polls/Games|Experimental Left Turns Post-Magnum Opus|Music|What is your favorite underrated album?|Music|comment on the last five rated albums by the user above you|Music Polls/Games|Each artist's best song from each of their albums|Music Polls/Games|Baker's Dozen-Albums|Music Polls/Games|Your favorite artists most underrated albums|Music|Type in random album codes to see what comes up|Music Polls/Games|Unpopular musical opinions.|Music|¿Que estas escuchando ahora mismo?|RYM en español|One Artist Releases with Various Artists on it|Rate Your Music|The RYM Artists Top 10|Music Polls/Games|Subscribe to see similar release suggestions|ADVERTISEMENT|Contributions|Contributors to this release:|hotlove|,|Communique|,|germannnn|,|jkra3168|,|yolz|,|ipoduser|,|unj|,|hugdeserver|,|Drifterdk|,|Lovinda|,|[deleted]|,|alcamus|,|Kronz|Log in|to submit a correction or upload art for this release|.|.|.|.|.|.|ADVERTISEMENT|Close|Close|Rate Your Music|© 2000-2023 Sonemic, Inc.|Site links|RYM Network|RYM|music|Sonemic|new music site (beta)|Cinemos|film (beta)|Glitchwave|video games (beta)|Info|FAQ|Development status|RYMzilla|Submissions|Policy|Database standards|Privacy|Consent|Terms of service|Contact us|Support / Feedback",
          "|Vinyl LP|T. Rex|/ 3C 064-95 172|Zinc Alloy and the Hidden Riders of Tomorrow or A Creamed Cage in August|33 rpm, Gatefold, Limited Edition|1974|Vinyl LP|EMI|/ BLNA 7751 DELUXE|Zinc Alloy and the Hidden Riders of Tomorrow|33 rpm, Gatefold|1974|Vinyl LP|Jugoton|/ LSEMI - 73003|Zinc Alloy and the Hidden Riders of Tomorrow|33 rpm, Gatefold|1983|Vinyl LP|MARCL 505|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus Tracks|1985|CD|Marc on Wax|/ MARC D 505|Zinc Alloy and the Hidden Riders of Tomorrow|1987|CD|Teldec|/ 8.26713 243 909-2|Zinc Alloy and the Hidden Riders of Tomorrow|33 rpm|1988|Vinyl LP|PDI|/ E-30.1556|Zinc Alloy and the Hidden Riders of Tomorrow|1989|CD|MARCD 505|Change (The Alternate Zinc Alloy)|Archival|1994|CD|Edsel|/ EDCD 440|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus Tracks, Remastered|1994|CD|Edsel|/ EDCD392|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus Tracks, Digipak, Remastered|2000|CD|Repertoire|/ REP 4905|Zinc Alloy and the Hidden Riders of Tomorrow|CD Sized Album Replica, Limited Edition|2001|CD|TECI-24057|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus CD, Bonus Tracks, Deluxe Edition, Digipak|2002|CD|Edsel|/ MEDCD 717|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus CD, Deluxe Edition, Remastered|2005|CD|Rhino|/ R2 73219|Zinc Alloy and the Hidden Riders of Tomorrow|SHM|2009|CD|TECI-26566|Zinc Alloy & The Hidden Riders of Tomorrow|2011|CD|Fat Possum|/ FP1242|Expand all 20 issues|Compact issues|Expand all 20 issues|Credits|Credits|Tony Visconti|producer|,|string arrangements|Marc Bolan|producer|,|performer|,|writer|,|composer|Mickey Finn|performer|Steve Currie|performer|Bill Legend|performer|Jack Green|performer|Lonnie Jordan|performer|Danny Thompson|performer|B. J. Cole|performer|Sister Pat Hall|backing vocals|The Gloria Jones|backing vocals|Big Richard|backing vocals|Maestro David Katz|strings|The Pop Arts Orchestra|strings|38 Reviews|Page|1|2|3|4|5|>>|Jewlia|Sep 04 2006|I love T.REX, but I can admit when Marc Bolan sucks.  I like this album because I'm a rabid fan, but I know it's pretty terrible...|OH MARC WHY DID YOU GET FAT AND LET COCAINE MAKE YOU SUCK!   I STILL LOVE YOU ANYWAY MY PORKY PIXIE!|Published|ADVERTISEMENT|Walter12|Feb 25 2022|▼|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|Marc Bolan's career is one of the saddest stories in 70's rock music.  Even before his untimely death in 1977, the reputation of his work with T. Rex was in precipitous decline.  It's no small tragedy to transform from being a true trendsetter into a frustrating mediocrity, and that's precisely what Bolan accomplished in a few short years after inventing the entire genre of glam rock.  1974's|Zinc Alloy|is typically cited as the point where Bolan completely lost his way.  Critically panned at the time of its release, and including unwanted forays into funk and soul, it's a record that succeeded in confusing all but the biggest of T. Rex fanboys.  Fortunately, the album has aged better than many may have excepted.  It's still a big step down from Bolan's last three LPs, but it features enough engaging tunes to placate listeners who aren't wedded to the \"pure\" glam rock sound of|Electric Warrior|and|The Slider|.  Underwhelming but listenable enough to warrant 3.0 stars.|By the release of|Tanx|, the formula that Bolan had been using since|Electric Warrior|was obviously running out of steam.  Yet instead of drifting toward art rock, as was the case with many of his glam rock competitors, Bolan decided to add a more diverse slate of pop influences atop familiarly-structured tunes.  Foremost among the stylistic additions to|Zinc Alloy|are piles of Motown-influenced vocals, courtesy of Bolan's real-life partner Gloria Jones.  There's also a funkier vibe to many of the grooves, as well as full-blown orchestra behind most of the guitar lines.  All of these ingredients are brought together via an overblown, Phil Spector-inspired production (produced by Bolan himself).  The only things that haven't significantly changed are the lead vocals and the self-consciously \"trashy\" guitar lines, even if those elements are given far less space to breath than on previous T. Rex releases.  Every track here is immediately identifiable as a T. Rex tune, but those dense backing arrangements also immediately every tune as a part of|Zinc Alloy|.|Zinc Alloy|is an unusual album for me to honestly assess.  I understand the hate that it received back in the day, and I'm forced to admit that most of the stylistic innovations don't really work, but there's a certain charm that brings me back to the record more often that my rating might suggest.  In particular, for an artist who spent most of the 70's repeating himself, it's great to see Bolan attempt something slightly different.  The only truly unforgivable sin of|Zinc Alloy|is its cluttered, wall-of-sound production.  Bolan clearly wasn't ready to self-produce: if Tony Visconti had been involved, I have little doubt that most of arrangements would've been thinned out.  Gloria Jones' backing vocals are also way too high in the mix.  She's a decent singer, and I'm not completely averse to the funk/soul overtones that distinguish mid-70's T. Rex, but on this record her contributions repeatedly overwhelm Bolan's (always endearing) vocal melodies.  Everything on|Zinc Alloy|is simply way too \"huge\" for its own good.|When considered on a track-by-track basis,|Zinc Alloy|is also a mixed bag.  With both|The Slider|and|Tanx|, Bolan made the annoying decision to leave much of his best material off the studio LPs (in favor of releasing non-album singles); on|Zinc Alloy|, he veers wildly in the opposite direction, packing in every half-worthy idea from the past six months.  A 46-minute runtime doesn't usually result in a record that overstays in its welcome, but it's definitely too long for a T. Rex album.  The end result is a release with as many highs as|Tanx|or|Dandy in the Underworld|(both 3.5 stars), but with considerably more filler than any Bolan release since|T. Rex|.  Luckily,|Zinc Alloy|is still easy to listen through in its entirety, mostly because its individual track lengths hover around the three-minute mark, but that isn't enough to overcome to presence of obvious filler.|All of this makes|Zinc Alloy|most appealing as a repository of individually-entertaining tracks.  Foremost among these highlights is \"Teenage Dream\"- a soaring ballad that is arguably the strongest T. Rex single to be released after 1973.  \"Venus Loon\" and \"Explosive Mouth\" should also please the vast majority of casual listeners, assuming they can stomach the overwrought production.  Beyond those three tracks, I have a personal fascination with the|Slider|-esque \"The Avengers (Superbad)\" and the closing \"The Leopards…\", although many hardcore fans may disagree with my enthusiasm here.  The remainder of|Zinc Alloy|is mostly just unexciting, devoid of memorable melodies yet also lacking a clear clunker (although \"Nameless Wildness\" does test my patience with those shrill backing vocals…).  It's just enough to squeak by with a middling, 3.0-star rating, but not enough to warrant an honest recommendation for the album as a whole.|5.8/10|Published|ADVERTISEMENT|yugiaru|Dec 17 2021|▼|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|People back then were really deaf most of the time jesus. You'd think this would be a complete departure from the glam rock style that T. Rex was known for but it's not even that big of a significant change in their sound. There are soul elements in certain songs here and there, but overall, this is 100% pure exaggerated and over the top glam rock as you'd expect from Marc Bolan and his band. Some of the most bizarre songs he ever wrote and made with the band are all on Zinc Alloy, it's such a grandiose album in every sense. Not their best, but I'd count it as part of a great run of albums that began with Electric Warrior.|Published|TheVinylGuy|Sep 02 2021|an elegy to the heroin fuelled hedonism that ran rampant throughout the glam rock era of the early 70s. a ghostly, ghastly, gross experience; a truly cursed album and a terribly bad vibe overall. i love it.|Published|Castrovalva|Jan 24 2021|On this album, T.Rex faceplants into a mess of drugs, alcohol, self-doubt, ego, narcissism, and failed ambition. By 1974, glam rock was treading water, the rise of upstarts like KISS had started to take over, and Bolan completely lost direction with this strange experiment in 'interstellar soul'. Along with Bowie, this one attempts to fuse the British glam stomp with American soul music - only, while 'Young Americans' was a brilliant and inventive pastiche that knew when to stop, this one is a strangely ineffective, rambling mess that never quite decides what it wants to be. The title SOUNDS like it should be some kind of concept album, right? Is Zinc Alloy a person? A place? Who are the hidden riders? None of these questions are answered at any point in the album's tidal wave of verbiage. The first half is a set of more classic T.Rex-sounding songs, culminating in the self-mythologizing of 'Teenage Dream', but the second album descends into rambling, aimless madness. Song titles like 'Painless Persuasion V. The Meathawk Immaculate' and 'The Leopards Featuring Gardenia & The Mighty Slug', which fumble towards profundity, but are little more than Bolan's drunken, drug addled ramblings. He was a few years late for this kind of pseudo-conceptual nonsense in '74. Bolan's ego is so far out of control at this point that the band is now billed as 'Marc Bolan & T.Rex', and the cover art is a weirdly unflattering close up of his pouting face.|And, the production is awful. The playing is fine, but Marc's new girlfriend Gloria Jones is mixed so high that she overpowers every track that she's on. The album is just so overcooked and dense with aimless noodling, misplaced gospel vocals, and Bolan's increasingly incoherent fever dream ramblings that it drags to a completely unsatisfying close. There's a version of it that Edsel put out in the 90's called 'Changes' that strips all of the original production out of it and it is a MUCH better album in pretty much every way.|That said, I love Marc Bolan, so I love this stupid, awful album. It reminds me a lot of 'Be Here Now' by Oasis - it is a product of a band that is now so bloated, drug fucked, drunk, and arrogant, that when it is let loose in the studio with nobody who can say no anymore, the result is stupid, pointless excess in every direction. This is perfect fodder for an episode of 'Trainrecords' or something.|Published|Balance005|Jan 07 2019|Bolan : 9/12|There was a need for change at that point. Even if this cheezy overloaded thing only partially succeeds, it has groove and some kind of dramatic beauty. I had a really hard time getting into it so i can't blame people judging it baldy, especially after just a few listens. I'd admit that the whole thing is dense, long (and it seems longer than it is) and overproduced but there's some magic into it i'd say. While Zinc Alloy may not be one of the strongest T. Rex albums, i'm still deeply attached to it because it's such a unique album withs several great songs which are still quite overlooked in the T. Rex catalogue : Venus Loon, Change, Teenage Dream,  Interstellar Soul...|The 2014 Tony Visconti remaster is the one to get, it sounds terrific (the previous CD releases didn't help restoring the album's reputation).|Published|GARFIELDACRES|Mar 23 2017|Beginning of the end for bolan really,there are some good songs (mostly on side1) and he quite successfully adds a bit of funk to his sound in places. But a lot of the material is definitely patchy and his girlfriend gloria jones vocals don't always work with the songs and she is all over everything.|'teenage dream' is the best thing here by a mile,a reminder of how great bolan's songs and tony visconti's production could be together. Drugs were becoming more of an issue at this point though and their relationship was sorely tested on this album.|Published|MrBlues|Dec 12 2014|This is a disappointing album compared to the earlier glory of Bolan and co. There are a few really good songs, but the rest is just mediocre, non-memorable material. The unique T. Rex sound is here though, it's like a futuristic glam-rock gospel.|The best tracks are \"Venus Loon\", \"Explosive Mouth\", \"Change\" and \"Teenage Dream\". If they dropped off the filler and released just the better songs, it would have made a wonderful EP.|EDIT|: Listening to this again after a few years I find it more pleasing. The last two tracks are pretty good and the band is more funky than ever. I'm also getting more into the backing vocals. Bumped it up from 3 to 3.5 stars.|Published|Page|1|2|3|4|5|>>|Votes are used to help determine the most interesting content on RYM.|Vote up content that is on-topic, within the rules/guidelines, and will likely stay relevant long-term.|Vote down content which breaks the rules.|Catalog|Ratings:|678|Cataloged:|456|Track rating sets:|Track ratings:|55|Rating distribution|Rating trend|Page|1|2|..|4|..|9|..|13|..|18|..|23|..|27|..|32|..|36|..|41|..|46|>>|6 Jul 2023|BlackstarDyl|Try Again, Pal|6 Jul 2023|pass_it_around|28 Jun 2023|juantovar|Vinyl|26 Jun 2023|Redknot52|2 Jun 2023|hwaapczepap|Vinyl|31 May 2023|rupert_X|A shade below Wilco|30 May 2023|nouay|29 May 2023|BreakOut|Great|29 May 2023|IdkSomethingformymami|24 May 2023|slievemore|5 - neutral|23 May 2023|salone|A Certain Fondness|16 May 2023|Pokermask|15 May 2023|MianSwagger|▼|eat a fries|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|14 May 2023|Pulch|Great, solid; definitely listen to it|11 May 2023|themoviejudge|.|.|.|.|.|.|Previous|Next|Tanx|Light of Love|ADVERTISEMENT|Track listing|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|Credits|Tony Visconti|producer|,|string arrangements|Marc Bolan|producer|,|performer|,|writer|,|composer|Mickey Finn|performer|Steve Currie|performer|Bill Legend|performer|Jack Green|performer|Lonnie Jordan|performer|Danny Thompson|performer|B. J. Cole|performer|Sister Pat Hall|backing vocals|The Gloria Jones|backing vocals|Big Richard|backing vocals|Maestro David Katz|strings|The Pop Arts Orchestra|strings|72 Lists|Albums from England - T|Zaragon|1974 Albums Ranked|mgars4|Favorite T. Rex Albums|stanley_the_bugman|Cover Art by Kosh|misterteeth|Tonight’s The Night|BlackstarDyl|Kids... Against the 70s!|massimo73|Series 29 - Generations|minnesotamurray|Albums from 1974 (in no particular order)|ThePunkPanther5|I got 'em on vinyl|DohertyClash|Best Of Crossroads - 1973-1975 - 105 Albums Essentiels|ben007|Love your tan! Albums of 1974 ranked.|Herbie|Lately|Thatstheirbestalbum|BEST 1974'S ALBUM|tblackie|Virtual Crate-Digging: Every Album in My Library|DonRaoul|The Best of T. Rex!|Malchemist|THE BEST OF T.REX|mehhem|See all 72 lists|Comments|Rules for comments|Be respectful!  All the community rules apply here.|Keep your comments focused on the release.  Don't post randomness/off-topic comments.   Jokes are fine, but don't post tactless/inappropriate ones.|Don't get in arguments with people here, or start long discussions.  Use the boards for extended discussion.|Don't use this space to complain about the average rating, chart position, genre voting,  others' reviews or ratings, or errors on the page.|Don't comment just to troll/provoke.  Likewise, don't respond to trollish comments; just report them and ignore them.|Any spoilers should be placed in spoiler tags as such:|[spoiler]|(spoiler goes here)|[/spoiler]|Note|: Unlike reviews, comments are considered temporary and may be deleted/purged without notice.|jjmia|23 Jan 2020 02:45 GMT|Not bad but probably my least favourite from them. It’s too long as well|report|reported|strangefires|12 May 2021 05:55 GMT|I'll have some of what Marc was smoking when he made this|report|reported|abyss_lord|29 Sep 2021 17:52 GMT|Why do I kinda like this lol|Sounds like unintentional zolo|report|reported|ClimateOfHunter|22 Jan 2022 00:38 GMT|It’s wild how much better Teenage Dream is than every other song here. It’s like he used up all his good ideas on that song alone and then went “shit, I still have to write the rest of the album”|report|reported|rogueofmv|28 Jan 01:08 GMT|cedric bixler-zavala|report|reported|mc1382|09 May 09:27 GMT|This is like if one of the members of Dr. Frank-N-Furter's castle made an album|report|reported|krautrockism|20 May 03:30 GMT|mfs with blue eyes|report|reported|Log in to add a comment|Discussion|RYM Artists/Bands Top 20 Thread #132: T. Rex (incl. Tyrannosaurus Rex)|Music Polls/Games|Experimental Left Turns Post-Magnum Opus|Music|What is your favorite underrated album?|Music|comment on the last five rated albums by the user above you|Music Polls/Games|Each artist's best song from each of their albums|Music Polls/Games|Baker's Dozen-Albums|Music Polls/Games|Your favorite artists most underrated albums|Music|Type in random album codes to see what comes up|Music Polls/Games|Unpopular musical opinions.|Music|¿Que estas escuchando ahora mismo?|RYM en español|One Artist Releases with Various Artists on it|Rate Your Music|The RYM Artists Top 10|Music Polls/Games|Subscribe to see similar release suggestions|ADVERTISEMENT|Contributions|Contributors to this release:|hotlove|,|Communique|,|germannnn|,|jkra3168|,|yolz|,|ipoduser|,|unj|,|hugdeserver|,|Drifterdk|,|Lovinda|,|[deleted]|,|alcamus|,|Kronz|Log in|to submit a correction or upload art for this release|.|.|.|.|.|.|ADVERTISEMENT|Close|Close|Rate Your Music|© 2000-2023 Sonemic, Inc.|Site links|RYM Network|RYM|music|Sonemic|new music site (beta)|Cinemos|film (beta)|Glitchwave|video games (beta)|Info|FAQ|Development status|RYMzilla|Submissions|Policy|Database standards|Privacy|Consent|Terms of service|Contact us|Support / Feedback",
          "Marc Bolan Albums: songs, discography, biography, and listening guide - Rate Your Music|sign in|RYM|new music|genres|charts|lists|community|Close|Search:|Music|Film|Games|for:|New Music|Genres|Charts|Lists|Community|Marc Bolan|The Beginning of Doves|Born|30 September 1947,|Hackney, Greater London, United Kingdom|Died|16 September 1977,|Barnes, Greater London, United Kingdom|Member of|Big Carrot|,|Dib Cochran and the Earwigs|,|John's Children|,|T. Rex|Notes|Father of|Rolan Bolan|; founder of|T. Rex|Also Known As|Mark Feld, Toby Tyler|Genres|Glam Rock|,|Contemporary Folk|,|Singer-Songwriter|,|Folk Rock|,|Acoustic Rock|,|Television Music|Share|Follow|651 followers|ADVERTISEMENT|Discography|143|Credits|188|Filmography|5|Album|Showing all (17)|Issues|Average|Avg.|Ratings|Reviews|Ratings/Rev.|Title|/|Release Date|+8|3.23|123|3|123|3|The Beginning of Doves|1974|+10|3.11|60|6|60|6|You Scare Me to Death|1981|+3|3.06|48|3|48|3|Billy Super Duper|1982|•|Marc Bolan & T. Rex|T. Rex|Marc Bolan|3.09|17|1|17|1|Dance in the Midnight|1983|+2|3.08|18|1|18|1|Love and Death|1986|+1|3.22|39|3|39|3|Acoustic Warrior|[archival]|1996|+3|3.50|31|4|31|4|Marc: Songs From the Granada TV Series|[tv soundtrack]|1998|•|Marc Bolan and T. Rex|Marc Bolan|T. Rex|3.84|3|3|-|Twopenny Prince|[archival]|2010|3.98|7|7|-|Beyond the Risin' Sun|2010|2.77|2|2|-|Baby Strange: A Rarities Collection|[archival]|2017|3.50|1|1|-|Misfortune Gatehouse|[archival]|2018|4.00|1|1|-|Tramp King of the City|[archival]|2018|4.00|1|1|-|There Was a Time|[archival]|2018|4.00|1|1|-|Slight Thigh Be-Bop|[archival]|2018|4.53|2|2|-|Home Demos|[archival]|2019|+1|4.02|4|4|-|Pictures of Purple People|[archival]|2019|4.17|3|3|-|Electronic Musik|[archival]|2019|ADVERTISEMENT|Live Album|Showing all (3)|Issues|Average|Avg.|Ratings|Reviews|Ratings/Rev.|Title|/|Release Date|+3|3.54|42|5|42|5|Live 1977|1997|•|Marc Bolan & T. Rex|Marc Bolan|T. Rex|4.00|1|1|-|Marc Bolan & T. Rex (The Acoustic and Live Collection)|[archival]|2009|5.00|1|1|-|Electric Seven 2 at the BBC",
          "|Mark Feld",
          "|I'm well aware that at the time Marc was beginning to incorporate soul (and funk) into his sound (with the aid of his partner Gloria Jones and co.)yet this version of soul tends to sound at times more like a overblown caricature of the sound he was making with Mark Volman and Howard Kaylan. Unfortunately here there was no room for the complementary vocals Mark and Howard excelled at -  more a grossly excessive 'noise' which seemed to all intent and purposes to drown out much of Marc's singing. Beneath all flamboyance and overproduction there are, however, some rather inspired moments. Marc is experimenting  on a number of these tracks rather effectively and some of his guitar work (in particular on 'Carsmile Smith') sounds genuinely soulful.|Zinc Alloy|does have much more to offer than the more simplistic and less consistent|Tanx|certainly, and it's also probably true to say it's Marc's first significant change of direction since|Electric Warrior|.In addition it contains one of Marc's very best singles - the autobiographical 'Teenage Dream'.|It's flawed for sure but Marc's not playing so safe here as on his previous couple of albums and it makes this album perhaps a little more revealing as a result.|Published|ADVERTISEMENT|jbjamieblack|Mar 16 2006|'Zinc Alloy and the Hidden Riders of Tomorrow'|was released in 1974 (which may I say is a splendid title.) As an album people have said that it was a comercial failure. Marc was trying to get rid of the glam rock sound and adding soul and making the T.Rex sound heavier. Adding more strength in backing vocals, heavy guitars, a louder more hard hitting sound.|In my opinion I think this album is under-rated. It deserves more recognition that what It's earned I think. Also the album was a real grower on me. The more I listened to it the more I liked it.|The album starts off with the song 'Venus loon'. 'Venus loon' is a very cathchy song. Same with 'Sound Pit', 'Explosive Mouth', and 'Galaxy'. Also when I listen to all these songs there is something quite magical about it that I just can't put my finger on. 'Change' is a down tempo song which is has a nice sadness about it. Nameless Wildness is a fun song. 'Teenage Dream' the only single from the album. 'Teenage Dream' is a masterpiece! The song is soposed to be about Marc's star on a wane. 'Liquid Gang' another catchy fun song. 'Carsmile Smith and the Old One' is another sad song. Then a beautiful medley arrives - 'You've got to jive to stay alive / Spanish Midnight'. 'Interstellar Soul' - Another fun song. 'Painless Persuasion v. The Meathawauk Immaculate' is another great song. And the last 2 songs are 'The Avengers (Superbad') which is a fun song and 'The Leopards Featuring Gardenia And The Mighty Slug' which is quite weird, Marc does a song where he talks through it which is quite cool.|And the bonus tracks they have added to this collection makes it even more spectacular!|My favourite song on this album is Teenage Dream.|Overall I think this album is an underated classic. I think it should be judged after a few listens. It's not my fave T.Rex album but|I Love It!|Published|slider72|Apr 17 2005|Zinc Alloy, Marc tried to do the name change thing with this one and the record company insisted on Marc Bolan and T.Rex appearing on the sleeve. It was panned when released but through the age of time, songs like \"Change\" Carsmile Smith, The Avengers (Superbad Tiger), Venus Loon, Explosive Mouth, and Teenage Dream, all have improved when listening again and again and again, must be the red wine.|I think the Alternative Issue has more to offer that the Vinyl.|Buy it, play it, put it away, and then in 5 years time you will realise it was a classic T.Rex album or in my case 30+ years|Published|weejum|Apr 16 2005|This is probably Bolan's most bizarre album but I don't think I can rate it as high as his other albums.|Published|<<|Page|1|2|3|4|5|6|>>|Votes are used to help determine the most interesting content on RYM.|Vote up content that is on-topic, within the rules/guidelines, and will likely stay relevant long-term.|Vote down content which breaks the rules.|.|.|.|.|.|.|Track listing|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|Credits|Tony Visconti|producer|,|string arrangements|Marc Bolan|producer|,|performer|,|writer|,|composer|Mickey Finn|performer|Steve Currie|performer|Bill Legend|performer|Jack Green|performer|Lonnie Jordan|performer|Danny Thompson|performer|B. J. Cole|performer|Sister Pat Hall|backing vocals|The Gloria Jones|backing vocals|Big Richard|backing vocals|Maestro David Katz|strings|The Pop Arts Orchestra|strings|.|.|.|.|.|.|ADVERTISEMENT|Close|Close|Rate Your Music|© 2000-2023 Sonemic, Inc.|Site links|RYM Network|RYM|music|Sonemic|new music site (beta)|Cinemos|film (beta)|Glitchwave|video games (beta)|Info|FAQ|Development status|RYMzilla|Submissions|Policy|Database standards|Privacy|Consent|Terms of service|Contact us|Support / Feedback",
          "|a lot of people don't like this lp very much but i think it is one of t rex's best and most interesting offerings.",
          "Review for Zinc Alloy and the Hidden Riders of Tomorrow - Marc Bolan & T. Rex by GARFIELDACRES - Rate Your Music|sign in|RYM|new music|genres|charts|lists|community|Close|Search:|Music|Film|Games|for:|New Music|Genres|Charts|Lists|Community|Welcome to|Rate Your Music|RYM is one of the largest music databases and communities online, which you can use in endless ways to discover new music.|Learn about some of the ways you can use RYM for music discovery.|Zinc Alloy and the Hidden Riders of Tomorrow|(1974)|Marc Bolan & T. Rex|3.19|from 757 ratings|Genres|Glam Rock|Blue-Eyed Soul|Descriptors|melodic, quirky, rhythmic, female vocals, surreal, anxious, uplifting, playful, bittersweet, passionate, lush, male vocals, sensual, energetic|Zinc Alloy and the Hidden Riders of Tomorrow|(1974)|Marc Bolan & T. Rex|Review by|GARFIELDACRES|Beginning of the end for bolan really,there are some good songs (mostly on side1) and he quite successfully adds a bit of funk to his sound in places. But a lot of the material is definitely patchy and his girlfriend gloria jones vocals don't always work with the songs and she is all over everything.|'teenage dream' is the best thing here by a mile,a reminder of how great bolan's songs and tony visconti's production could be together. Drugs were becoming more of an issue at this point though and their relationship was sorely tested on this album.|Expand review|Hide|Close|Close|Rate Your Music|© 2000-2023 Sonemic, Inc.|Site links|RYM Network|RYM|music|Sonemic|new music site (beta)|Cinemos|film (beta)|Glitchwave|video games (beta)|Info|FAQ|Development status|RYMzilla|Submissions|Policy|Database standards|Privacy|Consent|Terms of service|Contact us|Support / Feedback",
          "|Zinc Alloy and the Hidden Riders of Tomorrow or A Creamed Cage in August|33 rpm, Gatefold, Limited Edition|1974|Vinyl LP|EMI|/ BLNA 7751 DELUXE|Zinc Alloy and the Hidden Riders of Tomorrow|33 rpm, Gatefold|1974|Vinyl LP|Jugoton|/ LSEMI - 73003|Zinc Alloy and the Hidden Riders of Tomorrow|33 rpm, Gatefold|1983|Vinyl LP|MARCL 505|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus Tracks|1985|CD|Marc on Wax|/ MARC D 505|Zinc Alloy and the Hidden Riders of Tomorrow|1987|CD|Teldec|/ 8.26713 243 909-2|Zinc Alloy and the Hidden Riders of Tomorrow|33 rpm|1988|Vinyl LP|PDI|/ E-30.1556|Zinc Alloy and the Hidden Riders of Tomorrow|1989|CD|MARCD 505|Change (The Alternate Zinc Alloy)|Archival|1994|CD|Edsel|/ EDCD 440|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus Tracks, Remastered|1994|CD|Edsel|/ EDCD392|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus Tracks, Digipak, Remastered|2000|CD|Repertoire|/ REP 4905|Zinc Alloy and the Hidden Riders of Tomorrow|CD Sized Album Replica, Limited Edition|2001|CD|TECI-24057|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus CD, Bonus Tracks, Deluxe Edition, Digipak|2002|CD|Edsel|/ MEDCD 717|Zinc Alloy and the Hidden Riders of Tomorrow|Bonus CD, Deluxe Edition, Remastered|2005|CD|Rhino|/ R2 73219|Zinc Alloy and the Hidden Riders of Tomorrow|SHM|2009|CD|TECI-26566|Zinc Alloy & The Hidden Riders of Tomorrow|2011|CD|Fat Possum|/ FP1242|Expand all 20 issues|Compact issues|Expand all 20 issues|Credits|Credits|Tony Visconti|producer|,|string arrangements|Marc Bolan|producer|,|performer|,|writer|,|composer|Mickey Finn|performer|Steve Currie|performer|Bill Legend|performer|Jack Green|performer|Lonnie Jordan|performer|Danny Thompson|performer|B. J. Cole|performer|Sister Pat Hall|backing vocals|The Gloria Jones|backing vocals|Big Richard|backing vocals|Maestro David Katz|strings|The Pop Arts Orchestra|strings|45 Reviews|Page|1|2|3|4|5|6|>>|Jewlia|Sep 04 2006|I love T.REX, but I can admit when Marc Bolan sucks.  I like this album because I'm a rabid fan, but I know it's pretty terrible...|OH MARC WHY DID YOU GET FAT AND LET COCAINE MAKE YOU SUCK!   I STILL LOVE YOU ANYWAY MY PORKY PIXIE!|Published|ADVERTISEMENT|Walter12|Feb 25 2022|▼|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|Marc Bolan's career is one of the saddest stories in 70's rock music.  Even before his untimely death in 1977, the reputation of his work with T. Rex was in precipitous decline.  It's no small tragedy to transform from being a true trendsetter into a frustrating mediocrity, and that's precisely what Bolan accomplished in a few short years after inventing the entire genre of glam rock.  1974's|Zinc Alloy|is typically cited as the point where Bolan completely lost his way.  Critically panned at the time of its release, and including unwanted forays into funk and soul, it's a record that succeeded in confusing all but the biggest of T. Rex fanboys.  Fortunately, the album has aged better than many may have excepted.  It's still a big step down from Bolan's last three LPs, but it features enough engaging tunes to placate listeners who aren't wedded to the \"pure\" glam rock sound of|Electric Warrior|and|The Slider|.  Underwhelming but listenable enough to warrant 3.0 stars.|By the release of|Tanx|, the formula that Bolan had been using since|Electric Warrior|was obviously running out of steam.  Yet instead of drifting toward art rock, as was the case with many of his glam rock competitors, Bolan decided to add a more diverse slate of pop influences atop familiarly-structured tunes.  Foremost among the stylistic additions to|Zinc Alloy|are piles of Motown-influenced vocals, courtesy of Bolan's real-life partner Gloria Jones.  There's also a funkier vibe to many of the grooves, as well as full-blown orchestra behind most of the guitar lines.  All of these ingredients are brought together via an overblown, Phil Spector-inspired production (produced by Bolan himself).  The only things that haven't significantly changed are the lead vocals and the self-consciously \"trashy\" guitar lines, even if those elements are given far less space to breath than on previous T. Rex releases.  Every track here is immediately identifiable as a T. Rex tune, but those dense backing arrangements also immediately every tune as a part of|Zinc Alloy|.|Zinc Alloy|is an unusual album for me to honestly assess.  I understand the hate that it received back in the day, and I'm forced to admit that most of the stylistic innovations don't really work, but there's a certain charm that brings me back to the record more often that my rating might suggest.  In particular, for an artist who spent most of the 70's repeating himself, it's great to see Bolan attempt something slightly different.  The only truly unforgivable sin of|Zinc Alloy|is its cluttered, wall-of-sound production.  Bolan clearly wasn't ready to self-produce: if Tony Visconti had been involved, I have little doubt that most of arrangements would've been thinned out.  Gloria Jones' backing vocals are also way too high in the mix.  She's a decent singer, and I'm not completely averse to the funk/soul overtones that distinguish mid-70's T. Rex, but on this record her contributions repeatedly overwhelm Bolan's (always endearing) vocal melodies.  Everything on|Zinc Alloy|is simply way too \"huge\" for its own good.|When considered on a track-by-track basis,|Zinc Alloy|is also a mixed bag.  With both|The Slider|and|Tanx|, Bolan made the annoying decision to leave much of his best material off the studio LPs (in favor of releasing non-album singles); on|Zinc Alloy|, he veers wildly in the opposite direction, packing in every half-worthy idea from the past six months.  A 46-minute runtime doesn't usually result in a record that overstays in its welcome, but it's definitely too long for a T. Rex album.  The end result is a release with as many highs as|Tanx|or|Dandy in the Underworld|(both 3.5 stars), but with considerably more filler than any Bolan release since|T. Rex|.  Luckily,|Zinc Alloy|is still easy to listen through in its entirety, mostly because its individual track lengths hover around the three-minute mark, but that isn't enough to overcome to presence of obvious filler.|All of this makes|Zinc Alloy|most appealing as a repository of individually-entertaining tracks.  Foremost among these highlights is \"Teenage Dream\"- a soaring ballad that is arguably the strongest T. Rex single to be released after 1973.  \"Venus Loon\" and \"Explosive Mouth\" should also please the vast majority of casual listeners, assuming they can stomach the overwrought production.  Beyond those three tracks, I have a personal fascination with the|Slider|-esque \"The Avengers (Superbad)\" and the closing \"The Leopards…\", although many hardcore fans may disagree with my enthusiasm here.  The remainder of|Zinc Alloy|is mostly just unexciting, devoid of memorable melodies yet also lacking a clear clunker (although \"Nameless Wildness\" does test my patience with those shrill backing vocals…).  It's just enough to squeak by with a middling, 3.0-star rating, but not enough to warrant an honest recommendation for the album as a whole.|5.8/10|Published|ADVERTISEMENT|yugiaru|Dec 17 2021|▼|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|People back then were really deaf most of the time jesus. You'd think this would be a complete departure from the glam rock style that T. Rex was known for but it's not even that big of a significant change in their sound. There are soul elements in certain songs here and there, but overall, this is 100% pure exaggerated and over the top glam rock as you'd expect from Marc Bolan and his band. Some of the most bizarre songs he ever wrote and made with the band are all on Zinc Alloy, it's such a grandiose album in every sense. Not their best, but I'd count it as part of a great run of albums that began with Electric Warrior.|Published|TheVinylGuy|Sep 02 2021|an elegy to the heroin fuelled hedonism that ran rampant throughout the glam rock era of the early 70s. a ghostly, ghastly, gross experience; a truly cursed album and a terribly bad vibe overall. i love it.|Published|Castrovalva|Jan 24 2021|On this album, T.Rex faceplants into a mess of drugs, alcohol, self-doubt, ego, narcissism, and failed ambition. By 1974, glam rock was treading water, the rise of upstarts like KISS had started to take over, and Bolan completely lost direction with this strange experiment in 'interstellar soul'. Along with Bowie, this one attempts to fuse the British glam stomp with American soul music - only, while 'Young Americans' was a brilliant and inventive pastiche that knew when to stop, this one is a strangely ineffective, rambling mess that never quite decides what it wants to be. The title SOUNDS like it should be some kind of concept album, right? Is Zinc Alloy a person? A place? Who are the hidden riders? None of these questions are answered at any point in the album's tidal wave of verbiage. The first half is a set of more classic T.Rex-sounding songs, culminating in the self-mythologizing of 'Teenage Dream', but the second album descends into rambling, aimless madness. Song titles like 'Painless Persuasion V. The Meathawk Immaculate' and 'The Leopards Featuring Gardenia & The Mighty Slug', which fumble towards profundity, but are little more than Bolan's drunken, drug addled ramblings. He was a few years late for this kind of pseudo-conceptual nonsense in '74. Bolan's ego is so far out of control at this point that the band is now billed as 'Marc Bolan & T.Rex', and the cover art is a weirdly unflattering close up of his pouting face.|And, the production is awful. The playing is fine, but Marc's new girlfriend Gloria Jones is mixed so high that she overpowers every track that she's on. The album is just so overcooked and dense with aimless noodling, misplaced gospel vocals, and Bolan's increasingly incoherent fever dream ramblings that it drags to a completely unsatisfying close. There's a version of it that Edsel put out in the 90's called 'Changes' that strips all of the original production out of it and it is a MUCH better album in pretty much every way.|That said, I love Marc Bolan, so I love this stupid, awful album. It reminds me a lot of 'Be Here Now' by Oasis - it is a product of a band that is now so bloated, drug fucked, drunk, and arrogant, that when it is let loose in the studio with nobody who can say no anymore, the result is stupid, pointless excess in every direction. This is perfect fodder for an episode of 'Trainrecords' or something.|Published|Balance005|Jan 07 2019|Bolan : 9/12|There was a need for change at that point. Even if this cheezy overloaded thing only partially succeeds, it has groove and some kind of dramatic beauty. I had a really hard time getting into it so i can't blame people judging it baldy, especially after just a few listens. I'd admit that the whole thing is dense, long (and it seems longer than it is) and overproduced but there's some magic into it i'd say. While Zinc Alloy may not be one of the strongest T. Rex albums, i'm still deeply attached to it because it's such a unique album withs several great songs which are still quite overlooked in the T. Rex catalogue : Venus Loon, Change, Teenage Dream,  Interstellar Soul...|The 2014 Tony Visconti remaster is the one to get, it sounds terrific (the previous CD releases didn't help restoring the album's reputation).|Published|GARFIELDACRES|Mar 23 2017|Beginning of the end for bolan really,there are some good songs (mostly on side1) and he quite successfully adds a bit of funk to his sound in places. But a lot of the material is definitely patchy and his girlfriend gloria jones vocals don't always work with the songs and she is all over everything.|'teenage dream' is the best thing here by a mile,a reminder of how great bolan's songs and tony visconti's production could be together. Drugs were becoming more of an issue at this point though and their relationship was sorely tested on this album.|Published|MrBlues|Dec 12 2014|This is a disappointing album compared to the earlier glory of Bolan and co. There are a few really good songs, but the rest is just mediocre, non-memorable material. The unique T. Rex sound is here though, it's like a futuristic glam-rock gospel.|The best tracks are \"Venus Loon\", \"Explosive Mouth\", \"Change\" and \"Teenage Dream\". If they dropped off the filler and released just the better songs, it would have made a wonderful EP.|EDIT|: Listening to this again after a few years I find it more pleasing. The last two tracks are pretty good and the band is more funky than ever. I'm also getting more into the backing vocals. Bumped it up from 3 to 3.5 stars.|Published|Page|1|2|3|4|5|6|>>|Votes are used to help determine the most interesting content on RYM.|Vote up content that is on-topic, within the rules/guidelines, and will likely stay relevant long-term.|Vote down content which breaks the rules.|Catalog|Ratings:|757|Cataloged:|569|Track rating sets:|Track ratings:|57|Rating distribution|Rating trend|Page|1|2|..|5|..|10|..|15|..|20|..|25|..|30|..|35|..|40|..|45|..|51|>>|6 Jul 2023|BlackstarDyl|Try Again, Pal|6 Jul 2023|pass_it_around|28 Jun 2023|juantovar|Vinyl|26 Jun 2023|Redknot52|2 Jun 2023|hwaapczepap|Vinyl|31 May 2023|rupert_X|A shade below Wilco|30 May 2023|nouay|29 May 2023|BreakOut|Great|29 May 2023|IdkSomethingformymami|24 May 2023|slievemore|5 - neutral|23 May 2023|salone|A Certain Fondness|16 May 2023|Pokermask|15 May 2023|MianSwagger|▼|eat a fries|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|14 May 2023|Pulch|Great, solid; definitely listen to it|11 May 2023|themoviejudge|.|.|.|.|.|.|Previous|Next|Tanx|Light of Love|ADVERTISEMENT|Track listing|A1|Venus Loon|A2|Sound Pit|A3|Explosive Mouth|A4|Galaxy|A5|Change|A6|Nameless Wilderness|A7|Teenage Dream|B1|Liquid Gang|B2|Carsmile Smith and the Old One|B3|You Got to Jive to Stay Alive - Spanish Midnight|B4|Interstellar Soul|B5|Painless Persuasion v. the Meathawk Immaculate|B6|The Avengers (Superbad)|B7|The Leopards Featuring Gardenia and the Mighty Slug|Credits|Tony Visconti|producer|,|string arrangements|Marc Bolan|producer|,|performer|,|writer|,|composer|Mickey Finn|performer|Steve Currie|performer|Bill Legend|performer|Jack Green|performer|Lonnie Jordan|performer|Danny Thompson|performer|B. J. Cole|performer|Sister Pat Hall|backing vocals|The Gloria Jones|backing vocals|Big Richard|backing vocals|Maestro David Katz|strings|The Pop Arts Orchestra|strings|84 Lists|Ranking Music 1974|dementri06|1974:Top 70 Rock Album|vanKuver|My Miniature LPs..|muzex|Series 29 - Generations|minnesotamurray|Worst album names|mibesu|Alphabetic albums, 20 per letter?|ronb626|1974|juicefacekilla|MY OWN VINYL COLLECTION (MY T. REX, MARC BOLAN´S ALBUMS)|mikelarambur|Wam Bam Thank You Glam !|popandcircumstance|Best Of Crossroads - 1973-1975 - 105 Albums Essentiels|ben007|My Top 100 Albums of All Time|List3n|My 1974 Albums, Muhammad Ali vs George Foreman|theflynet|My Album Collection [LP]|DaOneAndOnly1234|I got 'em on vinyl|DohertyClash|Purchases 2009|DrCrower|2018 - 580 Albums I listened to|djiaind|See all 84 lists|Comments|Rules for comments|Be respectful!  All the community rules apply here.|Keep your comments focused on the release.  Don't post randomness/off-topic comments.   Jokes are fine, but don't post tactless/inappropriate ones.|Don't get in arguments with people here, or start long discussions.  Use the boards for extended discussion.|Don't use this space to complain about the average rating, chart position, genre voting,  others' reviews or ratings, or errors on the page.|Don't comment just to troll/provoke.  Likewise, don't respond to trollish comments; just report them and ignore them.|Any spoilers should be placed in spoiler tags as such:|[spoiler]|(spoiler goes here)|[/spoiler]|Note|: Unlike reviews, comments are considered temporary and may be deleted/purged without notice.|jjmia|23 Jan 2020 02:45 GMT|Not bad but probably my least favourite from them. It’s too long as well|report|reported|strangefires|12 May 2021 05:55 GMT|I'll have some of what Marc was smoking when he made this|report|reported|abyss_lord|29 Sep 2021 17:52 GMT|Why do I kinda like this lol|Sounds like unintentional zolo|report|reported|ClimateOfHunter|22 Jan 2022 00:38 GMT|It’s wild how much better Teenage Dream is than every other song here. It’s like he used up all his good ideas on that song alone and then went “shit, I still have to write the rest of the album”|report|reported|rogueofmv|28 Jan 01:08 GMT|cedric bixler-zavala|report|reported|mc1382|09 May 09:27 GMT|This is like if one of the members of Dr. Frank-N-Furter's castle made an album|report|reported|krautrockism|20 May 03:30 GMT|mfs with blue eyes|report|reported|Log in to add a comment|Discussion|RYM Artists/Bands Top 20 Thread #132: T. Rex (incl. Tyrannosaurus Rex)|Music Polls/Games|Experimental Left Turns Post-Magnum Opus|Music|What is your favorite underrated album?|Music|comment on the last five rated albums by the user above you|Music Polls/Games|Each artist's best song from each of their albums|Music Polls/Games|Baker's Dozen-Albums|Music Polls/Games|Your favorite artists most underrated albums|Music|Type in random album codes to see what comes up|Music Polls/Games|Unpopular musical opinions.|Music|¿Que estas escuchando ahora mismo?|RYM en español|One Artist Releases with Various Artists on it|Rate Your Music|The RYM Artists Top 10|Music Polls/Games|Subscribe to see similar release suggestions|ADVERTISEMENT|Contributions|Contributors to this release:|hotlove|,|Communique|,|germannnn|,|jkra3168|,|yolz|,|ipoduser|,|unj|,|hugdeserver|,|Drifterdk|,|Lovinda|,|[deleted]|,|alcamus|,|Kronz|Log in|to submit a correction or upload art for this release|.|.|.|.|.|.|ADVERTISEMENT|Close|Close|Rate Your Music|© 2000-2023 Sonemic, Inc.|Site links|RYM Network|RYM|music|Sonemic|new music site (beta)|Cinemos|film (beta)|Glitchwave|video games (beta)|Info|FAQ|Development status|RYMzilla|Submissions|Policy|Database standards|Privacy|Consent|Terms of service|Contact us|Support / Feedback",
          "|It would be easy to dismiss \"Bolan's Zip Gun\" as a misfire, his only album in the 70's to miss the charts completely. Yes, it misses the production talent of Tony Visconti and the songs are a level or three below those of his early 70's heyday.|Unlike his contemporaries Bowie and Ferry, Bolan was never granted respected album-maker status so that when the TRextasy of his teenyboppers abated, he found himself in an artistic cul-de-sac and his commercial prospects greatly diminished.|To do him fair, he just ploughed on and kept going right up until his tragically early death only a couple of years later but this particular record finds him betwixt and between in no Marc's Land, lacking in inspiration and consistency. The guy who'd produced some of the best riffs of the decade (\"Get It On\", \"Telegram Sam' and \"20th Century Boy\", to name but three) is instead flailing about hoping another heavy one will land on him but it's more ifs than riffs, I'm sorry to say.|The album-bookending singles are okay, the cheery but lightweight \"Light Of Love\" and the punchier, keyboard-driven \"Zip Gun Boogie\" but in between there's more effort than excellence on display. You do miss Visconti's magical way especially with strings as a good number of the tracks sound underpowered, undeedeveloped and yes, under-produced, there's barely a string arrangement or horns break to provide a point of difference never mind excitement to the songs.|Perhaps the more stripped-back sound reflects a conscious decision by Bolan himself as producer but the songs are mostly slight with often trite lyrics and little of the love-him-or-hate-him cocksure confidence which carried him through his initial success.|That said, a little elfin magic goes a long way and you can hear him striving for inspiration throughout, throwing everything at the wall and hoping something might stick but in the end the material just fails to excite. Choruses are repeated over and over to often basic arrangements with too many songs given over to the over-loud female backing singers, who prominently included his future wife Gloria Jones.|\"Solid Baby\" sounds like a rewrite of Roy Orbison's \"Dream Baby\", ditto \"Token Of My Love\" and Phil Phillips's \"Sea Of Love\" right down to re-using its opening line while Bolan would never admit that his \"Precious Star\" seems to crib from friend-turned-rival David Bowie's \"The Prettiest Star\". He also can't resist referencing Bowie's \"Diamond Dogs\" in|\"I Really Love You Babe\", the track where I just about offered up my aural submission to his caterwauling choir.|Others like \"Space Boss\", \"Think Zinc\" and \"Girl in the Thunderbolt Suit\" sound like choruses in search of songs and even though \"Til Dawn\" and \"Golden Belt\" both aim for something heavier they likewise struggle to really deliver.|You had to feel for Bolan at this stage of his career, seeing Bowie and Ferry at the time achieve the artistic integrity and respectability never mind record sales denied to him. To be frank, this record didn't deserve much more than it got both from the critics and the public but better was to come from the Bopping Elf before he met his sad end in early 1977.|Published|ADVERTISEMENT|Walter12|Mar 05 2022|▼|A1|Light of Love|A2|Solid Baby|A3|Precious Star|A4|Token of My Love|A5|Space Boss|A6|Think Zinc|B1|Till Dawn|B2|Girl in the Thunderbolt Suit|B3|I Really Love You Babe|B4|Golden Belt|B5|Zip Gun Boogie|Glam has always been a divisive genre, with unsympathetic listeners deriding most glam rock as \"trashy\" and self-consciously \"kitsch\".  Such accusations are especially common with a band like T. Rex, whose comparatively unambitious approach is easy to dismiss as repetitive or downright naïve.  Now, I have little doubt that a purposefully unsophisticated sound was on Marc Bolan's mind when he founded glam rock back in 1971, but that doesn't mean that I'd categorize the bulk of T. Rex's discography as kitsch.  The one place where this hesitancy fades is with respect to|Bolan's Zip Gun|.  Widely considered to be the nadir of Bolan's glam rock phase, it's a record where all of T. Rex's least endearing aspects take center stage.  The end result isn't quite a disaster, but it routinely crosses the boundary into trashy mediocrity.  An utterly superfluous record for someone who isn't already a devoted T. Rex fan.|Bolan's Zip Gun|expands upon the stylistic \"innovations\" of|Zinc Alloy|while ditching its predecessor's overblown, wall-of-sound production.  Every track here still qualifies as straightforward glam rock, with T. Rex's usual supply of toe-tapping grooves and elfin vocals, but Bolan has continued to pile on bits of soul and funk.  These developments are epitomized in the backing vocals of Gloria Jones- Bolan's real-life partner, and by this point an essential component in his songwriting process.  Jones' full-throated vocals repeatedly crowd out Bolan's more understated contributions, to the degree that many tracks border on becoming full-blown duets.|Bolan's Zip Gun|also features more saxophone than any previous T. Rex release, whereas the electric guitar (when it actually appears) is sometimes distorted to such a degree that it's difficult to distinguish from saxophone.  Rounding out the overall vibe are a collection of vocal melodies that are simplistic even by T. Rex standards, with \"choruses\" than often involve little more than repeating a single phrase with minor difference in inflection.|As I've stated in earlier T. Rex reviews, I'm not openly averse to Bolan's infatuation with funk and soul infatuations, but I'm repeatedly underwhelmed by how Bolan actually implements those touches.|Bolan's Zip Gun|only accentuates many of Bolan's worst habits with respect to the style.  In particular, I'm routinely bothered by Jones' backing vocals.  She's always way too far up in the mix, and she repeatedly opts for a shrill tone that clashes with Bolan's understated delivery.  Nearly as frustrating is the fact that all those toe-tapping grooves seem to have convinced Bolan that his vocal melodies don't require melodic development.  Many of the album's vocal melodies are built around a catchy hook, but then Bolan absolutely beats that hook to death.  The only way that|Bolan's Zip Gun|represents an improvement over|Zinc Alloy|is via its crisper production, which harkens all of the way back to|Electric Warrior|.  Bolan has come a long way as a producer since|Zinc Alloy|, even if I'm sure that he would've been far better off with Tony Visconti in the production studio.|Bolan's Zip Gun|also features fewer great tracks than any other T. Rex record of the decade.  This lack of highlights extends all of the way up to the album's lead single, \"Light of Love\".  I simply can't understand the appeal of that track, either from a glam perspective or a pop soul perspective, seeing as I find it's repetitive vocal hook to be borderline-annoying.  Arguably Bolan's weakest single that charted relatively well.  The album's other single, \"Zip Gun Boogie\", is far more entertaining but still pales in comparison to most T. Rex hits.  Alongside \"Space Boss\" and \"Think Zinc\", \"Zip Gun Boogie\" is also one of the tracks off|Bolan's Zip Gun|were Bolan fully gives succumbs to unapologetic kitsch.  A guilty pleasure, perhaps, but little more.  The rest of|Bolan's Zip Gun|is consistently listenable but never great.  My (apparently unconventional) choice for the album's best deep cut is \"Girl in the Thunderbolt Suit\"- an interesting mix of rock 'n roll with pop soul that features more vocal swagger than anything else here.  \"Solid Baby\", \"Think Zinc\", and \"I Really Love You Babe\" are also worthy of mention, but none of these tracks invite repeated listening.|I suppose it's a testament to Bolan's talent that even the weakest (mature) record of his career is still semi-engaging enough to warrant 2.5 stars.  Just don't mistake this admission for an endorsement.|Bolan's Zip Gun|is still utterly inessential, even by the incredibly modest standard of other 2.5-star albums in my 70's rock collection.  Luckily, Bolan would subsequently recover some semblance of his mojo on|Futuristic Dragon|, leaving|Bolan's Zip Gun|as the sole T. Rex album in the 2.5-star tier.|5.3/10|Published|Castrovalva|Jan 24 2021|The most common take on this album is that it is Bolan's absolute nadir, was recorded when he was a fat, bloated drug addict, and is packed with derivative, nonsensical garbage that squanders his talent. Everyone is wrong - 'Bolan's Zip Gun' is a fucking GREAT record, and kicks off the final arc of his career, after the slump into the excessive lunacy of the 'Zinc Alloy' era. Here, T.Rex is completely stripped back and lean, and the glam/soul fusion actually works really well. 'Light Of Love' is classic T.Rex, 'Solid Baby'  is lean and randy, and on 'Token Of My Love', Bolan manages to merge his twiddly guitar antics with the screaming vocals of Gloria Jones to extremely impressive effect. Gloria is still waaaay high in the mix here, but she's less obnoxious than on 'Zinc Alloy', and some attempt seems to have been made to fold her into the sound, rather than letting her sit on top. Produced by Bolan, the lack of Visconti's hand doesn't destroy this material - the sound is leaner, starker, and harder. It's definitely a different direction, but it's fucking great.|The two tracks that I really love from this one are 'Zip Gun Boogie' and 'Golden Belt'. 'Zip Gun Boogie' pairs one of the best hard rock riffs that Bolan would ever right, with an excellent 'The Groover'-esque verse. That descending, crunchy lead line in the intro and chorus - it's just awesome. And, 'Golden Belt' is a soul/funk jam full of tinkling pianos, suspended chords, and great use made of Gloria's vocals. So, ignore all of the people who ran this album down for the last 40 years - THIS, and not 'Futuristic Dragon', is the ACTUAL rebirth of T.Rex, and kicks off Bolan's remarkable late 70's comeback as one of the architects of punk.|Published|Balance005|Jan 07 2019|Bolan : 10/12|The album is often seen as a career nadir. Bolan eventually admitted the record was a failure, saying it was completely over-produced and the worst he made. Even if it is, the fact that Bolan's career lasted only about 10 years makes that not such a huge statement. Thinking about it i'm not really sure i'd take \"Prophets...\" over that one. Anyway what i meant to say was simply that the album is not that bad at all. Bolan's Zip Gun can be either fun (most of the songs are pleasantly funny, even the stupid Zip Gun Boogie) or irritating because of the production and bad tastes (Zip Gun Boogie, Space Boss...). There is less violins than in Zinc Alloy, probably because Visconti is gone (he worked on Till Dawn though). The female backing vocals remain very intrusive, you have to be prepared for that.  To put it simply, when i want my T. Rex to be shiny, fun and easy, i can put that one and appreciate it. It's a bit inconsequential and hard to digest but it's also awkwardly fun. There is some life in it that's for sure. A short and sweet listening experience as far as i'm concerned.|Published|GARFIELDACRES|Mar 23 2017|Carries on from 'zinc alloy' really,with marc continuing to add his own spin on funk and disco to his sound. The songs are nearly all pretty repetitive and mostly lacking in magic,and lacking on the kind of smooth rhythms and grooves that bowie managed with 'young americans' for instance. Bolan had taken over production too,and the sound badly misses tony visconti's touch.|That said it's probably slightly more listenable than 'zinc alloy' and boasts a couple of very decent tracks in 'zip gun boogie' and 'til dawn'... the latter frustratingly being the only occasion here where it sounds like he was capable of achieving the kind of music he was clearly after here.|Published|Warthur|Oct 17 2012|Bolan's Zip Gun continues the approach of Zinc Alloy and the Hidden Riders of Tomorrow when it comes to fusing soul with the glam rock sound, though less successfully - in particular, I kind of miss the bombastic over-the-top production job the previous album had. Light of Love is charming, and Think Zinc is an engaging enough stomper, but a lot of the songs on here (including the entire second side) are just kind of forgettable. It's not a bad album and T. Rex fans will find reasons to enjoy it, but at the same time I think it might be their least successful studio albums if you discount posthumous material. Now, if I could only get the refrain from Think Zinc out of my head...|Published|Page|1|2|3|4|>>|Votes are used to help determine the most interesting content on RYM.|Vote up content that is on-topic, within the rules/guidelines, and will likely stay relevant long-term.|Vote down content which breaks the rules.|Catalog|Ratings:|557|Cataloged:|365|Track rating sets:|Track ratings:|32|Rating distribution|Rating trend|Page|1|2|3|..|7|..|11|..|15|..|19|..|22|..|26|..|30|..|34|..|38|>>|28 Jun 2023|juantovar|Vinyl|26 Jun 2023|Redknot52|29 May 2023|BreakOut|Really good|29 May 2023|IdkSomethingformymami|26 May 2023|salone|Pleasurable Feelings|25 May 2023|Lejink|17 May 2023|Pokermask|16 May 2023|Piggy_Better|11 May 2023|themoviejudge|3 May 2023|MordoGoodIGuess|Barnes & Noble Record Aisle|2 May 2023|BlackMidiIsMid|Thom Yorke (Matt Bellamy)|2 May 2023|feloniousPUNK|26 Apr 2023|HermitCook|Bad|17 Apr 2023|leonardohiei|13 Apr 2023|Jamie_Spraggon|CD|Below Average|.|.|.|.|Previous|Next|Light of Love|Futuristic Dragon|ADVERTISEMENT|Track listing|A1|Light of Love|3:15|A2|Solid Baby|2:36|A3|Precious Star|2:51|A4|Token of My Love|3:39|A5|Space Boss|2:47|A6|Think Zinc|3:20|B1|Till Dawn|3:01|B2|Girl in the Thunderbolt Suit|2:19|B3|I Really Love You Babe|3:31|B4|Golden Belt|2:39|B5|Zip Gun Boogie|3:18|Total length: 33:16|Credits|Marc Bolan|writer|,|producer|,|vocals|,|guitar|Steve Currie|bass|Gloria Jones|vocals|,|Clavinet|David Lutton|drums|Dino Dines|keyboards|Mickey Finn|percussion|Keith Morris|photography|John Kosh|artwork|46 Lists|1975 Albums Ranked|mgars4|A Listener's Diary 2017|yerblues|Favourite Albums of 1975|turbotiger|1975: Albums Ranked|metsfan5150|\"All Schools are Strange\": Marc Bolan Roop's Top 150 Songs...|rupertlenz|Ranking T.Rex's Studio Albums|mtopper|Ranking Marc Bolan T.Rex|beestie|Virtual Crate-Digging: Every Album in My Library|DonRaoul|The Best of T. Rex!|Malchemist|1975|kenjah|Albums from 1975 (in no particular order)|ThePunkPanther5|Earthbound: Samples, References, etc.|chainchomp|1975 - The Best of (According to Jake)|jakelicious|T. REX : Best to Worst|BoboOtter|NEW MUSIC|MianSwagger|Best Records from 1975|bubrub|See all 46 lists|Comments|Rules for comments|Be respectful!  All the community rules apply here.|Keep your comments focused on the release.  Don't post randomness/off-topic comments.   Jokes are fine, but don't post tactless/inappropriate ones.|Don't get in arguments with people here, or start long discussions.  Use the boards for extended discussion.|Don't use this space to complain about the average rating, chart position, genre voting,  others' reviews or ratings, or errors on the page.|Don't comment just to troll/provoke.  Likewise, don't respond to trollish comments; just report them and ignore them.|Any spoilers should be placed in spoiler tags as such:|[spoiler]|(spoiler goes here)|[/spoiler]|Note|: Unlike reviews, comments are considered temporary and may be deleted/purged without notice.|jjmia|23 Jan 2020 02:45 GMT|His most underrated album. Better and more focused than Zinc Alloy|report|reported|crackitydjango|24 Jun 07:33 GMT|*Listens to Gary Glitter and Sweet for a month* *Snorts a line of cocaine* *Adjusts jumpsuit and roller skates* *Fix up the old mascara* *Warm up the amps* *Invite your closest friends over to clap into a microphone* Alright gang, let's rock!|report|reported|Log in to add a comment|Discussion|RYM Artists/Bands Top 20 Thread #132: T. Rex (incl. Tyrannosaurus Rex)|Music Polls/Games|Each artist's best song from each of their albums|Music Polls/Games|Your favorite songs from albums you've rated 2.0 or worse|Music|Baker's Dozen-Albums|Music Polls/Games|The Album Title show|Music Polls/Games|Unpopular musical opinions.|Music|Subscribe to see similar release suggestions|ADVERTISEMENT|Contributions|Contributors to this release:|hotlove|,|PierT|,|jkra3168|,|fixbutte|,|unj|,|jg_|,|alcamus|,|Kronz|Log in|to submit a correction or upload art for this release|.|.|.|.|ADVERTISEMENT|Close|Close|Rate Your Music|© 2000-2023 Sonemic, Inc.|Site links|RYM Network|RYM|music|Sonemic|new music site (beta)|Cinemos|film (beta)|Glitchwave|video games (beta)|Info|FAQ|Development status|RYMzilla|Submissions|Policy|Database standards|Privacy|Consent|Terms of service|Contact us|Support / Feedback",
          "|It would be easy to dismiss \"Bolan's Zip Gun\" as a misfire, his only album in the 70's to miss the charts completely. Yes, it misses the production talent of Tony Visconti and the songs are a level or three below those of his early 70's heyday.|Unlike his contemporaries Bowie and Ferry, Bolan was never granted respected album-maker status so that when the TRextasy of his teenyboppers abated, he found himself in an artistic cul-de-sac and his commercial prospects greatly diminished.|To do him fair, he just ploughed on and kept going right up until his tragically early death only a couple of years later but this particular record finds him betwixt and between in no Marc's Land, lacking in inspiration and consistency. The guy who'd produced some of the best riffs of the decade (\"Get It On\", \"Telegram Sam' and \"20th Century Boy\", to name but three) is instead flailing about hoping another heavy one will land on him but it's more ifs than riffs, I'm sorry to say.|The album-bookending singles are okay, the cheery but lightweight \"Light Of Love\" and the punchier, keyboard-driven \"Zip Gun Boogie\" but in between there's more effort than excellence on display. You do miss Visconti's magical way especially with strings as a good number of the tracks sound underpowered, undeedeveloped and yes, under-produced, there's barely a string arrangement or horns break to provide a point of difference never mind excitement to the songs.|Perhaps the more stripped-back sound reflects a conscious decision by Bolan himself as producer but the songs are mostly slight with often trite lyrics and little of the love-him-or-hate-him cocksure confidence which carried him through his initial success.|That said, a little elfin magic goes a long way and you can hear him striving for inspiration throughout, throwing everything at the wall and hoping something might stick but in the end the material just fails to excite. Choruses are repeated over and over to often basic arrangements with too many songs given over to the over-loud female backing singers, who prominently included his future wife Gloria Jones.|\"Solid Baby\" sounds like a rewrite of Roy Orbison's \"Dream Baby\", ditto \"Token Of My Love\" and Phil Phillips's \"Sea Of Love\" right down to re-using its opening line while Bolan would never admit that his \"Precious Star\" seems to crib from friend-turned-rival David Bowie's \"The Prettiest Star\". He also can't resist referencing Bowie's \"Diamond Dogs\" in|\"I Really Love You Babe\", the track where I just about offered up my aural submission to his caterwauling choir.|Others like \"Space Boss\", \"Think Zinc\" and \"Girl in the Thunderbolt Suit\" sound like choruses in search of songs and even though \"Til Dawn\" and \"Golden Belt\" both aim for something heavier they likewise struggle to really deliver.|You had to feel for Bolan at this stage of his career, seeing Bowie and Ferry at the time achieve the artistic integrity and respectability never mind record sales denied to him. To be frank, this record didn't deserve much more than it got both from the critics and the public but better was to come from the Bopping Elf before he met his sad end in early 1977.|Published|ADVERTISEMENT|Walter12|Mar 05 2022|▼|A1|Light of Love|A2|Solid Baby|A3|Precious Star|A4|Token of My Love|A5|Space Boss|A6|Think Zinc|B1|Till Dawn|B2|Girl in the Thunderbolt Suit|B3|I Really Love You Babe|B4|Golden Belt|B5|Zip Gun Boogie|Glam has always been a divisive genre, with unsympathetic listeners deriding most glam rock as \"trashy\" and self-consciously \"kitsch\".  Such accusations are especially common with a band like T. Rex, whose comparatively unambitious approach is easy to dismiss as repetitive or downright naïve.  Now, I have little doubt that a purposefully unsophisticated sound was on Marc Bolan's mind when he founded glam rock back in 1971, but that doesn't mean that I'd categorize the bulk of T. Rex's discography as kitsch.  The one place where this hesitancy fades is with respect to|Bolan's Zip Gun|.  Widely considered to be the nadir of Bolan's glam rock phase, it's a record where all of T. Rex's least endearing aspects take center stage.  The end result isn't quite a disaster, but it routinely crosses the boundary into trashy mediocrity.  An utterly superfluous record for someone who isn't already a devoted T. Rex fan.|Bolan's Zip Gun|expands upon the stylistic \"innovations\" of|Zinc Alloy|while ditching its predecessor's overblown, wall-of-sound production.  Every track here still qualifies as straightforward glam rock, with T. Rex's usual supply of toe-tapping grooves and elfin vocals, but Bolan has continued to pile on bits of soul and funk.  These developments are epitomized in the backing vocals of Gloria Jones- Bolan's real-life partner, and by this point an essential component in his songwriting process.  Jones' full-throated vocals repeatedly crowd out Bolan's more understated contributions, to the degree that many tracks border on becoming full-blown duets.|Bolan's Zip Gun|also features more saxophone than any previous T. Rex release, whereas the electric guitar (when it actually appears) is sometimes distorted to such a degree that it's difficult to distinguish from saxophone.  Rounding out the overall vibe are a collection of vocal melodies that are simplistic even by T. Rex standards, with \"choruses\" than often involve little more than repeating a single phrase with minor difference in inflection.|As I've stated in earlier T. Rex reviews, I'm not openly averse to Bolan's infatuation with funk and soul infatuations, but I'm repeatedly underwhelmed by how Bolan actually implements those touches.|Bolan's Zip Gun|only accentuates many of Bolan's worst habits with respect to the style.  In particular, I'm routinely bothered by Jones' backing vocals.  She's always way too far up in the mix, and she repeatedly opts for a shrill tone that clashes with Bolan's understated delivery.  Nearly as frustrating is the fact that all those toe-tapping grooves seem to have convinced Bolan that his vocal melodies don't require melodic development.  Many of the album's vocal melodies are built around a catchy hook, but then Bolan absolutely beats that hook to death.  The only way that|Bolan's Zip Gun|represents an improvement over|Zinc Alloy|is via its crisper production, which harkens all of the way back to|Electric Warrior|.  Bolan has come a long way as a producer since|Zinc Alloy|, even if I'm sure that he would've been far better off with Tony Visconti in the production studio.|Bolan's Zip Gun|also features fewer great tracks than any other T. Rex record of the decade.  This lack of highlights extends all of the way up to the album's lead single, \"Light of Love\".  I simply can't understand the appeal of that track, either from a glam perspective or a pop soul perspective, seeing as I find it's repetitive vocal hook to be borderline-annoying.  Arguably Bolan's weakest single that charted relatively well.  The album's other single, \"Zip Gun Boogie\", is far more entertaining but still pales in comparison to most T. Rex hits.  Alongside \"Space Boss\" and \"Think Zinc\", \"Zip Gun Boogie\" is also one of the tracks off|Bolan's Zip Gun|were Bolan fully gives succumbs to unapologetic kitsch.  A guilty pleasure, perhaps, but little more.  The rest of|Bolan's Zip Gun|is consistently listenable but never great.  My (apparently unconventional) choice for the album's best deep cut is \"Girl in the Thunderbolt Suit\"- an interesting mix of rock 'n roll with pop soul that features more vocal swagger than anything else here.  \"Solid Baby\", \"Think Zinc\", and \"I Really Love You Babe\" are also worthy of mention, but none of these tracks invite repeated listening.|I suppose it's a testament to Bolan's talent that even the weakest (mature) record of his career is still semi-engaging enough to warrant 2.5 stars.  Just don't mistake this admission for an endorsement.|Bolan's Zip Gun|is still utterly inessential, even by the incredibly modest standard of other 2.5-star albums in my 70's rock collection.  Luckily, Bolan would subsequently recover some semblance of his mojo on|Futuristic Dragon|, leaving|Bolan's Zip Gun|as the sole T. Rex album in the 2.5-star tier.|5.3/10|Published|Castrovalva|Jan 24 2021|The most common take on this album is that it is Bolan's absolute nadir, was recorded when he was a fat, bloated drug addict, and is packed with derivative, nonsensical garbage that squanders his talent. Everyone is wrong - 'Bolan's Zip Gun' is a fucking GREAT record, and kicks off the final arc of his career, after the slump into the excessive lunacy of the 'Zinc Alloy' era. Here, T.Rex is completely stripped back and lean, and the glam/soul fusion actually works really well. 'Light Of Love' is classic T.Rex, 'Solid Baby'  is lean and randy, and on 'Token Of My Love', Bolan manages to merge his twiddly guitar antics with the screaming vocals of Gloria Jones to extremely impressive effect. Gloria is still waaaay high in the mix here, but she's less obnoxious than on 'Zinc Alloy', and some attempt seems to have been made to fold her into the sound, rather than letting her sit on top. Produced by Bolan, the lack of Visconti's hand doesn't destroy this material - the sound is leaner, starker, and harder. It's definitely a different direction, but it's fucking great.|The two tracks that I really love from this one are 'Zip Gun Boogie' and 'Golden Belt'. 'Zip Gun Boogie' pairs one of the best hard rock riffs that Bolan would ever right, with an excellent 'The Groover'-esque verse. That descending, crunchy lead line in the intro and chorus - it's just awesome. And, 'Golden Belt' is a soul/funk jam full of tinkling pianos, suspended chords, and great use made of Gloria's vocals. So, ignore all of the people who ran this album down for the last 40 years - THIS, and not 'Futuristic Dragon', is the ACTUAL rebirth of T.Rex, and kicks off Bolan's remarkable late 70's comeback as one of the architects of punk.|Published|Balance005|Jan 07 2019|Bolan : 10/12|The album is often seen as a career nadir. Bolan eventually admitted the record was a failure, saying it was completely over-produced and the worst he made. Even if it is, the fact that Bolan's career lasted only about 10 years makes that not such a huge statement. Thinking about it i'm not really sure i'd take \"Prophets...\" over that one. Anyway what i meant to say was simply that the album is not that bad at all. Bolan's Zip Gun can be either fun (most of the songs are pleasantly funny, even the stupid Zip Gun Boogie) or irritating because of the production and bad tastes (Zip Gun Boogie, Space Boss...). There is less violins than in Zinc Alloy, probably because Visconti is gone (he worked on Till Dawn though). The female backing vocals remain very intrusive, you have to be prepared for that.  To put it simply, when i want my T. Rex to be shiny, fun and easy, i can put that one and appreciate it. It's a bit inconsequential and hard to digest but it's also awkwardly fun. There is some life in it that's for sure. A short and sweet listening experience as far as i'm concerned.|Published|GARFIELDACRES|Mar 23 2017|Carries on from 'zinc alloy' really,with marc continuing to add his own spin on funk and disco to his sound. The songs are nearly all pretty repetitive and mostly lacking in magic,and lacking on the kind of smooth rhythms and grooves that bowie managed with 'young americans' for instance. Bolan had taken over production too,and the sound badly misses tony visconti's touch.|That said it's probably slightly more listenable than 'zinc alloy' and boasts a couple of very decent tracks in 'zip gun boogie' and 'til dawn'... the latter frustratingly being the only occasion here where it sounds like he was capable of achieving the kind of music he was clearly after here.|Published|Warthur|Oct 17 2012|Bolan's Zip Gun continues the approach of Zinc Alloy and the Hidden Riders of Tomorrow when it comes to fusing soul with the glam rock sound, though less successfully - in particular, I kind of miss the bombastic over-the-top production job the previous album had. Light of Love is charming, and Think Zinc is an engaging enough stomper, but a lot of the songs on here (including the entire second side) are just kind of forgettable. It's not a bad album and T. Rex fans will find reasons to enjoy it, but at the same time I think it might be their least successful studio albums if you discount posthumous material. Now, if I could only get the refrain from Think Zinc out of my head...|Published|Page|1|2|3|4|>>|Votes are used to help determine the most interesting content on RYM.|Vote up content that is on-topic, within the rules/guidelines, and will likely stay relevant long-term.|Vote down content which breaks the rules.|Catalog|Ratings:|618|Cataloged:|453|Track rating sets:|Track ratings:|34|Rating distribution|Rating trend|Page|1|2|..|4|..|8|..|12|..|16|..|21|..|25|..|29|..|33|..|37|..|42|>>|28 Jun 2023|juantovar|Vinyl|26 Jun 2023|Redknot52|29 May 2023|BreakOut|Really good|29 May 2023|IdkSomethingformymami|26 May 2023|salone|Pleasurable Feelings|25 May 2023|Lejink|17 May 2023|Pokermask|16 May 2023|Piggy_Better|11 May 2023|themoviejudge|3 May 2023|MordoGoodIGuess|Barnes & Noble Record Aisle|2 May 2023|BlackMidiIsMid|Thom Yorke (Matt Bellamy)|2 May 2023|feloniousPUNK|26 Apr 2023|HermitCook|Bad|17 Apr 2023|leonardohiei|13 Apr 2023|Jamie_Spraggon|CD|Below Average|.|.|.|.|Previous|Next|Light of Love|Futuristic Dragon|ADVERTISEMENT|Track listing|A1|Light of Love|3:15|A2|Solid Baby|2:36|A3|Precious Star|2:51|A4|Token of My Love|3:39|A5|Space Boss|2:47|A6|Think Zinc|3:20|B1|Till Dawn|3:01|B2|Girl in the Thunderbolt Suit|2:19|B3|I Really Love You Babe|3:31|B4|Golden Belt|2:39|B5|Zip Gun Boogie|3:18|Total length: 33:16|Credits|Marc Bolan|writer|,|producer|,|vocals|,|guitar|Steve Currie|bass|Gloria Jones|vocals|,|Clavinet|David Lutton|drums|Dino Dines|keyboards|Mickey Finn|percussion|Keith Morris|photography|John Kosh|artwork|59 Lists|1975 Top LPS|popandcircumstance|THE BEST OF T.REX|mehhem|A Road to Hell... The Greatest Misses ( by Artists I usually like or even love ! )|rupertlenz|Best Bolan Boogie|popandcircumstance|70s|Gullian|\"All Schools are Strange\": Marc Bolan Roop's Top 150 Songs...|rupertlenz|MY TOP 85 ALBUMS for 1975... so far|artxploiters|A Listener's Diary 2017|yerblues|Cover Art by Kosh|misterteeth|Complete Collection|kenjah|Рок-1975|AlexVox|1975 - The Best of (According to Jake)|jakelicious|Music on Vinyl: LP's From 1960 to 1979|chuchi|My least favourite studio album by some of my favorite artists (often not easy to decide!)|Communique|1975|kenjah|Virtual Crate-Digging: Every Album in My Library|DonRaoul|See all 59 lists|Comments|Rules for comments|Be respectful!  All the community rules apply here.|Keep your comments focused on the release.  Don't post randomness/off-topic comments.   Jokes are fine, but don't post tactless/inappropriate ones.|Don't get in arguments with people here, or start long discussions.  Use the boards for extended discussion.|Don't use this space to complain about the average rating, chart position, genre voting,  others' reviews or ratings, or errors on the page.|Don't comment just to troll/provoke.  Likewise, don't respond to trollish comments; just report them and ignore them.|Any spoilers should be placed in spoiler tags as such:|[spoiler]|(spoiler goes here)|[/spoiler]|Note|: Unlike reviews, comments are considered temporary and may be deleted/purged without notice.|jjmia|23 Jan 2020 02:45 GMT|His most underrated album. Better and more focused than Zinc Alloy|report|reported|crackitydjango|24 Jun 07:33 GMT|*Listens to Gary Glitter and Sweet for a month* *Snorts a line of cocaine* *Adjusts jumpsuit and roller skates* *Fix up the old mascara* *Warm up the amps* *Invite your closest friends over to clap into a microphone* Alright gang, let's rock!|report|reported|Log in to add a comment|Discussion|RYM Artists/Bands Top 20 Thread #132: T. Rex (incl. Tyrannosaurus Rex)|Music Polls/Games|Each artist's best song from each of their albums|Music Polls/Games|Your favorite songs from albums you've rated 2.0 or worse|Music|Baker's Dozen-Albums|Music Polls/Games|The Album Title show|Music Polls/Games|Unpopular musical opinions.|Music|Subscribe to see similar release suggestions|ADVERTISEMENT|Contributions|Contributors to this release:|hotlove|,|PierT|,|jkra3168|,|fixbutte|,|unj|,|jg_|,|alcamus|,|Kronz|Log in|to submit a correction or upload art for this release|.|.|.|.|ADVERTISEMENT|Close|Close|Rate Your Music|© 2000-2023 Sonemic, Inc.|Site links|RYM Network|RYM|music|Sonemic|new music site (beta)|Cinemos|film (beta)|Glitchwave|video games (beta)|Info|FAQ|Development status|RYMzilla|Submissions|Policy|Database standards|Privacy|Consent|Terms of service|Contact us|Support / Feedback"
        ],
        "image_links": [
          "//e.snmc.io/i/600/w/42d63fc76ea602a0656911405656bb52/1905646/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/42d63fc76ea602a0656911405656bb52/1905646/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/8da53aea6309312495f7bfdbec9d2a9c/5159473/marc-bolan-and-t-rex-a-creamed-cage-in-august-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/8da53aea6309312495f7bfdbec9d2a9c/5159473/marc-bolan-and-t-rex-a-creamed-cage-in-august-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/3ec6d34a5e56570ffdd464baa86ce05b/5137806/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/3ec6d34a5e56570ffdd464baa86ce05b/5137806/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/e5754c5fb129bbe0831511f48e2a642b/5159465/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/e5754c5fb129bbe0831511f48e2a642b/5159465/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/d0b1dda10ef1971a4f0257e93577f55d/3067377/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-or-a-creamed-cage-in-august-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/d0b1dda10ef1971a4f0257e93577f55d/3067377/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-or-a-creamed-cage-in-august-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/5cf99d0c2f62f8f45264657aeb95e5a2/2594799/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/5cf99d0c2f62f8f45264657aeb95e5a2/2594799/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/932cc3d2338b767c8daf7cbe07f8aa7d/2625617/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/932cc3d2338b767c8daf7cbe07f8aa7d/2625617/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNkYAAAAAYAAjCB0C8AAAAASUVORK5CYII=",
          "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNkYAAAAAYAAjCB0C8AAAAASUVORK5CYII=",
          "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNkYAAAAAYAAjCB0C8AAAAASUVORK5CYII=",
          "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNkYAAAAAYAAjCB0C8AAAAASUVORK5CYII=",
          "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNkYAAAAAYAAjCB0C8AAAAASUVORK5CYII=",
          "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNkYAAAAAYAAjCB0C8AAAAASUVORK5CYII=",
          "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNkYAAAAAYAAjCB0C8AAAAASUVORK5CYII=",
          "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNkYAAAAAYAAjCB0C8AAAAASUVORK5CYII=",
          "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNkYAAAAAYAAjCB0C8AAAAASUVORK5CYII=",
          "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNkYAAAAAYAAjCB0C8AAAAASUVORK5CYII=",
          "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mNkYAAAAAYAAjCB0C8AAAAASUVORK5CYII=",
          "//e.snmc.io/i/600/w/667d6f0fda60ca37a1009680cd13f480/2176558/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/667d6f0fda60ca37a1009680cd13f480/2176558/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/1c17972cc422ecdf803c9328ac615c28/2784432/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/1c17972cc422ecdf803c9328ac615c28/2784432/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/ec857d69e9f93154a92a5f9b82184ab3/2548260/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/ec857d69e9f93154a92a5f9b82184ab3/2548260/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/eed66591373bce2e11d2f1f938f47fce/2713746/marc-bolan-and-t-rex-change-the-alternate-zinc-alloy-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/eed66591373bce2e11d2f1f938f47fce/2713746/marc-bolan-and-t-rex-change-the-alternate-zinc-alloy-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/d4f9db09c451cb0c5c77d7e5f1e1d28c/2482250/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/d4f9db09c451cb0c5c77d7e5f1e1d28c/2482250/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/35264031ff2aaa95a3e7cc6ce7503079/2919293/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/35264031ff2aaa95a3e7cc6ce7503079/2919293/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/f9de996b03cad91ab1916e62ae7a5b37/2280100/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/f9de996b03cad91ab1916e62ae7a5b37/2280100/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/b2937c710e5f84ce196d1535a096bbfe/9352266/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/b2937c710e5f84ce196d1535a096bbfe/9352266/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/f26a2ab5505904cbdea3bd9ee6a6f61b/2094153/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/f26a2ab5505904cbdea3bd9ee6a6f61b/2094153/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/9684d5cead29060627f7750bf78e5099/4722833/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/9684d5cead29060627f7750bf78e5099/4722833/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/830c9cc816ebc8f04dfe16fe81862933/2785535/marc-bolan-the-beginning-of-doves-cover-art.jpg",
          "//e.snmc.io/i/600/w/830c9cc816ebc8f04dfe16fe81862933/2785535/marc-bolan-the-beginning-of-doves-cover-art.jpg",
          "//e.snmc.io/i/600/w/42d63fc76ea602a0656911405656bb52/1905646/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/42d63fc76ea602a0656911405656bb52/1905646/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/42d63fc76ea602a0656911405656bb52/1905646/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/42d63fc76ea602a0656911405656bb52/1905646/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/42d63fc76ea602a0656911405656bb52/1905646/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/42d63fc76ea602a0656911405656bb52/1905646/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/42d63fc76ea602a0656911405656bb52/1905646/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/42d63fc76ea602a0656911405656bb52/1905646/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/42d63fc76ea602a0656911405656bb52/1905646/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/42d63fc76ea602a0656911405656bb52/1905646/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/42d63fc76ea602a0656911405656bb52/1905646/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/42d63fc76ea602a0656911405656bb52/1905646/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/42d63fc76ea602a0656911405656bb52/1905646/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/2.5/img/images/blank.png",
          "//e.snmc.io/i/600/w/42d63fc76ea602a0656911405656bb52/1905646/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/42d63fc76ea602a0656911405656bb52/1905646/marc-bolan-and-t-rex-zinc-alloy-and-the-hidden-riders-of-tomorrow-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/45ba3b82c1647d23b1dc387d486141fb/1905649/t-rex-bolans-zip-gun-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/45ba3b82c1647d23b1dc387d486141fb/1905649/t-rex-bolans-zip-gun-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/45ba3b82c1647d23b1dc387d486141fb/1905649/t-rex-bolans-zip-gun-Cover-Art.jpg",
          "//e.snmc.io/i/600/w/45ba3b82c1647d23b1dc387d486141fb/1905649/t-rex-bolans-zip-gun-Cover-Art.jpg",
          "//e.snmc.io/2.5/img/images/blank.png"
        ]
      }
    }
  }
}